{
  //The first line refers to the code, the second line is what the players see. Translators should create a copy of this json file, rename it to the appropriate i18n name for their language, and edit the second line in quotes. They now no longer need any files besides the i18n in their own mod, or you can add the translated i18n jsons to the mod's main i18n folder to make translation significantly more accessible to players.
  //use ctrl + F to find different sections, as this document is quite long.

  //Config Schema for GMCM.
  "config.section.Dialogue.name": "NPC Dialogue Settings",
  "config.section.Dialogue.description": "Toggle specific NPCs new dialogue on/off",
  "config.section.Misc.name": "Other Settings",
  "config.section.Misc.description": "Toggle other additions on/off",
  "config.CDE_Abigail.name": "Abigail",
  "config.CDE_Alex.name": "Alex",
  "config.CDE_Birdie.name": "Birdie",
  "config.CDE_Caroline.name": "Caroline",
  "config.CDE_Clint.name": "Clint",
  "config.CDE_Demetrius.name": "Demetrius",
  "config.CDE_Dwarf.name": "Dwarf",
  "config.CDE_Elliott.name": "Elliott",
  "config.CDE_Emily.name": "Emily",
  "config.CDE_Evelyn.name": "Evelyn",
  "config.CDE_George.name": "George",
  "config.CDE_Gus.name": "Gus",
  "config.CDE_Haley.name": "Haley",
  "config.CDE_Harvey.name": "Harvey",
  "config.CDE_Jas.name": "Jas",
  "config.CDE_Jodi.name": "Jodi",
  "config.CDE_Kent.name": "Kent",
  "config.CDE_Krobus.name": "Krobus",
  "config.CDE_Leah.name": "Leah",
  "config.CDE_Leo.name": "Leo",
  "config.CDE_Lewis.name": "Lewis",
  "config.CDE_Linus.name": "Linus",
  "config.CDE_Marnie.name": "Marnie",
  "config.CDE_Maru.name": "Maru",
  "config.CDE_Pam.name": "Pam",
  "config.CDE_Penny.name": "Penny",
  "config.CDE_Pierre.name": "Pierre",
  "config.CDE_Robin.name": "Robin",
  "config.CDE_Sam.name": "Sam",
  "config.CDE_Sandy.name": "Sandy",
  "config.CDE_Sebastian.name": "Sebastian",
  "config.CDE_Shane.name": "Shane",
  "config.CDE_Vincent.name": "Vincent",
  "config.CDE_Willy.name": "Willy",
  "config.CDE_Wizard.name": "Wizard",
  "config.CDE_Festivals.name": "Festivals",
  "config.CDE_Festivals.description": "adds new dialogue to year 3 and from year 5 onward",

  //NPC Dialogue

  //Abigail
  //Abigail's Gift Tastes
  "CDE_Abigail_GoldPumpkin": "No way! Is that-?$7#$b#You actually found the gold pumpkin!$h#$e#@, you are so cool. I mean it!$l",
  "CDE_Abigail_RockCandy": "That looks delicious! *crunch*#$b#Hm, not as crunchy as some I've tried, but I feel ready to take on the world! Let's go!$h",
  "CDE_Abigail_PrismaticShard": "Wow! You've been doing some serious adventuring! Where on earth did you find this?$h",
  "CDE_Abigail_RabbitsFoot": "This is great! I can hang this on the handle of one of my katanas!",
  "CDE_Abigail_BananaPudding": "Oh my god, homemade pudding? Yes please!#$e#Getting good bananas must've been quite the adventure.$h",
  "CDE_Abigail_BlackberryCobbler": "This! ...This is the official flavor of fall!#$b#It's like Spirit's Eve on a plate! Thank you so much!$h",
  "CDE_Abigail_ChocolateCake": "Are you for real? You're the kind of person who just shows up with free cake?$h#$b#*sniff* Mmmm, and the best kind of cake, at that!",
  "CDE_Abigail_Pufferfish": "Heeheehee! Look at this brave little guy!$h#$b#Look at those spikes! Mr. fierce warrior, he is!",
  "CDE_Abigail_Pumpkin": "That is one perfectly plump pumpkin! Thank you so much!$h#$b#I'm gonna carve it, toast the seeds, use the guts for... something.#$b#This is exciting!$h",
  "CDE_Abigail_SpicyEel": "No way! You got me some mega ultra eel? That's my favorite kind of eel!$h",

  //Abigail's Misc Dialogue
  //these lines target files other than the standard characters/dialogue/npc location such as unmarried rainy dialogue
  "CDE_Abigail_rainy_1": "The valley looks more interesting in the rain... don't you think?",
  "CDE_Abigail_rainy_2": "The lake's a beautiful place to visit when the weather's like this.",

  //Abigail's Standard Dialogue
  //date specific dialogue
  //to keep consistency with other tokens, i've removed the _ from date specific tokens and heart specific tokens, so that the key identifier is grouped within one segment. (_summer_6 became _summer6)
  //don't forget that y2 means every year after as well. if a dialogue only appears in y1 i've marked it as such, otherwise the tokens are not year specific.
  "CDE_Abigail_spring1y2": "Staying up until midnight used to be more fun when I was a kid.#$b#Seems like I do that all the time these days.#$e#Oh yeah, happy new year!",
  "CDE_Abigail_spring12": "I'm definitely going to enter the egg hunt tomorrow. Are you?",

  "CDE_Abigail_summer6y1": "I went to the beach last night, after dark... Sometimes you can see strange lights bobbing over the sea.#$e#Or maybe that was just a dream I had... It doesn't feel real anymore.",
  "CDE_Abigail_summer10": "Everyone's excited for the luau tomorrow. Maybe a little nervous, too, considering the Governor will be here.",
  "CDE_Abigail_summer27": "You can't miss tomorrow's festival. It's one of the most beautiful wonders of the valley.",

  "CDE_Abigail_fall26y1": "Will I see you tomorrow at the Spirit's Eve festival? Look for me in the haunted maze.$h",
  "CDE_Abigail_fall26y2": "I'll give the haunted maze another shot this year. There just better not be any spiders.",

  "CDE_Abigail_winter7": "I'm looking forward to making a snowman tomorrow.",
  "CDE_Abigail_winter24y1": "I'm going to eat so much cranberry sauce tomorrow.$h",
  "CDE_Abigail_winter24y2": "Tomorrow'll be a good day. What's not to love about the food?#$e#It actually makes me want to spend some time with my parents. It's just a good time for it, you know?",
  "CDE_Abigail_winter28": "Hey! Are you going to stay up until midnight?#$e#Oh, that's right, you have to get up early tomorrow just like any day...",

  //heart specific dialogue
  "CDE_Abigail_summerMon8": "I used to think Pelican Town was kinda drab, but lately I'm starting to love some things about it.$h",
  "CDE_Abigail_summerMon6": "My pet guinea pig, David, just hates this hot weather. He's fussy.",
  "CDE_Abigail_summerMon4": "'Journey of the Prairie King' is still driving me crazy.#$e#I tend to stick more to RPGs. Maybe that's why I'm not the best at shooters.",
  "CDE_Abigail_summerMon2": "$d joja#I try to help out in the shop on most days. Business has been pretty bad since the JojaMart opened, though.|Ever since JojaMart shut down we've been doing great at the shop!$h",
  "CDE_Abigail_summerTue10": "Dad sometimes calls you his 'business partner.'$u#$b#He is going to freak when he finds out about the two of us hanging out.$h",
  "CDE_Abigail_summerTue6": "You're an interesting person, @. I'm glad you moved here.$h",
  "CDE_Abigail_summerTue4": "I do what I can to help with the store. It's not my favorite, but I figure I have to do at least a little something.",
  "CDE_Abigail_summerTue2": "I can play the flute, but I only play when the mood strikes me right.#$e#The lake up north is a good spot for it.",
  "CDE_Abigail_summerWed10": "Your farmhouse is really beautiful.#$e#Walking by it, I just get a sense of its history, its soul, like I'm nostalgic for an experience I haven't had yet.",
  "CDE_Abigail_summerThu8": "I read that there's a section of the mines that's frozen over. Doesn't that sound nice, right about now?#$e#It'd be like stepping into a big freezer.",
  "CDE_Abigail_summerWed4": "I would love to live in an old farmhouse like you.#$b#The creak of a floorboard, the slow plumes of dust whispering through the rafters... There's something special about an old building, isn't there?",
  "CDE_Abigail_summerWed2": "Online classes are fine. I much prefer it to having to drive all the way to campus.#$e#Plus, I'm not a big fan of packing myself into a classroom with a bunch of weird people.",
  "CDE_Abigail_summerThu10": "Wow, you look nice today.#$e#I mean, that summer air is really good for the complexion, isn't it?... heh...$l",
  "CDE_Abigail_summerFri10": "Do you ever get lonely on your farm?",
  "CDE_Abigail_summerFri8": "If I had a cat, I'd spoil the heck out of him.#$e#House cats should be appropriately chunky, don't you think?",
  "CDE_Abigail_summerFri6": "If I ever get reincarnated, I'd want to be a cat in my next life. They've really got it figured out.",
  "CDE_Abigail_summerFri4": "I kind of wish I had a cat. Unfortunately, my Dad is allergic to pretty much everything.",
  "CDE_Abigail_summerFri2": "Sebastian's a few years older than I am, but he's one of the few people who actually gets me.",
  "CDE_Abigail_summerSat10": "This might be the best summer of my life.$l#$e#But getting to spend time with you in the fall sounds even better.$l",
  "CDE_Abigail_summerSat6": "I'm actually enjoying myself this summer.$h#$e#It's funny how quickly one's outlook can change.",
  "CDE_Abigail_summerSat4": "What's your favorite part about fall?#$e#For me, it's just everything that's not... all of this. What we have right now.",
  "CDE_Abigail_summerSun6": "My parents aren't terrible people. I just feel like they're keeping me stuck in the life of a child.$u#$e#I mean, you've got your farm. You can do whatever you want.#$e#I just feel like I'm meant for more than what I have.",

  "CDE_Abigail_fallMon8": "You know, I could actually see myself becoming a farmer someday...#$e#But how would that ever happen? *chuckle*$l",
  "CDE_Abigail_fallMon6": "Haha, see? I don't hate the outdoors. It just has to be the way I like it.$h",
  "CDE_Abigail_fallMon4": "I need to get some good use out of this season while it lasts. It's a good day to be outside.",
  "CDE_Abigail_fallTue8": "$d joja#Why the heck did my parents decide to move to a small town if it was just going to be more stressful for them?$a|I heard my dad put on quite a show at the Community Center, right when it was restored. I wish I could've seen it.$h",
  "CDE_Abigail_fallTue4": "$d joja#Dad's really stressed about the store lately. He's been all passive aggressive, taking it out on me and Mom.$s|With JojaMart gone, it's actually really nice to see Dad in a positive mood more often.$h",
  "CDE_Abigail_fallTue2": "Sebastian's basically my best friend. I don't know what I'd do without him.#$e#We pretty much grew up together.",
  "CDE_Abigail_fallWed10": "Dad sometimes calls you his 'business partner.'$u#$b#He is going to freak out when he learns about the two of us.$h",
  "CDE_Abigail_fallWed8": "I wonder if they'll let me design some of the features in the Spirit's Eve maze someday.#$e#I've got some ideas I've sketched. I just don't know who even to show them to.",
  "CDE_Abigail_fallWed4": "Are you growing pumpkins on your farm this year?#$e#Save one for me!$h",
  "CDE_Abigail_fallThu10": "I had an interesting dream last night, with you in it.#$e#It was a good dream.$h",
  "CDE_Abigail_fallThu8": "I've often wondered if one day, I'll wake up and realize that the reality I knew was just a dream.#$e#But these days, I don't really hope that's the case.$l",
  "CDE_Abigail_fallThu6": "#$1 AbigailHAND#Last night I dreamt that my left hand had turned into a gigantic %noun. Does that mean anything?#$e#%Abigail doesn't seem to be interested in talking right now.",
  "CDE_Abigail_fallThu4": "Sebastian's a few years older than I am, but he's one of the few people who actually gets me.#$e#Well, and you and Sam sort of do, too.$h",
  "CDE_Abigail_fallFri10": "I usually feel lonely this time of year, but not anymore.$l#$e#@, what are your plans for the future?",
  "CDE_Abigail_fallFri6": "I wish the season lasted a little longer.$8#$e#When the wind really picks up, I almost feel like a kid again.",
  "CDE_Abigail_fallSat8": "Oh! Did I tell you? I finally beat 'Prairie King.' Took long enough, huh?$h#$e#Then it starts over in hard mode. Getting past the first level of that is my new project.$u",
  "CDE_Abigail_fallSat6": "Hi.$h#$e#Your hair looks cool today... did you do something different?",
  "CDE_Abigail_fallSun8": "Hmm... what should I do tonight?#$q 27/28 fall_Sun_old#I was thinking about dyeing my hair again... what do you think?#$r 27 10 Sun_27#Dye it black.#$r 27 10 Sun_27#Why not blonde?#$r 27 20 Sun_WildColor#How about bubblegum pink?#$r 28 0 Sun_28#I like your hair just the way it is!",
  "CDE_Abigail_fallSun6": "If it's an especially windy day, I like facing the wind directly and letting it blow back my hair.#$b#It's like facing some kind of immortal godbeast, or something. Just like, \"Rah! Bring it!\"$h",

  "CDE_Abigail_winterMon8": "When I was a kid, I built a pretty epic snow fort. I threw snowballs at just about everyone who passed by.#$e#For obvious reasons, my campaign didn't last long. Good times, though.",
  "CDE_Abigail_winterMon6": "It's just too cold to go outside much.#$e#But I do enjoy building a snowgoon.$h",
  "CDE_Abigail_winterMon4": "Maybe I should build a snow squidmonster. That'd be a nice change of pace.",
  "CDE_Abigail_winterTue10": "*hug* Hey you!$h#$e#Um... just tryin' to get warm!$l",
  "CDE_Abigail_winterTue8": "It's so cold, I wish we had a hot cup of cocoa to share.$h",
  "CDE_Abigail_winterTue6": "Oh! Did I tell you? I finally beat 'Prairie King.' Took long enough, huh?$h#$e#Then it starts over in hard mode. Getting past the first level of that is my new project.$u",
  "CDE_Abigail_winterTue4": "It's so cold, I wish we had a hot cup of cocoa to share.$h",
  "CDE_Abigail_winterWed10": "Do you ever get lonely on your farm?",
  "CDE_Abigail_winterWed6": "It must be nice not having crops to worry about this time of year.#$e#And that means you can hang out with me more often!$h",
  "CDE_Abigail_winterWed2": "Hi. If you're ever bored, you can always hang out in my room.#$e#As long as I'm not changing, of course!",
  "CDE_Abigail_winterThu10": "Another year is almost over...#$b#But this was a really good year, don't you think?$h",
  "CDE_Abigail_winterThu6": "When I was a kid, I always thought life was too long, because it's the longest thing you'll ever experience.#$b#...And all the old people who said otherwise were wrong. Now that I'm an adult, I sort of see what they mean.",
  "CDE_Abigail_winterThu4": "So, how deep have you gone in those mines, anyway?",
  "CDE_Abigail_winterFri10": "@, there's something I want to tell you...#$e#It's just... um... well... your boots! They, uh... look really clean... *gulp*#$e#That's all... *sigh*$s",
  "CDE_Abigail_winterFri8": "Do you ever worry that maybe all your hard work and effort might all be for nothing?$s#$e#Oh! I mean...! Not YOUR hard work. I just meant 'you' as in the general 'you.' No, don't worry. You're perfect.$l#$b#I mean...!$7#$b#Yeah, hope your day's going well!$h",
  "CDE_Abigail_winterFri4": "'Journey of the Prairie King' is still driving me crazy.#$e#I tend to stick more to RPGs. Maybe that's why I'm not the best at shooters.",
  "CDE_Abigail_winterSat10": "Thanks for not getting weirded out after the bit with the spirit board.$l#$e#I was seriously worried that you'd never talk to me again.$l",
  "CDE_Abigail_winterSat8": "I've been daydreaming a lot lately...#$e#Oh! You want to know what it's about? Well...$u#$b#...It's a secret.$h",
  "CDE_Abigail_winterSat6": "My favorite classes? Probably anthropology... or media arts...$u#$b#Don't know what I'd do with those for a career, though.",
  "CDE_Abigail_winterSun10": "Hey, if you ever want to come into my room, you can just walk right in.#$e#...You don't have to knock.$l",

  "CDE_Abigail_Mon6": "As I've gotten older, I've figured out a way to give my parents a pretty awesome death glare.#$e#I think they're legitimately afraid of it, on some level.$h",
  "CDE_Abigail_Mon4": "I'm getting an urge to visit the lake by Sebastian's house...#$b#...but it's only at its best when it's raining.",
  "CDE_Abigail_Tue8": "One of my online friends seems to get along so great with her parents.$s#$e#Is it normal for a girl my age to feel like I'm perpetually stuck in those early teenage years?$s",
  "CDE_Abigail_Tue6": "Hi, I'm glad to see you.$h#$e#I want to take my mind off things for a while... how is your day going?",
  "CDE_Abigail_Tue4": "Sometimes I wonder... are everyone's parents as out-of-touch as mine are?$s#$e#Seems like their idea of a girl being adventurous is to try on a new dress or something.$u",
  "CDE_Abigail_Wed10": "If I ever have kids, I'm making sure they get to be who they want to be.#$e#Even if their lives are completely different from what I expect, that'd be okay, right?",
  "CDE_Abigail_Wed8": "Which do you think is cooler: broadswords or katanas?#$e#I'm partial to both. I guess it just depends on the situation.",
  "CDE_Abigail_Wed6": "My favorite classes? Probably anthropology... or media arts...#$b#Don't know what I'd do with those for a career, though.",
  "CDE_Abigail_Wed2": "Oh, hi @. Taking a break from your work?#$e#Me too. Oh! Nothing physical... the classes I take are all online.",
  "CDE_Abigail_Thu10": "Hi.$l#$e#Do you feel like everything seems unreal lately?$l#$b#Not in a bad way, though.$h",
  "CDE_Abigail_Thu8": "I wonder if I would have turned out differently if I hadn't been born and raised in this little town.$u#$e#Do you ever think about other versions of yourself in alternate timelines?",
  "CDE_Abigail_Thu6": "I picked up how to play the drums pretty easily as a kid. My own set is in storage, though.#$e#Good thing Sam has some.",
  "CDE_Abigail_Thu4": "#$1 Abigail1#Oh no, I think my Dad's going to cook dinner tonight...$s#$e#I don't feel like doing anything today...$u",
  "CDE_Abigail_Thu2": "Sebastian's basically my best friend. I don't know what I'd do without him.#$e#We pretty much grew up together.",
  "CDE_Abigail_Fri8": "I've often wondered if one day, I'll wake up and realize that the reality I knew was just a dream.#$e#But these days, I don't really hope that's the case.$l",
  "CDE_Abigail_Fri6": "The birds were happily chirping today. They're too simple to understand the future.#$e#It's better to be like them, isn't it?",
  "CDE_Abigail_Fri4": "It's saloon night. Wanna join us this evening?#$e#I just like having all my friends in one place.",
  "CDE_Abigail_Fri2": "We're all going to hang out in the saloon this evening. It's kind of like a Friday tradition, I guess.",
  "CDE_Abigail_Sat10": "Dying one day and ceasing to exist didn't sound so bad before. But these days, the stakes seem too high.$l#$b#I don't want to lose what I have now.$l",
  "CDE_Abigail_Sat8": "How can non-existence be so bad if we're not around to experience it?#$e#It's not like I miss my 'life' from before I was born. It's probably the same after.",
  "CDE_Abigail_Sat6": "You came all this way to visit me? That's nice.$h#$e#So have you been exploring the mountain caves at all?#$e#Interesting. I'd like to go there myself one of these days.$l",
  "CDE_Abigail_Sat4": "$d joja#Dad's really stressed about the store lately. He's been all passive aggressive, taking it out on me and Mom.$s|With JojaMart gone, it's actually really nice to see Dad in a positive mood more often.$h",
  "CDE_Abigail_Sat2": "Ugh, so much homework to do this weekend.$s#$e#I've still got a few hours before the procrastination becomes risky, though.",

  //generic weekday dialogue
  "CDE_Abigail_springThu": "Ugh... I'm not in a good mood right now.$s#$e#I said I'm not in a good mood... what do you want?$a",
  "CDE_Abigail_fallTue": "$d joja#I try to help out in the shop on most days. Business has been pretty bad since the JojaMart opened, though.|Ever since JojaMart shut down we've been doing great at the shop!$h",

  //Abigail's Married Dialogue
  //weather specific dialogue
  "CDE_Abigail_Married_RainyDay_1": "I think I'll bust out my good ol' sketchbook today. I've got some ideas for mythical beasts that could be fun.",
  "CDE_Abigail_Married_RainyDay_2": "#The dark... the rain... it gets me excited.$l",
  "CDE_Abigail_Married_RainyDay_3": "Hey, remember when we played that duet by the lake? This weather reminds me of that day.#$e#$c .5#Do you still carry around that mini harp? That one kind of surprised me. Where'd you learn to play, anyway?#You really surprised me with that mini-harp... I never expected that. I guess that's why I like you so much.$l",
  "CDE_Abigail_Married_RainyDay_4": "Hey! I woke up early and did some exploring on my own. I found this and it reminded me of you. [768 767 769 66 82]#$e#$c .5#Where'd I find it at this ungodly early hour? Ooh, wouldn't YOU like to know?$h#Think you can find something better than that? I'm not so sure!$h",
  "CDE_Abigail_Married_RainyDay_5": "Hehe, I did some sword training in the rainy darkness. You've gotta admit, your wife is pretty epic.$h",
  "CDE_Abigail_Married_RainyDay_6": "#It might be a good day to visit the caves, huh? Just be careful out there, and if you go, bring a Life Elixir or two.",
  "CDE_Abigail_Married_RainyDay_7": "Is it getting kind of dusty in here? Don't worry, I'll take care of it.",
  "CDE_Abigail_Married_RainyDay_8": "Maybe I'll boot up Journey Of The Prairie King today... one of these days I swear I'll beat it fully.$h",

  "CDE_Abigail_Married_RainyNight_1": "The countryside looks more interesting on a day like this, don't you think?",
  "CDE_Abigail_Married_RainyNight_2": "I was just gazing out into the rainswept woods... I swear I saw something darker than black shifting around the trees.$6",
  "CDE_Abigail_Married_RainyNight_3": "It's a good night to see a ghost...",
  "CDE_Abigail_Married_RainyNight_4": "Have you been working hard? Y'know, you look so cute when you're a little exhausted. Here, let me help you relax.",
  "CDE_Abigail_Married_RainyNight_5": "Can you feel it? There's a stillness in the rain..",
  "CDE_Abigail_Married_RainyNight_6": "It's kind of funny how people pray for the rain to go away. I'm like, \"Dude, do you wanna live in a desert, then?\"",
  "CDE_Abigail_Married_RainyNight_7": "The sound of rain should put us right to sleep tonight.",
  "CDE_Abigail_Married_RainyNight_8": "On nights like this, I like to turn the light down low and just listen...$8",
  "CDE_Abigail_Married_RainyNight_9": "Aaaaand... soup surprise for you, my love! Enjoy! [199 218 219 727 730]$h",
  "CDE_Abigail_Married_RainyNight_10": "I felt like making some soup for dinner. I hope it's not too disgusting. [199 218 219 727 730]$h",

  "CDE_Abigail_Married_IndoorDay_1": "You're always so active. It's motivating just to watch you, because you always seem to care about whatever you're doing.",
  "CDE_Abigail_Married_IndoorDay_2": "I always loved this place, long before you moved in. Now I can explore the farm whenever I want!$h",
  "CDE_Abigail_Married_IndoorDay_3": "You'll never believe how I got my hands on this! But I figured you'd like it. [286 287 205 732 441]$h",
  "CDE_Abigail_Married_IndoorDay_4": "Hey. Heading out into the wild? I got you something...[286 287 205 732 441]#$e#Use that if you get into a tough spot. It should help keep you safe.",
  "CDE_Abigail_Married_IndoorDay_5": "Today might be a good day for me to slip away to the mines. Nothing too serious. Just for a little change of pace.#",
  "CDE_Abigail_Married_IndoorDay_6": "Heading to the mines? Hey... if you find something tasty, remember to bring me a piece!$h",
  "CDE_Abigail_Married_IndoorDay_7": "There's always something new happening on our farm... I love it.",
  "CDE_Abigail_Married_IndoorDay_8": "Hey! I'm just debating what I should do today. I'm not used to having this much freedom!",
  "CDE_Abigail_Married_IndoorDay_9": "Sure, I can do some cleaning today, no problem. It's actually kind of fun to clean up when I'm thinking about you.#",
  "CDE_Abigail_Married_IndoorDay_10": "You don't mind if I do some re-decorating now and then, do you? I'm still excited to have a place of my own to work on.",

  "CDE_Abigail_Married_IndoorNight_1": "Heyyy, what'd you do? Enchant me with a love spell, or something? You look really good tonight.$l",
  "CDE_Abigail_Married_IndoorNight_2": "I had a good day today. There's always something interesting going on around here, if you look close enough.",
  "CDE_Abigail_Married_IndoorNight_3": "Are you ready for bed soon? I turned on the electric blanket for us...$l",
  "CDE_Abigail_Married_IndoorNight_4": "Hey! Tell me about your day. Did anything exciting happen?$h",
  "CDE_Abigail_Married_IndoorNight_5": "No more screen time for me tonight. I don't want it to screw with my circadian rhythm.",
  "CDE_Abigail_Married_IndoorNight_6": "I used to be a night owl, but I'm starting to enjoy the rhythm of life on the farm. It feels natural.",
  "CDE_Abigail_Married_IndoorNight_7": "Mmm, it's a good night for a cup of tea.",
  "CDE_Abigail_Married_IndoorNight_8": "*yawn*... I'm ready to call it a night pretty soon.$h",
  "CDE_Abigail_Married_IndoorNight_9": "David Jr.'s been running frantic laps around his cage. I hope he doesn't keep it going after we head to bed.",
  "CDE_Abigail_Married_IndoorNight_10": "The sounds of the night are louder out here. I'll never stop enjoying that.",

  //locational specific dialogue
  "CDE_Abigail_Married_funLeave_1": "I'm visiting my parents today. Someone's gotta check in with them, right?",
  "CDE_Abigail_Married_funLeave_2": "I'm going in to town today, just so you know. I need to stretch these legs a bit.",
  "CDE_Abigail_Married_funReturn_1": "My day was pretty good. How 'bout yours? Oh, and my parents say hi.",
  "CDE_Abigail_Married_funReturn_2": "Hey! Did you have a good day? Mine went well. It was refreshing to take a walk.$h",
  "CDE_Abigail_Married_OneKid_1": "I can relate to my parents a little better now. Hoo, I must have been a little terror as a kid.$h",
  "CDE_Abigail_Married_OneKid_2": "I can't believe I'm a \"mom\"... life is weird.$h",
  "CDE_Abigail_Married_TwoKids_1": "Haha, Mom and Dad thought I was hard to raise? Try raising two!$h",
  "CDE_Abigail_Married_TwoKids_2": "I already gave %kid1 and %kid2 their chocolate cereal. They were screaming!",
  "CDE_Abigail_Married_TwoKids_3": "I'd do anything for our kids. I'd fight every last monster around if it meant keeping them safe!",
  "CDE_Abigail_Married_TwoKids_4": "I had a dream that %kid2 will grow up to be a famous monster hunter. I've already been thinking about a little armor set.",
  "CDE_Abigail_Married_TwoKids_5": "We had kids young, but look on the bright side! At least we won't be super old when they're all grown up.",
  "CDE_Abigail_Married_TwoKids_6": "A cool old house, a couple kids, and an amazing farm. I never thought I'd come this far... but, hey! Our lives are just getting started.$h",

  "CDE_Abigail_Married_Outdoor_1": "What an awesome morning! I can't believe how many of these I missed before we got married.$h",
  "CDE_Abigail_Married_Outdoor_2": "The soft breeze is blowing mountain air throughout the valley today. It smells like fresh pine and sage.",
  "CDE_Abigail_Married_Outdoor_3": "I'm just going to hang out here, okay?#$e#There's a lot of interesting bugs and things out here. *chuckle*$h",
  "CDE_Abigail_Married_Outdoor_4": "Hmm... I think we've got plenty of space for outdoor slime ranching!",
  "CDE_Abigail_Married_Outdoor_5": "I've just got this strange feeling like a fairy, or a witch, or something has been here before.",
  "CDE_Abigail_Married_Outdoor_6": "Make sure to keep things tidy around your Grandpa's shrine. There's something special about it, I can feel it.",
  "CDE_Abigail_Married_Outdoor_7": "I'm scanning the outer reaches of the farm. Do you see anything unusual out there today?",
  "CDE_Abigail_Married_Outdoor_8": "It's pretty cool that we have a cave on our property. It's something I always dreamed about.$h",
  "CDE_Abigail_Married_Outdoor_9": "We should hang out on the porch sometime and snack on some blackberry cobbler. That would be the best.$h",
  "CDE_Abigail_Married_Outdoor_10": "I always forget to put some snacks in my pocket. *rumble*$h",

  //Date Specific Dialogue
  "CDE_Abigail_Married_spring6": "Do we have anything on the farm that's good for sharpening a katana? Or would I have to go to Clint's for that?",
  "CDE_Abigail_Married_spring16": "Will you get mad at me if I go for an all-day video game binge today?#$b#Sorry, it just... sounds really nice.$l",

  "CDE_Abigail_Married_summer19": "I'm feeling kind of explodey today.#$e#I made some cherry bombs. [286]Here's one for you if you need to let off some steam.$h",
  "CDE_Abigail_Married_summer22": "Ugh... Didn't sleep well, and my back is killing me. I can't adult today...$s#$e#...But, yeah, I'll try. Sorry.#$e#I know it hasn't been that much time since we first met, but in some respects, I feel like I was still just a little kid then.$s#$b#I feel like I've grown up a lot since then. But I also feel such a long way off from... my parents' level of maturity, for example.$u#$e#Heh. Who knew entering adulthood would be just as scary as entering the mines?#$b#I'm glad you're with me.$l",
  "CDE_Abigail_Married_summer23": "Some of my old online classmates squeed when they found out I was getting married. It's good to keep in touch with them.",

  "CDE_Abigail_Married_fall12": "So uh, dumb question: What's the... \"final boss\" of the farming year? Is it the fall harvest? Like, right now?#$b#Or is there no final boss?",
  "CDE_Abigail_Married_fall24": "Is it the 24th already? Yes!!$h#$b#That means I need to make time for my yearly playthrough of 'Time Ignition.'#$e#It's the anniversary for the game's release. I can probably get through it all in just a few days. Sorry if I seem preoccupied.",
  "CDE_Abigail_Married_fall28": "Not a bad wrap-up to fall! I just finished 'Time Ignition' yesterday, and the Spirit's Eve festival was awesome once again...#$b#...except for those freaking spiders. *shudder*$s#$e#Still, though!$h",

  "CDE_Abigail_Married_winter1": "It's kinda funny how people pray for the weather to go their way.#$b#Sure, one guy might do his snow dance, and he gets his wish. But then some other dude's out there freezing his butt off and dying.#$e#If I were Yoba, I'd have a tough time trying to decide whose prayers I answer, and whose I ignore.#$b#I'll pass on taking that job.$h",
  "CDE_Abigail_Married_winter8": "I know we're all grown up, but you've gotta let me get out some of my inner child today. I'm going to make a snowman that's extra uncanny.$h",
  "CDE_Abigail_Married_winter19": "Tonight's supposed to be a Saloon night again. Think you can make it?#$e#It's my due diligence as a friend. I'm happy I have you to myself on all the other evenings.$h",
  "CDE_Abigail_Married_winter24": "I think I enjoy the Feast of the Winter Star more when I pause and realize how much I have to be thankful for.#$e#It hasn't been a bad life so far, you know?$h",
  "CDE_Abigail_Married_winter28": "I know I'm not much of a drinker, but hey, here are some adult beverages for the evening. Tonight's as good a night as any! [346][346]",
  //Season specific dialogue
  //Affection specific dialogue

  //Pierre
  //Pierre Gift Tastes
  "CDE_Pierre_RockCandy": "Rock candy? Sure, I'll have a bite. *crunch*#$b#...Whoooaaa! Holy smokes!$4#$b#Is this magic? I feel ready to march off to Zuzu city and punch that smug Joja CEO in the kisser!$h#$b#...Uhhm, ahem. After my shift.$4",
  "CDE_Pierre_Pearl": "Thank you, you're beyond generous! I'm sure you must know the market value on something like this?$h",
  "CDE_Pierre_PrismaticShard": "No kidding...? @, do you know how much one of these is worth?$4#$b#Y-you're outstanding!$4",
  "CDE_Pierre_RabbitsFoot": "Wow, thanks a lot!$h#$b#No one can afford to just give these things out willy-nilly, so I do not take your generosity for granted.",
  "CDE_Pierre_FriedCalamari": "Is that...?$4#$b#Oh, you have no idea how much this means to me.$h#$b#Finally, someone who understands. Thank you.",

  //Pierre's Misc Dialogue
  //these lines target files other than the standard characters/dialogue/Pierre location such as unmarried rainy dialogue
  "CDE_Pierre_rainy_1": "Most people stay indoors on days like this... It's not good for business.$s",
  "CDE_Pierre_rainy_2": "I'm glad you made it here in the rain. The shop's been really quiet.",
  "CDE_Pierre_rainy_3": "All that rain falling on your fields must be earning you some extra time today, huh?",

  //Pierre's Standard Dialogue
  //Special Dialogue
  //date specific dialogue
  "CDE_Pierre_spring1y2": "Aha! I figured you'd come by. Better get some seeds into the ground, huh?",
  "CDE_Pierre_spring12": "Tomorrow's the egg festival! I'll have some special seeds that are on sale only at the festival, so be sure to save some cash!",
  "CDE_Pierre_spring23": "I'm going to have a kiosk open at the flower dance tomorrow, with some exclusive items. Be sure to swing by!",
  "CDE_Pierre_fall15": "I'm feelin' pretty good about my grange display for tomorrow.$h#$b#Though I do welcome the competition.",
  "CDE_Pierre_fall26": "I'll be selling rare goods again at the Spirit's Eve festival. I hope you'll come and take a look!",
  "CDE_Pierre_winter28": "Happy new year, @. Thanks for stopping in.",

  //heart specific dialogue
  "CDE_Pierre_summerTue6": "Ugh... It's so hot in here.",
  "CDE_Pierre_summerWed6": "$d Joja#I really wish Caroline and Abby could take over the counter for a bit...$s|I can stay open all week, no problem! With no Joja to dampen my spirits, it's actually pretty fun!",
  "CDE_Pierre_summerFri6": "Summer is a good time to eat a refreshing salad, don't you think?",

  "CDE_Pierre_fallMon8": "I heard there was a big sportsball game last night.#$e#Joseph Sports ran all the yards and scored the goal.#$e#...$h",
  "CDE_Pierre_fallMon4inlawAbigail": "Hi, @. How's Abigail doing? Tell her that we've been missing her around here.",
  "CDE_Pierre_fallTue10": "Business has been fine lately, but I swear we've got a petty shoplifter in our community.$s#$e#The snack foods keep disappearing from the shelves. And I know I'm not off in my counting.$s",
  "CDE_Pierre_fallWed6": "$d Joja#People don't understand... Just to keep this store alive under the shadow of Joja, I've had to make it my obsession day after day...$s|Maybe sometimes I've gotten carried away with chasing success, but I hope people understand, the shop would've closed years ago if I hadn't fought tooth and nail against Joja.$s",
  "CDE_Pierre_fallThu10": "You know, it's tough spending so much time behind a counter...#$b#...but it's a little easier knowing that just about every face that comes through the door is a familiar one.#$e#Of course, it's nice that you're one of them today!$h",
  "CDE_Pierre_fallFri10": "I've still got work tomorrow. There's no real weekend for me, but I was hoping to take it a bit easier.#$e#What, did you have a big order you needed me to fill?$4",
  "CDE_Pierre_fallFri2": "This shop is my livelihood. I'd do anything to take care of it.#$e#You understand, right? Don't you already go to the ends of the earth for your farm?",
  "CDE_Pierre_fallSat10": "Those nice, sunny beaches out on the Fern Islands... *sigh* What wouldn't I give to be there right now.",
  "CDE_Pierre_fallSun8": "If I didn't have this shop to run I would be outside right now...#$e#The leaves look great and the mushrooms are sprouting.",
  "CDE_Pierre_fallSun4": "It's starting to get cold outside...#$b#That means more people come into the shop to warm up... hehe.",
  "CDE_Pierre_fallSun2": "I'm happy to buy whatever you produce on the farm.#$e#Yes, I do resell it for a profit... but that's the benefit of being an established shop owner.#$e#Don't get any ideas...",

  "CDE_Pierre_winterMon8": "The thing about gridball is that it's all about giving it 110%.#$e#The other team only gave it 108%, though, so that's why they didn't score more goal points.#$e#Hehehe... sorry.$h",
  "CDE_Pierre_winterMon4inlawAbigail": "I used to worry about Abigail's future, but I can see that she's wound up exactly where she needs to be.#$e#You be good to each other now, alright?$h",
  "CDE_Pierre_winterWed6": "This used to be my day off, but who cares? I'll sell you whatever you need.#$e#Neighbors need to help each other out.",
  "CDE_Pierre_winterThu6": "Caroline really is wonderful. I don't think I could last through this cold season without her.",
  "CDE_Pierre_winterThu2": "I mainly deal in edibles, so if you've got any ores or wood you'd better try selling them somewhere else.",
  "CDE_Pierre_winterFri10": "Sometimes I wonder if the citizens don't respect me the way they do other villagers. What is it that I do wrong in their eyes?$s",
  "CDE_Pierre_winterSat8": "#$1 pierre2#Does Abigail look anything like me? Don't tell my wife, but sometimes I wonder if I'm really the father.$k$s#$e#Don't tell my wife, but I hate to cook dinner.",

  "CDE_Pierre_summerSat10+Tue4": "If we look out for one another, that's how our community will make it in the long run.#$e#Anyway, would you like to buy anything?$h",
  "CDE_Pierre_summerSun10+Fri4": "With her online classes, Abigail's already formally more educated than I've ever been. I'm proud of her.#$e#I started out as a courtesy clerk as a kid, and then I worked my way up until I could open this store.",
  "CDE_Pierre_summerThu6+winterTue10": "Abigail will always be my little girl. It was love at first sight, when I saw her for the first time.",
  "CDE_Pierre_fallMon4+winterMon4": "I just can't really get into following gridball.#$e#Ha ha, go Tunnelers, I guess! Right?",
  "CDE_Pierre_winterThu4+winterSat6": "Is it just me or is there a cold draft in here?",
  "CDE_Pierre_winterSun10+Mon6": "Caroline and I met in school. We never actually dated anyone besides each other.#$e#I know, it's a little unconventional. But it's worked so far!$h",

  "CDE_Pierre_Mon8": "$d Joja#Well, at least some residents of our town believe in supporting local businesses. ...*sigh*$s|I'll admit, work's actually a little more fun without JojaMart around. ...It all seems like it matters again, knowing it won't end in ruin, y'know?",
  "CDE_Pierre_Mon4": "Hi, @. Need any seeds or fruit tree saplings?",
  "CDE_Pierre_Mon2": "How is the farm?#$e#I think we could really have a nice business setup, you and me.#$b#So I hope you stick around!",
  "CDE_Pierre_Tue10": "$d Joja#Apparently, the mom-and-pop grocer in Grampleton closed not too long ago. I wonder when it's gonna be my turn?$s|I did some research. Turns out JojaMart was selling at quite a loss. Their general strategy isn't even to turn a profit until after the local businesses are extinguished.",
  "CDE_Pierre_Tue2": "Hey, glad to see you again!#$e#Thanks for supporting the local economy!",
  "CDE_Pierre_Wed10": "Hey, mind if you watch the counter for a few hours, while I go and work on your farm?#$e#Haha, just kidding.$h#$e#...*sigh*$s",
  "CDE_Pierre_Thu8": "It's easier to keep in a positive mood when there are more familiar faces dropping in.#$e#So... thanks for visiting!$h",
  "CDE_Pierre_Thu6": "$d Joja#I support a free market as much as anyone, but who exactly is it 'free' for when Joja holds the kind of power it has?$s|Just another beautiful day in the neighborhood!",
  "CDE_Pierre_Thu4": "Hey, @. You're my number one customer!",
  "CDE_Pierre_Fri8": "$d Joja#Everything that Morris does is technically legal, but it doesn't change the fact that he sees our town for its money and nothing else.$3|My stress nightmares about JojaMart have finally stopped. ...Did I tell you I'd been having nightmares? Yeah, that was a thing.",
  "CDE_Pierre_Fri6": "I've thought about writing stories to pass the time. Nothing really gets me inspired, though.#$e#I don't know how Elliott does what he does.#$e#Maybe I need a change of scenery.",
  "CDE_Pierre_Sat6": "Sometimes it's tough making dinner conversation with my family. At the end of the day, all that's on my mind are order forms, profits, sales...$s#$e#I guess I can see how that'd be boring...$s#$b#But at any rate, a man has to do what's necessary for his family, regardless of whether they can appreciate it or not.",
  "CDE_Pierre_Sat4": "Sometimes, operating a small business really takes it out of you.#$b#But I wonder, what would this community be like without my store?",
  "CDE_Pierre_Sat2": "I like it best if I can sell produce that's local.#$e#I just want to do what I can that's right by the environment.#$e#Plus, there are no shipping costs when it's local.",
  "CDE_Pierre_Sun8": "$d Joja#Can a community have a soul? I want to believe in this place, but it's difficult when it seems like people's wallets are their number-one priority.$s|I feel very lucky. In the end, it looks like Pelican Town is a special place after all!",
  "CDE_Pierre_Sun6": "I sometimes wonder... what percentage of my life will I spend behind this counter?$s",
  "CDE_Pierre_Sun4": "Providing basic necessities to the people of this community... That's worth a legacy, isn't it?",
  "CDE_Pierre_Sun2": "Thanks for stopping in!$h#$e#I hope your day goes well.",

  //generic weekday dialogue
  "CDE_Pierre_summerMon": "What are you growing this summer? Something specific? A little of everything?",
  "CDE_Pierre_summerTue": "JojaMart doesn't even have lower prices than we do, unless you count those 50% off coupons that they're always handing out.$3#$e#You've never gotten one, huh? Yeah, neither have I. Makes sense why.",
  "CDE_Pierre_fallMoninlawAbigail": "Hello, er... my son?$s^Hello, er... daughter?$s",
  "CDE_Pierre_fallSun": "Hi there. Is your farm still doing well?#$e#Maybe a few of my seeds will spruce things up.$h",
  "CDE_Pierre_winterMoninlawAbigail": "Hello, er... my son?$s^Hello, er... daughter?$s",
  "CDE_Pierre_winterWed": "#$1 pierreDin#I'm going to surprise Caroline tonight with dinner and a bottle of Stardew Red. Don't tell anyone! Finally, a day of relaxation.$k#$e#",
  "CDE_Pierre_winterSat": "If I didn't have this shop to run I would be outside right now.#$e#It would be fun to throw a snowball.",

  //Robin
  //Robin's Gift Tastes
  "CDE_Robin_GoldPumpkin": "Looks like that haunted maze had quite the prize after all! I can't believe you want me to have it!$h",
  "CDE_Robin_Pearl": "@, are you sure?$h#$b#Thank you. I never expected to have a neighbor who's so generous.",
  "CDE_Robin_PrismaticShard": "This is amazing! It'll make for the most beautiful decoration in one of my upcoming projects!$h",
  "CDE_Robin_RabbitsFoot": "Very nice! By any chance, did this come from your coop?$h",
  "CDE_Robin_GoatCheese": "Ooh, what a treat! I know what I'm having for my next snack!$h",
  "CDE_Robin_Peach": "Well look at this! I always knew you'd wind up growing the very best fruit!$h",
  "CDE_Robin_Spaghetti": "I was just craving this! It's like you read my mind.$h",

  //Robin's Misc Dialogue
  //these lines target files other than the standard characters/dialogue/Robin location such as unmarried rainy dialogue
  "CDE_Robin_rainy_1": "The rain doesn't stop me from getting a job done!$h#$e#Although soggy wood isn't a joy to work with.$s",
  "CDE_Robin_rainy_2": "Your roof isn't leaking, is it? Let me know if it that ever happens.",
  "CDE_Robin_rainy_3": "This weather doesn't bother you too much, does it? Same here.",

  //Robin's Standard Dialogue
  //Special Dialogue

  //date specific dialogue
  "CDE_Robin_spring1y2": "Happy springtime! Hey, now's a good time to let me know of any projects you might have for me.",
  "CDE_Robin_summer27": "I don't think I'll ever get tired of seeing the moonlight jellies with Demetrius.#$e#I hope you can make it, too.",
  "CDE_Robin_fall15": "The Stardew Valley Fair is really something else. I hope you'll put together a grange display for us to see!",
  "CDE_Robin_winter15": "I thought we might head down as a family to that Night Market on one of these nights.#$e#I don't know if I can get Sebastian to go, though...",
  "CDE_Robin_winter28": "Another year down. Another couple decades of this and I'll be old.#$e#I'll keep doing what I'm doing for many years, though.$h",

  //heart specific dialogue
  "CDE_Robin_summerMon10": "How'd I learn to build things so fast? A whole lot of practice, I'd say.#$e#If you set your mind to something, eventually you will become an expert at it.",
  "CDE_Robin_summerTue10": "Have you tried anything creative with note and drum blocks yet?#$e#Remember that you can change the tones on them.",
  "CDE_Robin_summerTue6": "Mmm, I'm craving a ripe peach. Do you have any on your farm?",
  "CDE_Robin_summerWed8": "What? You're worried I work too late on my construction projects? No, I take plenty of breaks throughout the day.#$b#Just not when you're looking, I guess.$h#$e#Besides, it takes a lot of work to build as quickly as I do.",
  "CDE_Robin_summerWed": "I'll work in the direct sun if I need to. Don't worry, I've got some of the heaviest-duty sunscreen you can find.",
  "CDE_Robin_summerThu10": "What's the best crop you've got growing on the farm this summer?#$e#I don't suppose you could bring some by...?$h",

  "CDE_Robin_fallMon8": "It was about when Maru became a teenager that I knew she was something else with machines.#$e#As a kid, she would always take apart our electronics, though she couldn't always put them back together.#$e#But eventually, she reached a point where she'd put them back together in her own way, with modifications.#$b#I'm really proud of how advanced she's become.",
  "CDE_Robin_fallMon4": "Has Maru showed you any of her latest projects yet?",
  "CDE_Robin_fallWed10": "It's always an honor to help rebuild your farm. I couldn't have done it without you collecting all those resources.#$e#I appreciate you letting me do it.$h",
  "CDE_Robin_fallThu8": "When things work out for us, it's our duty to help others in need.#$b#Don't you think so, too?",
  "CDE_Robin_fallFri6": "Hardwood is tough to come by, but there's nothing better to work with.#$e#I don't suppose you have any extra lying around, do you?$h",
  "CDE_Robin_fallSun10": "Everyone needs a project to get them out of bed each day and keep going. What's yours right now?",

  "CDE_Robin_winterMon8": "I've always had a passion for building things, even when I was a kid.#$e#Sometimes I'd get a \"look\" from others about my hobbies. I just didn't let it bother me.",
  "CDE_Robin_winterMon6": "Do you like your fireplace? Let me know if you ever want to remodel it.#$e#The right fireplace makes the biggest difference in making a room's appearance come together.",
  "CDE_Robin_winterTue10": "My kids have their own interests. I never really pushed either of them into carpentry.#$e#They still seem to enjoy their hands-on activities, though. Maru's got her gadgets and Sebastian's got his motorcycle.",
  "CDE_Robin_winterWed6": "Architecture styles and home fashions might come and go, but they all have one goal in mind: to make a better place to live.#$e#Humanity has always sought a better place to live. It's as old as history itself. So I enjoy the feel of that connection in my work.",
  "CDE_Robin_winterThu10": "With all these cold days, how's your hearth treating you? Need me to restyle it?",
  "CDE_Robin_winterSat8": "As a girl, I remember looking up how to make a real igloo and then putting it together.#$e#It turned out pretty good! I acted as foreman and put a couple of my friends to work.$h",
  "CDE_Robin_winterSun10": "There were a lot of things in this town that have needed fixing, but I wasn't ever able to get started on many of them until you showed up.",

  "CDE_Robin_summerSat10+Thu8": "Sometimes, I wonder if Sebastian passively resents me for not having his father around.$s#$e#Maybe he feels like Maru's got it all, and he lives in her shadow...$s",
  "CDE_Robin_summerSun10+Thu6": "I met Demetrius in college while working an apprenticeship and raising Sebastian.#$e#My head still spins when I wonder how we managed to find time for it all!",
  "CDE_Robin_fallTue10+Wed2": "When we first moved here, we had to rough it out in a trailer until I could get the house finished.#$e#Demetrius had a separate trailer for his lab.",
  "CDE_Robin_fallSat10+Tue6": "Demetrius may be a bit stoic, with his scientific brain, but I learned pretty quickly how to get through to his romantic side.#$e#I did teach him how to dance with me, after all.$h",

  "CDE_Robin_Mon6": "Demetrius's work technically brought us out here. I'd say it's worked out pretty well, though.",
  "CDE_Robin_Mon4": "Nahh, I don't go into the mines all that much. Too dark and dangerous.#$e#Let me know if you find anything neat down there, though.",
  "CDE_Robin_Mon2": "Have I told you that I built our house from the ground up?#$e#It's definitely been the highlight of my career so far.",
  "CDE_Robin_Tue8": "I must say, you've certainly been quite a support for our business since you moved into town.$h",
  "CDE_Robin_Tue4": "Leah's got a good handle on woodworking, too. I just prefer to make things with a little more practical use.",
  "CDE_Robin_Tue2": "There used to be some great buildings on your farm, but they're all gone now.#$e#I'd love to help restore the farm anew. Just let me know what I can do.",
  "CDE_Robin_Wed8": "Sebastian's father? He was a good guy. Things just didn't work out.#$e#We were both very young.",
  "CDE_Robin_Wed4": "Do you have some good furniture for your home yet?#$e#I just can't imagine coming home to a house that I don't love.#$e#Sorry, I mean, whatever works for you though, right?$h",
  "CDE_Robin_Thu10": "@, it's great to see you!$h#$e#Having you as a neighbor has been one of the best things that's happened to us since we moved here.",
  "CDE_Robin_Thu4": "I hear strange electrical noises coming from Maru's room from time to time.#$e#I always wondered whether her interests would take after me or Demetrius. Guess it was a little of both.$h",
  "CDE_Robin_Thu2": "Have you tried reaching out to Sebastian yet?",
  "CDE_Robin_Fri8": "It's strange. I don't feel old enough to be the mother of two adult-aged children.#$e#Life just gets faster and faster as you go, I guess.",
  "CDE_Robin_Fri2": "Sam comes over occasionally to play games with Sebastian. Maybe they'll invite you join them sometime.",
  "CDE_Robin_Sat8": "Out here, I get a little more flexibility to do the projects that interest me.#$e#I don't think I'd get that kind of freedom working in the city.",
  "CDE_Robin_Sat6": "Demetrius is usually laid back about everything, with the exception of anything Maru-related.#$e#That's the one area in which you really have to earn his trust.#$e#Sorry if he's ever said anything standoffish. It's not just you.",
  "CDE_Robin_Sat4": "Ugh, I wish Sebastian wouldn't smoke.$s#$e#I don't even know where he picked that up from.$s",

  //generic weekday dialogue
  "CDE_Robin_summerFriinlawSebastian": "Has Sebastian been getting outside much lately?#$e#Make sure you two take good care of each other!$h",
  "CDE_Robin_summerFriinlawMaru": "Has Maru been tinkering around with anything neat lately?#$e#Make sure you two take good care of each other!$h",
  "CDE_Robin_winterWed": "I think I need a little me-time. A visit to the hot spring might be in order.#$e#Do you ever go?",
  "CDE_Robin_winterFriinlawMaru": "Is Maru staying cozy over at your place?#$e#Be sure to tell her to visit soon!",

  "CDE_Robin_Mon": "Hey there, @.#$e#I was just daydreaming about some new carpentry projects.#$e#Are you doing OK at your place? How's the woodwork in your cottage holding up?",
  "CDE_Robin_Wed": "Hey, how are things going?#$q 604/605/606 Wed_old#Are you settling in okay?#$r 604 0 Wed_604#So far so good.#$r 605 0 Wed_605#I'm alright, just overwhelmed.#$r 604 0 Wed_604#This place is refreshing.#$r 606 -10 Wed_606#This place sucks. Why am I here?",
  "CDE_Robin_Wed_old": "$p 006#I hope things are starting to get better.|Be sure to drop in anytime.",
  "CDE_Robin_Wed_604": "I'm glad to hear it. Let me know if you need anything.$h",
  "CDE_Robin_Wed_605": "Hang in there. It'll get better.#$b#Remember, we didn't even have a house when we first moved out here. I'm sure you'll land on your feet soon, too.",
  "CDE_Robin_Wed_606": "Oh gosh, I didn't realize it was that bad.$s#$b#Thank you for being honest. Please know you're never alone here. We're all on your side.",
  "CDE_Robin_FriinlawMaru": "I did think you and Maru would get along well. It really makes me happy to see the two of you together.",

  //Sam
  //Sam Gift Tastes
  "CDE_Sam_GoldPumpkin": "Seriously? Isn't this your prize from the maze?$h#$b#I'm speechless. Thanks!",
  "CDE_Sam_RockCandy": "Alright! Sugar rush, here we come!$h",
  "CDE_Sam_Pearl": "This looks ultra rare. Where'd you find it?$10",
  "CDE_Sam_RabbitsFoot": "Nice! I can hang this on my guitar case. Thanks!$h",
  "CDE_Sam_CactusFruit": "Awesome! These are SO refreshing.$h",
  "CDE_Sam_MapleBar": "Oh, those are so good! And you're giving me one?$8#$b#Dude, you rock.$h^Oh my gosh, you rock.$h",
  "CDE_Sam_Tigerseye": "This stone is rad! Something about it just makes me want to rise up and rock out.",

  //Sam's Misc Dialogue
  //these lines target files other than the standard characters/dialogue/Sam location such as unmarried rainy dialogue
  "CDE_Sam_rainy_1": "Rain muffles sound, so I can play my guitar louder without my Mom getting mad. Hehe.$h",
  "CDE_Sam_rainy_2": "It feels kinda badass to walk through the rain without letting it faze you.",
  "CDE_Sam_rainy_3": "Am I gonna let a day like this dampen my spirits? Nahh.#$e#There's always something fun going on if you look for it.",

  //Sam's Standard Dialogue
  //Special Dialogue

  //date specific dialogue
  "CDE_Sam_spring1y2": "Hey @, pretty amazing start to the year, isn't it? I thought last year would never end.$h#$e#Thanks for stopping by.",
  "CDE_Sam_spring12": "My little brother gets so excited for festivals. He's been talking about tomorrow's egg hunt all day.",
  "CDE_Sam_spring21": "Sometimes those spring petals that float around make my nose drip.$s#$e#I like summer best, myself.",
  "CDE_Sam_spring23": "Why couldn't the flower dance be today so I could get work off?$s",

  "CDE_Sam_summer10": "I don't have to work tomorrow! I've never been so happy.$h",

  "CDE_Sam_fall7": "The first week of fall is already over. Man, that went by fast.$s#$e#Whatever. I'm just happy that you came to visit me!#$e#So do you have anything new to tell me?",
  "CDE_Sam_fall9": "I ordered a new pair of shoes online. They're the same style so I know they'll fit right.",
  "CDE_Sam_fall16": "I ordered some shoes online more than a week ago! Man, they're really taking a long time.#$e#I guess we must really live in the middle of nowhere.$s",
  "CDE_Sam_fall23": "Ah, my feet feel great in these new shoes. They're a little crisp, but they'll break in. Especially after I run through the haunted maze this weekend.$h",
  "CDE_Sam_fall26": "Tonight, after everyone is asleep, that weird old man who lives in the woods will set up the haunted maze. He always makes sure no one is around to see him working.",

  "CDE_Sam_winter7": "One time, Gus fell in the river during the Ice Festival. We had to build a huge fire in the saloon to dry him out.#$e#We were all worried we'd never taste his famous spaghetti ever again.",
  "CDE_Sam_winter24": "The Feast of the Winter Star is supposed to be a time to show gratitude for all the good things in life.#$b#Me? I'm mostly interested in the food. Hehe.$h",
  "CDE_Sam_winter28y1": "I've got a strange feeling about tonight. Something big is about to happen.#$e#I just hope it's a good something.",
  "CDE_Sam_winter28y2": "Guess I'll stay up late with Vincent tonight. I figure there's only a limited number of times he'll want to do that.",

  //heart specific dialogue
  "CDE_Sam_summerMon10": "Getting to play in Zuzu City was a dream come true, but I feel like I've gotten that out of my system.#$e#My thoughts have been moving onto other things, lately.$l",
  "CDE_Sam_summerTue10": "Maybe I should learn how to cook#$b#You wouldn't mind being my taste tester, right?$h#$e#I dunno, I just thought it might be something you'd like.$l",
  "CDE_Sam_summerTue6": "Hmm, tomorrow morning should be a pancake day.#$e#I bet Vince would really like that.",
  "CDE_Sam_summerWed6": "$d Joja#Another shift at JojaMart today. Yay, another few hours of my life wasted.$s|If I work quickly, Gunther sometimes lets me off my shift early. Morris never would've let that slide.",
  "CDE_Sam_summerThu6y1": "@, thanks for reaching out to me like you have. Things have been tough lately with my dad being gone.$s#$e#No news is good news, right? Gotta stay positive.",
  "CDE_Sam_summerThu6y2": "Sometimes I can hear my Dad pacing down the hallway at night.$s#$b#...But he won't tell us what's troubling him.",
  "CDE_Sam_summerThu4": "Sebastian has some pretty cool board games.#$b#A long time ago, I wasn't into board games, but he knows how to make them fun.$h",
  "CDE_Sam_summerFri10": "I've been writing a song lately.#$e#It's uh... it's about you.#$e#Hey, c'mon, don't laugh!",
  "CDE_Sam_summerFri6": "I was homesick a lot when we first moved here, but that was ages ago.#$e#This is really the only home Vince has ever known. Seeing him fit in makes it easier for me, too.",
  "CDE_Sam_summerFri4": "Oh man. I ate an entire large pizza at like... eleven last night.#$e#I just opened the fridge, and I was like, 'jackpot'!#$e#...Haha, nope, I feel fine.$h",
  "CDE_Sam_summerSun10": "You know, I don't think I miss my old home anymore. It's fun to do a gig in Zuzu City, but I don't really have any urge to actually live there again.",
  "CDE_Sam_summerSun8": "Ever notice how there are a ton of single old dudes in Pelican Town?$s#$e#It's just kinda weird, don't you think?$s",
  "CDE_Sam_summerSun6": "Hoo. I could go for some donuts right now.#$e#It doesn't matter what time of day it is. It's always donut time.",
  "CDE_Sam_summerSun4": "Booyah! I got another set of lyrics cranked out last night!$h#$e#I'm on fire lately. Still lots of work to do, though, before we're ready to play live.",
  "CDE_Sam_summerSun2": "Hey, having a good summer?#$e#Stop by my place if you're looking for somewhere to cool off.",

  "CDE_Sam_fallMon10y1": "You're the best, @. I can't wait for my dad to meet you when he gets back.$l",
  "CDE_Sam_fallMon10y2": "I told my dad, \"Look, Dad, you don't have to hide stuff from me. I'm not a kid anymore.\"$s#$b#For one second, he looked like he might actually open up, but then he just stood up, did this weird smirk, and walked away.$s#$e#I think he'll never give up wanting to protect me. If it hasn't happened now, it probably won't ever happen.$s",
  "CDE_Sam_fallMon6y1": "Band practice went awesome last week. Abby and Sebastian have been putting in a lot of hard work.",
  "CDE_Sam_fallMon6y2": "My dad? Yeah, I dunno. It's easier just to stay out of his way most of the time.",
  "CDE_Sam_fallMon2": "I like taking walks in the forest this time of year. The temperature is so comfortable.#$e#...$h",
  "CDE_Sam_fallTue8": "I did a little cleaning up around the house to make things easier for my mom, but she doesn't actually seem any happier.#$e#She was thankful, but... I dunno. She's always saying that's her biggest source of stress. I'm not so sure, though.",
  "CDE_Sam_fallTue6": "After Dad left for his tour, I made a conscious decision to give Vince the best childhood he can get.#$e#I realized, if I don't help make that happen for him, who else will?",
  "CDE_Sam_fallWed10": "It's tough for me to focus on writing lyrics lately. I think some of my muse came from feeling isolated in this town.#$e#But that's... not really an issue anymore.$l",
  "CDE_Sam_fallWed8": "Been cooking any pizza lately? Man, I could really go for a slice.",
  "CDE_Sam_fallWed6": "I think I'm becoming a pizza purist. Toppings are nice, but if you get just the right blend of cheeses, that's all you really need.#$e#I wish I could cook.$s",
  "CDE_Sam_fallWed4": "My mom makes pretty awesome pizza, as long as she doesn't put any weird toppings on it.#$e#Don't tell her, but the pizza at the saloon is downright perfection. Gus knows his stuff.",
  "CDE_Sam_fallThu6y1": "I think my Dad might be coming back next year.#$e#I guess that's kind of soon. Weird.",
  "CDE_Sam_fallThu6y2": "I guess I should start thinking about moving out soon...$s#$e#...But I would miss Mom's fish casserole, so I dunno...$s#$e#I hate making decisions.",
  "CDE_Sam_fallFri8": "I got my paycheck yesterday. Hmm... should I save it or should I spend it...",
  "CDE_Sam_fallFri6": "...I stayed up late playing games on my computer last night. I really wish I'd focused on writing some more lyrics.",
  "CDE_Sam_fallSat8": "$d Joja#So glad I have the day off. Working at JojaMart's been really grating on me lately.|I was looking at the exhibit displays during my shift at the museum. We've got some pretty cool stuff in there.",
  "CDE_Sam_fallSat4": "I'm lucky to have the biggest room in the house to myself.#$e#I guess there's advantages to being the oldest child.",
  "CDE_Sam_fallSun8": "@, what gets you out of the Sunday-night blues? Y'know, when you have to go back to work the next day?#$e#Oh, right. You never take a day off.#$b#Well, you must really love what you do, then. I'm envious.$h",
  "CDE_Sam_fallSun6": "It's hard to have fun on Sunday... I keep thinking about having to go to work tomorrow.$s",
  "CDE_Sam_fallSun2": "Oh man, I scraped my knee so badly on my skateboard a couple days ago.#$e#Nahh, it doesn't hurt. Just a little battle damage.",

  "CDE_Sam_winterMon10": "Hey, if we lived together, would you get annoyed at me playing guitar too loud?#$e#There's no wrong answer. It'd be whatever worked for you.",
  "CDE_Sam_winterMon8": "Vince is looking forward to the Feast of the Winter Star. I'm coming up with ideas for how to make it extra special for him this year.",
  "CDE_Sam_winterMon4": "We had another good band practice this weekend! Things are coming along.$h#$e#Oh, don't worry, I'm definitely getting you tickets to our first show.",
  "CDE_Sam_winterMon2": "Everyone's indoors during the winter, so I can play guitar as loud as I want.$h",
  "CDE_Sam_winterTue8": "Penny and I used to hang out a lot when we first moved here.#$e#We still hang out occasionally, and we've got this weird, almost... flirty? ...thing going, but we don't have a lot in common anymore.$s",
  "CDE_Sam_winterTue8inlawPenny": "I'm glad things worked out for you and Penny! I always kinda wondered about her.$h",
  "CDE_Sam_winterWed10": "Heyyy... you aren't... 'hiring' at your farm, or anything, are you?$l",
  "CDE_Sam_winterWed6": "$d Joja#I know our jobs are kinda crap, but it'd be nice if Shane was a little friendlier at work to pass the time.|I wonder how Shane's doing? He always seemed like he hated his JojaMart job even more than I did.",
  "CDE_Sam_winterThu4y1": "I think my Dad is coming back this spring.#$e#It's been 3 years since I've seen him. This is going to be strange.",
  "CDE_Sam_winterThu4y2": "Dad's been back for a while now. I guess I'm finally getting used to it.",
  "CDE_Sam_winterFri6": "Vince and I had an epic snowball fight yesterday. We're almost getting evenly matched.$h#$e#A couple more years, and I'll legitimately have to watch my back.",
  "CDE_Sam_winterFri4": "I'm hoping for some more dry, powdery snow before everything outside turns to slush.",
  "CDE_Sam_winterFri10": "@! It's so good to see you!$h#$e#Give me a hug. ...Ooh! You're nice and warm!$l",
  "CDE_Sam_winterFri8": "Snowboarding's a lot of fun, but I've only been a couple times. Too bad there aren't any good slopes nearby...",
  "CDE_Sam_winterSat6": "After we moved here, Penny and I grew up together. Now she's my little brother's teacher. How does that even happen?#$e#Maybe it's high time I actually get a move on my life. Sebastian's got the right idea.#$e#You do, too, for that matter.",
  "CDE_Sam_winterSun10": "Maybe if I moved out, my mom would finally be a little happier.#$e#I wonder if she's stressed just because she's worried about me?",
  "CDE_Sam_winterSun6": "Try not to make a mess in the house. My Mom's pretty obsessive about keeping things clean.#$e#It's uh... actually a legit struggle sometimes...$s",
  "CDE_Sam_winterSun4": "I caught Vince at the door with wet shoes. Glad I caught him before he went running into the kitchen.",

  "CDE_Sam_fallThu4+fallSat2": "Hi @.#$e#Hmm... I wonder if I could grow a cactus in my room?",
  "CDE_Sam_Sat8y1+Sat6": "Abby came up with a cool drum solo. I just have to figure out how to incorporate it into one of our songs.#$e#I didn't think too much of Abby when I was younger, but it turns out she's really creative.",

  "CDE_Sam_Mon4": "I got into skateboarding when I was a little kid.#$e#It's rewarding to do the same hobby as an adult, though. You really end up viewing it in a whole new light.",
  "CDE_Sam_Tue8": "Sometimes I look at other people and notice how everyone changes. Some people I grew up with just aren't the same.#$e#It sucks to have to leave behind those parts of your childhood. Why does everyone settle for it?",
  "CDE_Sam_Tue4y1": "Mom's always worried about Vincent. Personally, I think he'll turn out fine.#$e#I mean, did she forget about what I was like at that age, or something?$h",
  "CDE_Sam_Tue4y2": "I tried fixing a bowl of cereal for my dad, but as soon as I poured milk on it, he flipped out. What was up with that?$s",
  "CDE_Sam_Tue2": "Hey, @.#$e#So, do you play any video games?",
  "CDE_Sam_Thu8y1": "I'm amazed we've made friends with each other as quickly as we have! You are seriously the best person ever, @!",
  "CDE_Sam_Thu8y2": "Hey, if you get to talking with my dad, just uh... show him some support, if it's not too much to ask.#$e#He doesn't really like talking about himself around me, so maybe it's easier if you're not as close?$s",
  "CDE_Sam_Thu4y1": "I think my Dad might be coming back in a year or so.#$e#I guess you might be able to meet him, then. If you're still living here.#$e#You wouldn't abandon the farm after putting so much effort into it!",
  "CDE_Sam_Thu4y2": "...I have mixed feelings about my father being back. He seems strange.$s#$b#But I guess I haven't seen him in 3 years... so that could explain it.",
  "CDE_Sam_Thu2y2": "Well, my Dad is back. You've met him, right?#$b#I'm just glad he's okay.",
  "CDE_Sam_Fri10": "The older I get the more attached I feel to the valley.#$b#Although I could be biased... for a certain reason.$l#$e#So, how are you doing today?$h",
  "CDE_Sam_Fri2": "I miss the city sometimes, but if I moved there again, I'd end up working around the clock just to get by.#$e#I wonder which is more worth it?",
  "CDE_Sam_Sat8y2": "Having my dad back has been... even more different than I expected.$s#$e#I just don't know I'm supposed to act around him. Like, am I a kid again or am I a man?$s",
  "CDE_Sam_Sat4": "Oh! I just remembered I'm supposed to call my Grandma. Okay, I'm going to put this rubber band on my wrist so I don't forget.#$e#I have to make little reminders for myself or else I'll totally forget to do things.$h",
  "CDE_Sam_Sat2": "I picked up guitar just a few years ago. It came to me pretty naturally.#$e#I've still had to practice a lot, though. There's 'good,' but then there's 'actually good,' y'know?$h",
  "CDE_Sam_Sun8": "Sometimes I wonder if my mother is actually happy with her life...$s#$e#I asked her once and got the feeling she was hiding some inner pain.",
  "CDE_Sam_Sun4": "I've been experimenting with an effects pedal. It's a lot of fun, but we'll see if I can find a place for it in our band's music.#$e#If you create a sound that's just gimmicky, it ends up sounding cheesy. High risk, high reward, I guess.",
  "CDE_Sam_Sun2": "If I head outside, sometimes I start getting ideas for lyrics just popping into my head.#$e#You must like working outside a lot, huh?",

  //generic weekday dialogue
  "CDE_Sam_summerMon": "There's a little less pollen in the summer... my nose is really happy.",
  "CDE_Sam_Thuy2": "My dad dropped by your farm, right?",

  //Sam's Married Dialogue
  //weather specific dialogue
  "CDE_Sam_Married_RainyDay_1": "Might be a good day to sit back and jam on the guitar.#$e#Hey, you can relax too if you want.",
  "CDE_Sam_Married_RainyDay_2": "Hey, sweet. Looks like good ol' nature's doing your work for you today. Take advantage of that!",
  "CDE_Sam_Married_RainyDay_3": "Do you think Sebastian and Abigail will ever hook up? Heh... now that I'm married I'm trying to get everyone else married too.",
  "CDE_Sam_Married_RainyDay_4": "Sebastian's a few years older than me. I never expected I'd beat him to the punch with tying the knot.",
  "CDE_Sam_Married_RainyDay_5": "Hey, I found one of these rolling around in the back of a drawer. [90 88 86 535]I thought you might be able to use it.",
  "CDE_Sam_Married_RainyDay_6": "Aw man, I was gonna go skateboarding today.$s",
  "CDE_Sam_Married_RainyDay_7": "Aw, man. These cloudy days are kind of a drag...$7",
  "CDE_Sam_Married_RainyDay_8": "Maybe today's a good day for me to give Punkman 2 another try. I never did beat that game.",
  "CDE_Sam_Married_RainyDay_9": "How'd you sleep? The sound of rain really makes me zonk.",
  "CDE_Sam_Married_RainyDay_10": "I hope my mom's mood is okay today. At least she won't have to worry about me tracking footprints in the house.",

  "CDE_Sam_Married_RainyNight_1": "Hey, how was your day? I just lay around and read comics most of the day... it was great.$h",
  "CDE_Sam_Married_RainyNight_2": "I love living here, with no neighbors! I cranked my amp up to eleven!$h",
  "CDE_Sam_Married_RainyNight_3": "It was a pretty low-key day for me... colas, frozen pizza, a few hours noodling around on the guitar. I feel relaxed.",
  "CDE_Sam_Married_RainyNight_4": "It'll be fun when Vince grows up a bit, into a teenager. Think he could crash here for movie nights?",
  "CDE_Sam_Married_RainyNight_5": "Earlier, I listened to our live recording from that show we played. Remember that? Man, was that sloppy.#$b#It made me a little nervous that you were there, I didn't want to mess up and have you think I was a loser!$l",
  "CDE_Sam_Married_RainyNight_6": "I hope Vincent's got enough role models helping to bring him up, especially since I'm not around all the time.#$e#You know, he's probably going to be fine. It's not like I moved across the country, or anything.",
  "CDE_Sam_Married_RainyNight_7": "I hope Vincent's not too lonely now that I'm gone... I kinda felt responsible for the little guy.$s#$b#But, life's all about change... right? Kids need to learn that, eventually... Or else adulthood will destroy them.$7",
  "CDE_Sam_Married_RainyNight_8": "Hey, I tossed a couple frozen pizzas into the oven. Here's yours. [206]$h",
  "CDE_Sam_Married_RainyNight_9": "Here you go. The only frozen pizza we had was barbecue chicken. Sorry, I had the four-cheese. [206]",

  "CDE_Sam_Married_IndoorDay_1": "Phew... I'll tell you one thing I don't miss about my old life... working at JojaMart.",
  "CDE_Sam_Married_IndoorDay_2": "I'll get some cleaning done today. At least that's one good thing I learned from my old job.",
  "CDE_Sam_Married_IndoorDay_3": "Hey, I made you some instant pancakes. Enjoy. [211]$h#$e#What? I never learned to cook... mom always did that.",
  "CDE_Sam_Married_IndoorDay_4": "I just finished making some pancakes. Here you go! [211]$hI consider myself to be an instant pancake connoisseur. Just... you probably don't want me to try cooking much else.",
  "CDE_Sam_Married_IndoorDay_5": "Hey. I know I joke around a lot, but I want you to know that I seriously love you...$l",
  "CDE_Sam_Married_IndoorDay_6": "Oh! 'Morning. Does my hair look okay today?$l",
  "CDE_Sam_Married_IndoorDay_7": "Do you have big plans for the day?#$e#Oh, not me... I usually decide what to do a few moments beforehand...",
  "CDE_Sam_Married_IndoorDay_8": "Let's see... what should I do today?#$e#I might play some old favorites on my guitar.",
  "CDE_Sam_Married_IndoorDay_9": "Maybe Sebastian's going to be online later. I kinda feel like playing video games today.",
  "CDE_Sam_Married_IndoorDay_10": "Um... Maybe I'll help out on the farm some other day. I feel lazy today.$s#$e#You're not mad?",

  "CDE_Sam_Married_IndoorNight_1": "Hey, you look tired. Let me help you relax tonight, okay? Maybe I'll give you a massage later.",
  "CDE_Sam_Married_IndoorNight_2": "Whoa, you're home! Guess that's my cue. OK, relax-o time for you! [184 346 206]",
  "CDE_Sam_Married_IndoorNight_3": "My day? Oh... I can hardly remember. I didn't really do anything of note. Just relaxed and had a good time.",
  "CDE_Sam_Married_IndoorNight_4": "I dusted and swept today. And I cleaned the kitchen. See? I do stuff sometimes, too.",
  "CDE_Sam_Married_IndoorNight_5": "Hey, sorry I didn't make the bed. You know I'm sloppy... that's why you like me, right?$h",
  "CDE_Sam_Married_IndoorNight_6": "Me? Oh, I got caught up on some shows today. I'm feelin' a bit stir crazy; they were kinda intense.",
  "CDE_Sam_Married_IndoorNight_7": "The only thing I miss about living at home is Mom's fish casserole.",
  "CDE_Sam_Married_IndoorNight_8": "Hey. I kinda missed you today. I went looking for you at one point, but I figured you were probably busy.",
  "CDE_Sam_Married_IndoorNight_9": "Ready to hit the hay? I actually made the bed for once...",
  "CDE_Sam_Married_IndoorNight_10": "Want me to play you a guitar lullaby? I'm in no rush to fall asleep, myself, but you're probably pretty tired.",

  //locational specific dialogue
  //6/6: added Married to the patio dialogue token, moved patio to the bottom of priority list for continuity purposes
  "CDE_Sam_Married_funLeave_1": "I'm gonna visit the family today, okay? I'll be home in the evening.",
  "CDE_Sam_Married_funLeave_2": "I've gotta check in on my family today. Seeya tonight!",
  "CDE_Sam_Married_funReturn_1": "Seeing family is nice, but it's also kind of depressing in a weird way. Like... our lives are totally separate now, and everything feels more formal than it used to.$7",
  "CDE_Sam_Married_funReturn_2": "My family's doing alright, but they're all struggling with something or other. I hope it's cool with you if I see 'em again soon.$7",

  "CDE_Sam_Married_OneKid_1": "It's weird, but I really like being a father!$h",
  "CDE_Sam_Married_OneKid_2": "*yawn* Man oh man, I'm definitely feeling a new appreciation for stay-at home parents.$s",
  "CDE_Sam_Married_OneKid_3": "I think we should have another kid. Why stop now?",
  "CDE_Sam_Married_OneKid_4": "Sure, being a dad is way more exhausting than I imagined, but I'm up for a challenge!$h",

  "CDE_Sam_Married_TwoKids_1": "I woke up early, fed the kids and changed their diapers! We're all set. You can just focus on raking in that sweet money.$h#$e#I'm just kidding... I didn't marry you for the money.",
  "CDE_Sam_Married_TwoKids_2": "Two kids... Crazy. Well, if my mom can survive it, so can I!",
  "CDE_Sam_Married_TwoKids_3": "We have to make sure and give %kid1 a lot of attention now that we have %kid2. We don't want any jealousy between them.",
  "CDE_Sam_Married_TwoKids_4": "It's fun to see the babies playing with each other. I think they're going to be very close.",
  "CDE_Sam_Married_TwoKids_5": "I think I'll do a private concert for the kids today. That's the only kind of audience I really need!$u",
  "CDE_Sam_Married_TwoKids_6": "I never thought I'd become such a family man, but I'm really satisfied with what we've built here. Life is going great.$l",
  "CDE_Sam_Married_TwoKids_7": "My parents are still pretty young. They could easily live to see great grandbabies. Or maybe even great-great grandbabies!$u",

  "CDE_Sam_Married_Outdoor_1": "Maybe I should get some off-road wheels for my skateboard. Mayor Lewis can't touch me out here.$h",
  "CDE_Sam_Married_Outdoor_2": "Hah, if it weren't for all the trees in the way, you could probably see my old house from here. Kinda funny, isn't it?$h",
  "CDE_Sam_Married_Outdoor_3": "I always keep an eye on the wide blue sky... you never know when a UFO might go by.",
  "CDE_Sam_Married_Outdoor_4": "This quiet kind of morning... It's nice. It's probably healthier than being some kind of tweaked out rockstar.",
  "CDE_Sam_Married_Outdoor_5": "Hey, got a good feeling about today? I don't wanna throw off your morning routine.",
  "CDE_Sam_Married_Outdoor_6": "Hi, @! If I knew more about farm work I'd help you out more. Sorry!#$e#I'll try and help you with encouraging thoughts.$h",
  "CDE_Sam_Married_Outdoor_7": "Something in the air makes me feel positive... maybe it's the faint whiff of pizza from Gus' ovens.",
  "CDE_Sam_Married_Outdoor_8": "Do I ever miss living in the city? Ha, nope. Not a bit.$h",
  "CDE_Sam_Married_Outdoor_9": "Wow... you look great today, and the specks of mud just add some extra charm.$l",
  "CDE_Sam_Married_Outdoor_10": "Hoo... I was thinking I didn't sleep so well last night. But just stepping out here makes me feel awake all the sudden!",

  "CDE_Sam_Married_patio_1": "*Sigh*... I'm never gonna land this trick...$s",
  "CDE_Sam_Married_patio_2": "Aw man! You just missed it! I landed a perfect kickflip just a little bit ago.$h",
  "CDE_Sam_Married_patio_3": "This used to be so much easier...$s#$b#Either that or I just had a lot more unearned confidence when I was younger.$10",

  //Date Specific Dialogue
  "CDE_Sam_Married_spring3": "I went and got some allergy meds. I don't like using 'em, though. I just feel really spacey.$s",
  "CDE_Sam_Married_spring8": "Sebastian lent me a big ol' stack of his comics. That pretty much carves out my reading for the next month.$h",
  "CDE_Sam_Married_spring16": "It's kind of weird, knowing I'll never be a kid again.#$b#But... knowing my old track record, maybe that's a really good thing.$h",
  "CDE_Sam_Married_spring25": "How many days until summer now? Heh, I can't wait.",
  "CDE_Sam_Married_summer5": "I hope tomorrow's a good day to hit up the halfpipe.#$e#You wanna come by and watch me for a bit?",
  "CDE_Sam_Married_summer12": "It was nice seeing Penny at the festival yesterday. We only hang out every once in a while these days.#$b#Plus, now that I'm married to you, there's less awkwardness hanging in the air between her and me.",
  "CDE_Sam_Married_summer17": "Today marks the anniversary of when my family moved to Pelican Town.#$b#Or... I think it was this day?$s#$e#Maybe I'll ask my mom.",
  "CDE_Sam_Married_fall4": "This is Abby's favorite season, right? I bet she's enjoying herself.#$e#I noticed, whenever she's in a good mood, Sebastian seems to be pretty happy, too.",
  "CDE_Sam_Married_fall9": "I keep getting the sense that some people think we got married too young.$7#$b#Look, I get how they could think that, but I just want to let you know that for me, this is real.$s#$b#We can do this, right? I'm on board... you're on board...#$e#We're gonna conquer the world together.",
  "CDE_Sam_Married_fall13": "I thought Pelican Town was a prime spot for doing things how you want, but... dang. On this farm, we really can do whatever we want, huh?$u",
  "CDE_Sam_Married_fall23": "One year, I went a bit overboard with Vincent on the Spirit's Eve candy.#$b#That was a mistake. Poor little guy couldn't keep it all down. So gross.$h#$e#Uh, yeah, Mom cleaned it up. I felt pretty bad.$s#$e#Not doing that again. Don't worry.",
  "CDE_Sam_Married_winter3": "So, does anything actually grow in winter...? Or...",
  "CDE_Sam_Married_winter14": "If you're not as busy this season, is there a day that we can just spend lounging around? I really kinda miss you.$l",
  "CDE_Sam_Married_winter20": "I hope Vincent gets everything he wants this year for the Feast. I love seeing that kid open presents.",
  "CDE_Sam_Married_winter26": "I wonder how my dad's doing...$7",

  //Season specific dialogue
  //Affection specific dialogue

  //Sandy
  // Gift Tastes
  "CDE_Sandy_RockCandy": "A little sweet from my sweetie! Aren't you just the nicest? <$h",
  "CDE_Sandy_Pearl": "*gasp* No! You didn't!#$b#You did? You brought me a pearl? Just because?$h#$b#Sweetie. I don't know what to say.",
  "CDE_Sandy_PrismaticShard": "Now isn't that the prettiest? I could make the best earrings ever with this!$h",
  "CDE_Sandy_RabbitsFoot": "Oh, that's nice! <$h#$b#Did this come from your farm? It's awfully generous.",
  "CDE_Sandy_MangoStickyRice": "*gasp* You're the sweetest, sweetie! <$h#$b#These tropical flavors take me far, far away from this dull desert.",

  //Sandy's Misc Dialogue
  //these lines target files other than the standard characters/dialogue/Sandy location such as unmarried rainy dialogue
  "CDE_Sandy_rainy_1": "I heard it's raining back home. Is that why you came here?$h#$e#I kind of miss the rain, actually...$s",
  "CDE_Sandy_rainy_2": "I do sometimes wonder how anything manages to grow out here without rain.#$e#Just a miracle of nature, it seems.",
  "CDE_Sandy_rainy_3": "Helloooo~ What a surprise to see you!$h#$e#It's been awfully quiet out here today.",

  //Sandy's Standard Dialogue
  //Special Dialogue
  //date specific dialogue
  "CDE_Sandy_spring13": "Wheee! ~ The desert festival starts next week!$h#$e#Things are about to get lively around here!$h",

  //heart specific dialogue
  "CDE_Sandy_summerMon10": "Are my roots showing? My hairdresser canceled on me again.$s#$e#*sigh* It's such a long journey into the city, too, I can't just reschedule for the next day.$s",
  "CDE_Sandy_summerTue10": "How's the desert trader's camel doing? Is she up for some pets?",
  "CDE_Sandy_summerWed8": "I heard there used to be Pepper Rexes wandering this desert in packs, long ago. Imagine that!",
  "CDE_Sandy_summerWed6": "Next year's desert festival is so far away... *sigh*$s#$e#Better get used to some lonely months.$s",
  "CDE_Sandy_summerWed4": "I saw a hot air balloon soaring through the sky the other week. Who d'you suppose was up there?$h",
  "CDE_Sandy_summerWed2": "I've heard stories about a pot of gold at the end of a rainbow.#$b#I'd love it if I even got to see a rainbow in the first place!",
  "CDE_Sandy_summerThu10": "If you see Emily, be sure to let her know that I'm free to meet up with her at the time she mentioned.",
  "CDE_Sandy_summerFri6": "The desert trader came in and looked around for a bit the other day. She didn't say much. Didn't buy anything, either.#$e#What a mysterious person. I wonder what her real life is like?",
  "CDE_Sandy_summerSun10": "Ohhh! I just got the cutest shirt in stock! Want to try it on?$h",

  "CDE_Sandy_fallWed10": "Good thing you showed up! I haven't had a customer all day!#$e#...as expected.$s",
  "CDE_Sandy_fallThu10": "Well hellooooooo ~ What brings you to the desert today?#$e#Treasure hunting? Coconut foraging? ...Meeeeee? <$h#$e#Haha, just kidding.",
  "CDE_Sandy_fal_Fri4": "Seems like that desert trader usually knows how to predict when you'll show up.#$b#Then she heads home just as soon as you leave. Can she predict the future or something?#$e#Wish I could do that...",

  "CDE_Sandy_winterFri6": "At least it's a little cooler here in the winter. That sun sure doesn't let up, though.",
  "CDE_Sandy_winterSat10": "Do you go fishing in that pond across the street?#$e#I've seen those fish. I can't imagine eating something like that! Blech.",
  "CDE_Sandy_winterSun10": "What do you think about having a store cat who lives here?#$e#The owner of the building would definitely say no, I'm sure, but I think a cat would love living in the desert.#$e#There's even a mysterious cat totem a stone's throw from here. You've seen it, yeah?",

  // 6/5: reformatted these so that they are in priority order based on season, but doing so puts the spring/nonseasonal lines out of priority order.
  "CDE_Sandy_summerWed10+Fri6": "I listen to the radio sometimes. After you hear the same pop song twice an hour for a month, though, it's tough to keep it going.$s",
  "CDE_Sandy_summerSat10+Tue6": "I complain about the heat nonstop, but nothing can really beat the coolness of the desert when the sun goes down.#$e#The way a desert sunset looks is hard to beat, too.",
  "CDE_Sandy_fallMon10+Sun8": "I took a trip to Zuzu City last month. Can't miss out on living it up at the clubs every once in a while!$h#$e#I don't waste a second. I stay out all night.#$e#There are college kids who can't even keep up with me! Heehee!$h",
  "CDE_Sandy_fallTue10+Sun6": "I guess I've seen at least one guy from the back room who occasionally heads up north.#$e#I wonder if he's headed for that freakish cavern?$s",
  "CDE_Sandy_fallSat10+Sun4": "I floated around in the valley for a few years. Wish I could live there, but it's pretty hard to find reliable work.#$e#So that's how I wound up here!",
  "CDE_Sandy_fallSun10+Thu6": "Those antenna-like structures northeast of here? No idea.#$e#Apparently, they were featured on an old episode of 'Mysteries of the Unknown.'#$e#They must have been built there for some reason, anyway!",
  "CDE_Sandy_winterMon10+Tue4": "My name's not really Sandy, you know. It's just good for business.#$e#But everyone calls me Sandy anyway, so I've just gotten used to it.",
  "CDE_Sandy_winterTue10+Mon4": "One time, a couple literally camped out here for their honeymoon. Whatever floats their boat, right?",
  "CDE_Sandy_winterWed10+Mon8": "Emily's got a real knack for reading people. It's like she's on a different wavelength, or something.#$e#She can't help but treat everyone with equal respect, though, no matter how the other person acts. I admire that.",
  "CDE_Sandy_winterThu10+Sat8": "@! Come on in. I've got a treat for you. [233]#$e#I figured you'd love it.$h",

  "CDE_Sandy_Mon10": "Hey honey! Made any of that tom kha soup lately? I don't think I'll ever get tired of the flavor.#$e#Grab a coconut before you go, if you see one.",
  "CDE_Sandy_Mon6": "I got lunch with Emily not too long ago! It was so great to catch up with her.$h#$e#We talked for a bit about you, actually. All good things, I promise!$h",
  "CDE_Sandy_Mon2": "You made it out here again! I'm so glad.$h#$e#What's new in the valley?",
  "CDE_Sandy_Tue10": "Well gosh! How many times have you ridden that bus out here now?#$e#Hey, I appreciate every visit.",
  "CDE_Sandy_Tue8": "Hi!~ Stay as long as you like.#$e#The air conditioning sure feels nice, doesn't it?",
  "CDE_Sandy_Tue2": "That skeleton out back is a 'sand dragon.' As a kid, did you love dinosaurs, too?#$e#Sometimes, tourists will stop to take pictures.",
  "CDE_Sandy_Wed10": "Hey, it's @! I'm glad to see you, kid. I was starting to think you'd never come back!#$e#If I didn't have this shop to run I'd come back to the valley with you for a day or two... just you and me on the old farm.$s#$e#You'll just have to visit me more often so I don't get depressed.$h",
  "CDE_Sandy_Wed8": "Isn't it expensive, coming to the desert so often like you do?#$e#You must really like to see me, huh? Hmmm...$h",
  "CDE_Sandy_Wed6": "I see all sorts of folks out here. Sometimes, they're on road trips or they work in shipping.#$e#But most regular customers just head for the back room.",
  "CDE_Sandy_Wed2": "Hey there, sweetie!$h#$e#How's Emily doing? I hope Haley's not too much of a handful.",
  "CDE_Sandy_Thu8": "I know it doesn't look like it, but business has been decent lately.#$e#Part of it's thanks to you. Cost of living out here is dirt cheap, so just a simple seed purchase goes a long way!$h",
  "CDE_Sandy_Thu4": "Hey... I think I can trust you. You can keep a secret, right?#$b#*whisper* That guy in the back... it's some kind of exclusive club. I've never been inside myself, but they pay me a generous monthly rent so I don't ask any questions.#$e#SOOOOoo! How's that Stardew Valley weather right now?",
  "CDE_Sandy_Fri8": "Hey there! How's the farm, sweetie?#$e#I'm guessing things must be in good shape if you're able to spare the time to trek out here.#$e#It's always a treat to see you.$h",
  "CDE_Sandy_Fri4": "Well look who's here! How you been?#$e#I just got done reading the best book. 'Marcie and the Underground Castle.' Definitely worth the read, if you've got time.",
  "CDE_Sandy_Fri2": "I think the thing I miss most about the valley is the wild flowers. Just a lotta good memories that go with them.#$e#Bring some by if you find any, okay, sweetie?",
  "CDE_Sandy_Sat10": "Hey @. It's free sample day! Enjoy. [218]",
  "CDE_Sandy_Sat4": "You look really thirsty. Here, have a taste of this ice cold milk. [184]#$e#Tasty, huh?$h",
  "CDE_Sandy_Sat2": "The cavern north of here is best worth avoiding.$s#$e#I peeked inside once. There's this door? ...and *shiver* Ugh, never again.#$b#Never. Again.$s",
  "CDE_Sandy_Sun10": "The cavern? Look, if you've been in there, I don't wanna know.$s#$e#I trust you'd stay safe if you did, though, huh?",
  "CDE_Sandy_Sun2": "Hi there, honey. Yep, it's just me, alone in this big old shop. Hmmm...#$e#Well, except for that creepy guy in the back. But he never moves a muscle, so I often forget about him.",

  //generic weekday dialogue
  "CDE_Sandy_summerWed": "*sigh*... I do miss the beautiful flowers of Stardew Valley...$s",
  "CDE_Sandy_fallFri": "You wouldn't have much luck farming out here, honey.#$e#Well, unless you were a cactus farmer.$h",
  "CDE_Sandy_winterFri": "I can't believe there's snow right now where you live.#$e#Oh well. Sand is kind of like snow. It'll have to do for me.",
  "CDE_Sandy_Fri": "That trader with the camel comes through here pretty often. I don't know how she expects to do any business, though.#$e#Hey, I speak from experience. It's tough out here.",
  "CDE_Sandy_Sat": "Hi! Welcome to Sandy's Oasis, the number one destination in Calico Desert!#$e#*whisper* Did I sound professional?$h#$e#Make sure to check out our seasonal seed selection.",

  //Sebastian
  //Sebastian Gift Tastes
  "CDE_Sebastian_GoldPumpkin": "This might be one of the coolest things I've ever seen. Is that real gold? It's definitely not paint.$7",
  "CDE_Sebastian_RockCandy": "Thanks! I love rock candy.$h#$b#This kind looks extra special.",
  "CDE_Sebastian_Pearl": "Wow, I don't know what to say. You're just giving this to me?$h#$b#Just thinking about where it comes from... I love it.$6",
  "CDE_Sebastian_PrismaticShard": "This is awesome. I could stare at it for hours.$6#$b#Er, well, minutes. I could stare at it for... awhile.$l",
  "CDE_Sebastian_FrozenTear": "This is so mysterious. It's really... cool.#$b#Ha, wasn't trying to make a pun there. Sorry.$h",

  //Sebastian's Misc Dialogue
  //these lines target files other than the standard characters/dialogue/npc location such as unmarried rainy dialogue
  "CDE_Sebastian_rainy_1": "If you're lucky, you might see a frog in this weather.",
  "CDE_Sebastian_rainy_2": "Looks like a good day for some ocean gazing.",
  "CDE_Sebastian_rainy_3": "Not too many people want to go out when it's like this. Things are more peaceful.",

  //Sebastian's Standard Dialogue
  //Special Dialogue
  //date specific dialogue
  "CDE_Sebastian_spring1y2": "I should browse the forums for some more clients. Anything to keep me busy indoors this spring.",
  "CDE_Sebastian_spring12": "I'm not too big on festivals. Lots of commotion, too much social interaction... More stress than fun, if you ask me.",
  "CDE_Sebastian_spring23": "Ugh... Tomorrow is the worst festival of the year by a mile. Just wait and see how stupid I look during the flower dance.",
  "CDE_Sebastian_summer10": "Hehe... It might be funny to put something disgusting in the potluck soup tomorrow. Just don't poison anyone.#$e#Why ruin the potluck? Hmm... I guess some people feel liberated when the rigid structures of society break down a little. Maybe I'm weird.",
  "CDE_Sebastian_summer27": "Tomorrow we'll all be gathering at the docks to see the migration of the moonlight jellies. I think it starts at ten o'clock.",
  "CDE_Sebastian_fall20": "Are you looking forward to the Spirit's Eve festival? It's probably my favorite.$h",
  "CDE_Sebastian_fall26": "The Spirit's Eve festival is tomorrow. I really hope they have those skeletons on display again this year.$h#$e#I almost feel like they're my friends at this point.",
  "CDE_Sebastian_winter24": "It's the eve of the winter star today. Better make sure you've got an empty stomach for the feast tomorrow.",
  "CDE_Sebastian_winter28": "It'd be nice if we could skip the first part of the year.#$b#Everybody makes empty resolutions they'll never keep. I wish more people could at least be genuine.",

  //heart specific dialogue
  "CDE_Sebastian_summerMon10": "I've gotta say, @, when I first met you, I didn't think I'd like you. You seemed so...#$b#...peppy?$h#$b#But I'm glad I was wrong. It was probably just me projecting assumptions on someone who willingly moved to Pelican Town.$l",
  "CDE_Sebastian_summerMon4": "Don't you ever get sick of the sun? When the heat's beating you silly, you're all sweaty, and dirty...#$b#...and you have to smear smelly goo on your skin just to keep it from burning... Why do people like summer, again?",
  "CDE_Sebastian_summerMon2": "Everyone perking up when the sun's out... It's such a cliche.$a",
  "CDE_Sebastian_summerTue8": "Summer evenings are decent, at least, if it cools down enough.#$e#When it's pitch dark outside and you still feel that wave of heat, stepping outside... that's messed up.",
  "CDE_Sebastian_summerTue6": "It's definitely better to be too cold than to be too hot.#$b#Too cold? Put on a sweatshirt. Problem solved.#$b#Too hot? You're screwed.",
  "CDE_Sebastian_summerWed8": "I ate a lot of sour candies last night. Now I've got blisters on my tongue.#$e#Worth it.$h",
  "CDE_Sebastian_summerWed4": "It's nice, getting that sense of accomplishment when you fix a bug that was eluding you for days.$h#$e#Oh, sorry, that's probably pretty boring for you to hear about.",
  "CDE_Sebastian_summerThu8": "I feel stuck. How the heck did you do it, @, just quitting your life and moving away?#$e#I'd kill to be able to do that. But the cost of living keeps jumping in the city.$s",
  "CDE_Sebastian_summerThu6": "I just feel so stuck, living here. My life doesn't change from one year to the next.$s",
  "CDE_Sebastian_summerThu2": "I definitely don't want to go swimming, if that's what you're going to ask.$s#$e#Oh, you just stopped to say hi? Sorry.",
  "CDE_Sebastian_summerFri4": "I have to stay up late. It's the only time the house isn't sweltering.#$e#I can't sleep when it's too hot to get under the covers.",
  "CDE_Sebastian_summerFri2": "You've been up since how early? *yawn* ...Damn.",
  "CDE_Sebastian_summerSat10": "Maybe it'd be fun to ride my bike out in a nighttime thunderstorm.#$e#I mean, uh, scratch that. Too dangerous, I know.$l#$e#I know you'd worry. I've got to think of that.",
  "CDE_Sebastian_summerSat6": "There are all sorts of creatures lurking underground, but people hardly ever talk about them. I mean... why not?#$e#It's like some people specifically choose to be boring.",
  "CDE_Sebastian_summerSat4": "Sam and I originally bonded over music, a while back.#$e#He's a good guy. Most people don't care about my hobbies, but he's pretty much always willing to try the things I like.",
  "CDE_Sebastian_summerSat2": "I'm really in the mood for some coffee, but it's way too hot for it.#$e#And iced coffee just isn't as good.",
  "CDE_Sebastian_summerSun8": "The best thing with the lake is when there's a full moon right above it. It gives the whole area a nice serene glow.",
  "CDE_Sebastian_summerSun6": "Some people look up at the night sky and start to feel insignificant.#$b#But I feel that way all the time. For me, it's actually a comfort for the sky to remind me of that simple truth.",

  "CDE_Sebastian_fallMon8": "Does it make sense if I say that the more crowded a place is, the lonelier it is?#$e#I was in a nightclub in Zuzu City a couple of years ago. It was too crowded to dance and too loud to talk.#$b#Kind of defeats the whole purpose, doesn't it?",
  "CDE_Sebastian_fallMon6": "Why does Maru have to be instantly good at everything she does?$s#$e#I'm still better than she is at music... and programming...#$b#...but even with programming, she's crazy good at installing the AI scripts for her robots.$s",
  "CDE_Sebastian_fallMon6inlawMaru": "Don't get me wrong, I'm happy you and Maru got together, but...#$b#...it's just another reminder about how she keeps upstaging me. Everything just has to work out perfectly for her.$s",
  "CDE_Sebastian_fallTue8": "I'm not really mad that Mom married Demetrius. She can live her own life.#$b#I just wish they'd let me live my own life, too.",
  "CDE_Sebastian_fallTue4": "Pumpkin spice this... pumpkin spice that... man, I do get sick of these seasonal fads.",
  "CDE_Sebastian_fallTue2": "Maybe I should pay Abby a visit soon.$u#$e#...I dunno.$u",
  "CDE_Sebastian_fallWed6": "*sigh* If I lived in the city, I could join a 'Solarian Chronicles' group and do some of those epic 8-person raids.$s#$e#Oh well. I guess it's not really the same when you don't know anybody in the group.",
  "CDE_Sebastian_fallWed4": "I stayed up most of the night finishing a job for one of my clients. It was actually a lot of fun.#$e#I don't even feel tired, for one thing.$h",
  "CDE_Sebastian_fallThu8": "I know I should try more to connect with Maru. It's just...#$b#...if I try to meet her on her level, getting all excited with her, it feels wrong. It's just not me.#$e#Does that make any sense?",
  "CDE_Sebastian_fallThu6": "Hm, maybe I should move my synthesizer back here from Sam's place. It'd be a lot easier to practice.#$e#Or I can just practice on my computer keyboard. That's how I first learned, anyway.",
  "CDE_Sebastian_fallThu4": "My room might be a little less depressing if I had a window...$s",
  "CDE_Sebastian_fallSat10": "@, hey! I'm glad I ran into you.$h#$e#I'm just having a really good day. I wanted to see how you were doing.",
  "CDE_Sebastian_fallSat8": "How the heck do you get up so early each day? I don't get it.#$e#That's officially your superpower.'The Early-Morning Hero.'",
  "CDE_Sebastian_fallSat6": "Eventually, I have to get up in the morning so my parents don't patronize me. I'd rather not be treated like a kid.",
  "CDE_Sebastian_fallSun10": "Hey. Want to stay out late with me tonight?#$e#When there's a glow on the horizon, that's usually when I can tell it's time to head for bed.",
  "CDE_Sebastian_fallSun6": "People act completely different in big groups. They all put on this mask, this persona...#$b#...and it's just so other people will accept them.#$b#Don't they get a little too comfortable losing touch with the real version of themselves?",
  "CDE_Sebastian_fallSun4": "A lot of people seem self-obsessed. Some can't get into a book or TV show if the characters don't remind them of themselves.#$b#The exact opposite of that is why I like reading fantasy.",

  "CDE_Sebastian_winterMon10": "I was just thinking... I'm really thankful I have you in my life.$l#$e#Just something I was thinking about, with the Feast of the Winter Star coming up.",
  "CDE_Sebastian_winterMon6": "People always say \"just be yourself,\" but I think for most of them, it's just a saying.#$b#They don't actually mean it when they say it.",
  "CDE_Sebastian_winterTue8": "Feast of the Winter Star's coming up. I know I should try to think of things I'm grateful for, but...$s#$b#...it's tough when there are so many people my age moving on with their lives.$s",
  "CDE_Sebastian_winterTue2": "You want to talk? Uh... I'm kind of busy at the moment.#$e#Okay, not 'busy' busy, but...$s#$b#...Sorry, today's just not a good day. Maybe later.",
  "CDE_Sebastian_winterWed10": "Abby's great, don't get me wrong. She's cooler than most of the people in town.#$b#But she's a little young. And besides, I've got you.$l",
  "CDE_Sebastian_winterWed6": "Sam's being needy again. And we just gamed online last night.#$e#Oh well. He's still happy if I only say yes one in every four or five times he asks.",
  "CDE_Sebastian_winterThu10": "Here, you wanna finish my coffee? I've had a few cups already. [395]#$e#Gotta get you warmed up!$h",
  "CDE_Sebastian_winterThu4": "I used to like my sushi dressed up as much as possible. But if the fish is good, everything else just gets in the way of the flavor.#$e#Maybe a little soy sauce.#$e#Plus, uh, one of my favorite characters from a series I read has a thing for sashimi, so...$s",
  "CDE_Sebastian_winterFri6": "I'm really excited. There's a new volume of 'Cave Saga X' coming out next month.$h#$e#I've already pre-ordered mine.$h",
  "CDE_Sebastian_winterFri4": "Hmm... I wonder if I can brave the cold to go for a ride tonight...$s",
  "CDE_Sebastian_winterSat10": "Man, I've got to move out of here, fast.#$e#Anything new on your farm, despite the snow?",
  "CDE_Sebastian_winterSat8": "I'm always confused why the idea of an afterlife is so appealing. Do people realize how long 'eternity' actually is?#$e#I understand the need for comfort, but...#$b#...to me, thinking about 'eternity' is more like staring into an endless abyss. I'd rather focus on what's temporary and in front of me.",
  "CDE_Sebastian_winterSat4": "You must not spend very much time at home, with the way you're always running around.#$e#Sounds exhausting.",
  "CDE_Sebastian_winterSun6inlawMaru": "I can't believe Maru still comes out here to build her snowman.#$e#Are you sure it was a good idea to marry someone who lives within walking distance from your farm?#$e#Sorry. I mean, whatever works for you.$s",
  "CDE_Sebastian_winterSun4": "I built a snowgoon but Demetrius made me get rid of it.#$b#You know your life's going in reverse when your stepdad treats you like a six-year-old.$u",

  "CDE_Sebastian_Mon10": "It seems pretty narcissistic to assume that we matter in the grand scheme of things.$s#$e#That said, though, you matter to me, no matter how indifferent the universe might be.$l",
  "CDE_Sebastian_Mon8": "It seems pretty narcissistic to assume that we matter in the grand scheme of things.$s#$e#But I guess we're all floating downstream. Gotta enjoy the ride while it lasts.",
  "CDE_Sebastian_Tue10": "It's nice having a reason to stay here in Pelican Town.#$e#Um, you know what I'm talking about, right?$l",
  "CDE_Sebastian_Tue4": "When you throw a rock in the lake, it sends out ripples. But then the ripples eventually reach the edge and stop.#$b#Everything ends, so how can things with a lasting effect be any more important?",
  "CDE_Sebastian_Wed4": "I get bored by plain, ordinary life stuff. How do people get excited about the most mundane things?#$e#Like for example, Abby's parents got a new washing machine a few months ago, and they'll tell stories about that thing for hours...#$b#...like it's the most important thing that'll ever happen to them.#$e#In one sense, it's kind of funny, but in another, it's just depressing as hell.$s",
  "CDE_Sebastian_Thu6": "My biological dad? Yeah, I've met him a few times.#$e#He's staggeringly unremarkable.#$e#That's about it.",
  "CDE_Sebastian_Thu4inlawMaru": "It's a little easier not having to live with Maru anymore. How are you holding up?",
  "CDE_Sebastian_Fri8": "What's new?$h#$e#I'll be at the saloon tonight destroying Sam at pool again.$h",
  "CDE_Sebastian_Sat10": "Hi, @. How's your day going?$h",
  "CDE_Sebastian_Sat8": "Sam almost beat me in pool last night.#$e#Well, 'almost' is a relative term, but he has been getting better.$h",
  "CDE_Sebastian_Sat6": "Maybe I should do something creative this weekend.#$b#I wonder if my client would mind if I redesigned the logo for his program?",
  "CDE_Sebastian_Sat4": "You don't smoke, do you?#$b#...Yeah, no problem, it's all good.",
  "CDE_Sebastian_Sun8": "Nothing quite like getting a coding problem solved.#$e#I stayed up most of last night, but I'm feelin' pretty good now.$h",
  "CDE_Sebastian_Sun6": "Damn it. Today's not a good day.$a#$e#If you can give me some space, I'd appreciate it.#$e#Look, you understand how I work.",

  //generic weekday dialogue
  "CDE_Sebastian_summerThu": "Getting out and making small talk with the locals, just for the fun of it. ...That's probably your kind of thing, isn't it?",

  //Sebastian's Married Dialogue
  //weather specific dialogue
  "CDE_Sebastian_Married_RainyDay_1": "Finally... some heavy rain. I get bored of sunny weather easily.",
  "CDE_Sebastian_Married_RainyDay_2": "I think I'm going to have a good day today. And you enjoy yourself, too, okay?$h",
  "CDE_Sebastian_Married_RainyDay_3": "Hey. I was just thinking about my old room in the basement. I felt comfortable there, but this is a lot more interesting. And I don't miss the smell...",
  "CDE_Sebastian_Married_RainyDay_4": "I couldn't really hear the sound of the raindrops in my old basement room. It's nice being able to in this house.$7#$e#I felt kind of embarrassed living in my mom's house for so long.",
  "CDE_Sebastian_Married_RainyDay_5": "Hey. I couldn't sleep last night so I took a walk to the caves. I found this... want it?[575 769 767 84 66 78]#$e#I just have trouble sleeping sometimes, it has nothing to do with you. I love you.$7",
  "CDE_Sebastian_Married_RainyDay_6": "Hey. I couldn't sleep last night so I took a walk to the caves. I found this... want it?[575 769 767 84 66 78]#$e#I just kept walking, and I guess I got a bit carried away. Sorry, I don't mean anything by it.",
  "CDE_Sebastian_Married_RainyDay_7": "Seems like a pretty good day to just lie around, maybe read a book or something... what do you think?",
  "CDE_Sebastian_Married_RainyDay_8": "It's on the edge of my brain... I was stumped yesterday by this one coding problem, but today, I think I can make it work.$7",
  "CDE_Sebastian_Married_RainyDay_9": "Hey, another rainy day... perfect.",
  "CDE_Sebastian_Married_RainyDay_10": "You look cold... here, come closer.$l#$e#Remember that day we had at the beach? Under the umbrella?$l",

  "CDE_Sebastian_Married_RainyNight_1": "I'm trying my best to quit smoking now that we're married... I don't wanna die on you. It's a bad habit.#$e#I want to have a future together.$l",
  "CDE_Sebastian_Married_RainyNight_2": "I was in a musical mood today, so I played around with a synth program. Wish I did it more often; it's really gratifying.$h",
  "CDE_Sebastian_Married_RainyNight_3": "I did some work on the laptop today. I was actually brainstorming some ideas for a game I want to make.#$e#With your farming income, I can afford to do what I want with my life. It's pretty amazing. Thank you.$h",
  "CDE_Sebastian_Married_RainyNight_4": "Oh, dang! I was supposed to take out the trash today, wasn't I? I'll... do it in the morning.$s#$e#I dunno, my mind was elsewhere. It's hard to remember to do chores...",
  "CDE_Sebastian_Married_RainyNight_5": "Sorry, I didn't make any dinner. We might have a frozen pizza in the fridge or something.",
  "CDE_Sebastian_Married_RainyNight_6": "How was your day? Did you slay any monsters?$h#$e#It feels good to take out your aggression now and then, doesn't it?",
  "CDE_Sebastian_Married_RainyNight_7": "How was your day? Did you slay any monsters?$h#$e#In either case, I'm glad you know how to avoid being boring.$7",
  "CDE_Sebastian_Married_RainyNight_8": "Maybe a witch will visit us tonight? Hah.. if only life were that interesting...",
  "CDE_Sebastian_Married_RainyNight_9": "Hey, let me know when you're ready to turn in for the night...$l",

  "CDE_Sebastian_Married_IndoorDay_1": "The older I get, the less I'm drawn to the city. It had a certain mystique to it, once.#$e#But it turns out that was just a romantic fantasy. The city's so busy, so full of people... I don't belong there. I'm a loner.",
  "CDE_Sebastian_Married_IndoorDay_2": "Living in Zuzu city seems a bit overrated, the more I think about it.#$e#Living out here... it's just the right kind of loneliness for me. The kind that makes me look forward to seeing you again each day at home.$7",
  "CDE_Sebastian_Married_IndoorDay_3": "Hey, I made coffee.[395]$7#$e#I needed some... woke up early from a nightmare and I just couldn't fall back asleep.",
  "CDE_Sebastian_Married_IndoorDay_4": "Hey... want some coffee?[395]$7#$e#This is the good stuff. Not that Joja-brand garbage.",
  "CDE_Sebastian_Married_IndoorDay_5": "Insomnia got the better of me last night, so I went for a motorcycle ride.#$e#I need to stay independent, even though we're married. That's just how I am. I still love you, though.$7",
  "CDE_Sebastian_Married_IndoorDay_6": "I couldn't sleep last night so I went for a night ride on the motorcycle.#$e#The moon was bright enough to cast shadows through the trees. It was just the perfect night.$7",
  "CDE_Sebastian_Married_IndoorDay_7": "Hey. How'd you sleep last night?#$e#I heard you mumbling. You seemed scared, but I have to admit... it was kind of cute.$l",
  "CDE_Sebastian_Married_IndoorDay_8": "Slept okay last night?#$e#It wasn't too bad a night for me, but I'll admit I'm jealous how you can sleep like a log sometimes.$7",
  "CDE_Sebastian_Married_IndoorDay_9": "Living here with you is teaching me to come out of my shell a little bit. I think it's good for me.$7",
  "CDE_Sebastian_Married_IndoorDay_10": "The way you've put this farm together... I've got to say it's given me an appreciation for where our food comes from.$7",

  "CDE_Sebastian_Married_IndoorNight_1": "Hey. I just hung out around the house, today. Nothing interesting...#$e#...Oh, I got all the dishes and laundry caught up. So there's that.",
  "CDE_Sebastian_Married_IndoorNight_2": "The view from our house is perfect. You can see the sun setting over Pelican Town from the front porch.",
  "CDE_Sebastian_Married_IndoorNight_3": "My caffeine buzz is still going. I probably should've cut off the coffee a few hours ago...#$e#I just didn't want it to go to waste. That, and it was a flavor I really like.",
  "CDE_Sebastian_Married_IndoorNight_4": "Maybe I drank too much coffee... I don't feel very tired.#$e#I'm still trying to adjust to the farm schedule. I used to stay up until 5am and sleep in until 2pm, sometimes.$h",
  "CDE_Sebastian_Married_IndoorNight_5": "I thought living down the road from my family wouldn't be quite far enough. But things feel a lot less tense just from not having to share a roof.#$e#I'm sure Maru's happy that I'm gone.",
  "CDE_Sebastian_Married_IndoorNight_6": "It's really cool to have our own place. I can do whatever I feel like and not have people nagging at me all the time.",
  "CDE_Sebastian_Married_IndoorNight_7": "I spotted a bat out the window earlier. It's kind of hard to see, but if you stay focused you can often catch them flittering about. They're out there.",
  "CDE_Sebastian_Married_IndoorNight_8": "Oh, hey. I made this, if you want it. It's not exactly restaurant quality, but I'm learning. [227 228]",
  "CDE_Sebastian_Married_IndoorNight_9": "I often felt unappreciated back home... but here I feel like I really belong. Thanks for making me feel welcome.$l",
  "CDE_Sebastian_Married_IndoorNight_10": "I don't feel tired, but I'll try to go to bed. I just want to have a chance to see you before you leave for the day.$7",

  //location specific dialogue
  "CDE_Sebastian_Married_funLeave_1": "I'm going to take a walk today. I need some time to myself. I'll see you in the evening.",
  "CDE_Sebastian_Married_funLeave_2": "Got a lot of stuff on my mind today. I'll let you know in the evening if it's still bothering me, but for now, I just need to go for a walk.",
  "CDE_Sebastian_Married_funReturn_1": "My day was fine, nothing much to tell you about. Why don't you tell me about yours?",
  "CDE_Sebastian_Married_funReturn_2": "Hmm? Oh, I'm in a pretty good mood, actually. How about you?$7",

  "CDE_Sebastian_Married_OneKid_1": "I'm still getting used to being a father. Don't worry, I'll take good care of our kid! It's just... something new.",
  "CDE_Sebastian_Married_OneKid_2": "Well, we've finally done it. We've discovered someone whose sleep schedule is even more erratic than mine. Thanks, %kid1.$s",
  "CDE_Sebastian_Married_OneKid_3": "Being a dad is so much harder than I ever would've thought... but I know you're the one earning our keep, so I promise I'll do my best every day.",
  "CDE_Sebastian_Married_OneKid_4": "Maybe when %kid1 is a little older, I'll get a sidecar for the bike and we can all go for a ride.$h",
  "CDE_Sebastian_Married_OneKid_5": "I didn't think I could love a tiny little human being so much. Seriously, I would do absolutely anything for this kid.$l",
  "CDE_Sebastian_Married_OneKid_6": "Have you smelled %kid1? Maybe it's time for a bath...",
  "CDE_Sebastian_Married_TwoKids_1": "I'm trying to keep the kids on a schedule to preserve my sanity. My own schedule's still all over the place, though.",
  "CDE_Sebastian_Married_TwoKids_2": "Don't worry, I already fed the kids... %kid2 spilled the chocolate milk all over my shirt again.",
  "CDE_Sebastian_Married_TwoKids_3": "I can't say this is exactly the kind of life I imagined when I first met you. But it does feel more purposeful than I ever would've imagined.$l",
  "CDE_Sebastian_Married_TwoKids_4": "I hope %kid1 and %kid2 are nice to each other. Maru and I always fought as kids. ...If I think back on it, it was mostly my fault...",
  "CDE_Sebastian_Married_TwoKids_5": "Sometime soon when the kids are both sleeping, I think I'll need some alone time. The kids have been running me ragged.$s",
  "CDE_Sebastian_Married_TwoKids_6": "I've had this recurring dream that %kid2 is wearing a shadow shaman costume and sitting on a glowing pumpkin. Weird, huh?",
  "CDE_Sebastian_Married_TwoKids_7": "We've come a long way, @. Look at our family. To be honest, I never really thought I'd end up in this situation.#$e#Now that I'm here, I like it...$l",

  "CDE_Sebastian_Married_Outdoor_1": "Hmm... sometimes I have to force myself to stay outside for health.#$e#I dunno what it is, but I like being indoors. Maybe I'm just so used to my dark basement.",
  "CDE_Sebastian_Married_Outdoor_2": "The sun's starting to get pretty bright. I'll probably head back in soon.#$e#At least the air is nice and fresh.",
  "CDE_Sebastian_Married_Outdoor_3": "I feel like I want to do something today... but I'm not sure what. Do you ever have that problem?",
  "CDE_Sebastian_Married_Outdoor_4": "Hah, I stayed up almost the whole night out here, reading under the porchlight. I might need a nap later.$h",
  "CDE_Sebastian_Married_Outdoor_5": "I'll just watch you from here. I enjoy watching you.$h",
  "CDE_Sebastian_Married_Outdoor_6": "Standing here on the porch like this... I wonder if someday I'fll grow to be a mysterious old mentor for some kid in town.$7",
  "CDE_Sebastian_Married_Outdoor_7": "I don't want to get soft now that I'm a married guy. Maybe I should start eating more hot pepper and working out? Just an idea...$h",
  "CDE_Sebastian_Married_Outdoor_8": "I went for a little walk just before you got up. Sounds like some animals are already up and alive.$7",
  "CDE_Sebastian_Married_Outdoor_9": "We should raise more slimes... In big quantities they can be pretty profitable. And they're so easy to raise.#$e#Also, different colored slimes produce different items. I dunno, I think it'd be kind of a fun hobby for us.",

  "CDE_Sebastian_Married_patio_1": "Need something? I'll just be over here working on my bike for a while.",
  "CDE_Sebastian_Married_patio_2": "I just want to make sure everything's in perfect shape. Next time I ride, I don't want any worries on my mind.",
  "CDE_Sebastian_Married_patio_3": "There's something meditative about working on a bike. Do you get the same feeling out in the fields?",

  //Date Specific Dialogue
  "CDE_Sebastian_Married_spring8": "My right eyelid keeps twitching. It's been doing that for almost a month.#$e#It's funny. I don't feel that stressed.#$e#Maybe it's from looking at screens so much. But I'm not giving those up for a little thing like this.$u",
  "CDE_Sebastian_Married_spring16": "I got picked on a lot as a kid. Doesn't really bother me anymore, though.#$e#If anything, it just helps me appreciate the present more.$7",
  "CDE_Sebastian_Married_spring26": "The wait's finally over. There's a new Cave Saga X that should be delivered later today.$h",
  "CDE_Sebastian_Married_spring28": "Man... I completely binged my way through the new Cave Saga X. I can't believe it's back to the waiting game again.#$e#I'll have to look through it again. There's probably some foreshadowing or secrets I missed.",

  "CDE_Sebastian_Married_summer5": "Are you putting on sunscreen today? Ugh. I'm sorry.#$e#You... do a lot for us, don't you? I'll... do some cleaning around the house today.$u#$e#Look, and if you want buy yourself a treat or something, I'm not gonna complain. You earn the money.",
  "CDE_Sebastian_Married_summer15": "Seriously, how is it this hot already? It's never a good sign when it's 6 AM and I've already stuck my head in the freezer once...$u",
  "CDE_Sebastian_Married_summer19": "There's a video game charity drive that's livestreaming today. I think I know what I'll be doing to keep my mind off the heat today.$h",
  "CDE_Sebastian_Married_summer22": "Don't you ever get tired running around all the time? I swear, you must have energy drink syrup for blood.$7",

  "CDE_Sebastian_Married_fall6": "I took another freelance job yesterday with an old client. This should keep me busy for a few days.$7#$e#I'm actually kind of excited to work on this one.$h",
  "CDE_Sebastian_Married_fall17": "Okay, I admit, I was smoking yesterday at the fair. But it was a special occasion. I promise you, I'm not getting back into it.$s",
  "CDE_Sebastian_Married_fall22": "I try to keep things in perspective when I recognize that everything is temporary. Everyone fades away eventually.#$e#Yeah, sometimes I go a bit overboard with these thoughts, but... I need them.$u#$b#Maybe that seems weird, but I really do.",

  "CDE_Sebastian_Married_winter3": "This kind of season is perfect for late night rides.$7#$e#Don't worry, I won't go if the roads are iced over. I'm not an idiot.$h",
  "CDE_Sebastian_Married_winter12": "The air is so dry and crisp. Just the way I like it.$h",
  "CDE_Sebastian_Married_winter19": "Hm. I usually go for coffee, but maybe today's a hot chocolate kind of day.$u#$e#With marshmallows.$7",
  "CDE_Sebastian_Married_winter24": "We'll be sitting down with my whole family tomorrow. You know... I'm actually kind of looking forward to it.$h",
  "CDE_Sebastian_Married_winter26": "...The snow's melting. *sigh*$s",
  //Season specific dialogue
  //Affection specific dialogue

  //Shane
  //Shane Gift Tastes
  "CDE_Shane_GoldPumpkin": "This thing's pretty cool. Where'd you manage to find it?$h",
  "CDE_Shane_Pearl": "Whoa, that's fancy. Are you sure?$6#$b#I'm just not used to getting fancy things like this.$4#$b#But thank you.$6",
  "CDE_Shane_PrismaticShard": "I feel...#$b#...pretty good holding this. Like, alarmingly good.$6#$e#What's with that thing, anyway? It's really nice.$4",
  "CDE_Shane_RabbitsFoot": " A nice little lucky charm, huh?$3#$b#Thanks for the gesture of support. This is actually really nice.$6",
  "CDE_Shane_Beer": "Hey, if you say so. You got anything for yourself?#$e#Welp, bottoms up.",
  "CDE_Shane_HotPepper": "Hey thanks, I've got some dipping sauce at home that'll go great with this.$h#$b#Or maybe I can just do the hot-pepper challenge, and eat it straight.#$e#You first.$u",
  "CDE_Shane_PepperPoppers": "Oh, you made 'em?$h#$b#...@, these are legendary! These are even better than the frozen kind!$10",
  "CDE_Shane_Pizza": "$c 0.8#Oh yeah, I can't say no to pizza. Thanks.$h#Pizza is love and pizza is life. You've got my number.$h",

  //Shane's Misc Dialogue
  //these lines target files other than the standard characters/dialogue/npc location such as unmarried rainy dialogue
  "CDE_Shane_rainy_1": "Hmm... this weather makes me thirsty.$u",
  "CDE_Shane_rainy_2": "Oh joy. Another rainy day.$s",
  "CDE_Shane_rainy_3": "Ehh, my socks are wet. Everyone's favorite.$s",

  //Shane's Standard Dialogue
  //Special Dialogue
  "CDE_Shane_Introduction": "I don't know you. Why are you talking to me...?",

  //date specific dialogue
  //I might change this so it fits better with his attempts to mitigate his alcoholism. It's pretty negative.
  "CDE_Shane_winter28": "Another year gone? Man.$u#$e#Take a wild guess what I'm doing all evening.",
  "CDE_Shane_spring1y2": "Buh, my head.$s#$e#Can I just sleep through this whole year?$s",

  //heart specific dialogue
  "CDE_Shane_summerMon10": "Jas and I played a pretty fun game yesterday. We made a little obstacle course outside.$h#$e#I know I haven't been a great influence on Jas, but you have to admit I have my moments.",
  "CDE_Shane_summerMon8": "I think Emily's nice just for the sake of being nice. I don't need her pity, but...#$b#...I don't -not- need her company, either.$u",
  "CDE_Shane_summerMon6": "$d Joja#I think I'll spend a little extra time in Joja's back room freezer when it's hot like this.$u|Hmm... what can I do to pass the time today?",
  "CDE_Shane_summerMon4": "I learned a while ago that it's easier to shut new people out before they get to know me.#$e#A lot of people just turn out to be jackasses.",
  "CDE_Shane_summerTue10": "Maybe I fell for Emily a little bit, at one point or another, but...$s#$b#...you're different in that you actually seem to be serious about wanting something from me, too.$l",
  "CDE_Shane_summerTue8": "$d Joja#My walk to work in the morning is nice during the summer. It's just so calm and not too hot yet.|Those chickens sure do get me up early. But at least the air's nice in the summer when the sun first comes up.",
  "CDE_Shane_summerWed8": "Marnie and Jas have put up with a lot of my crap. I actually feel motivated to do my best for them.#$e#That's not something I've felt in a long time.",
  "CDE_Shane_summerWed6": "$d Joja#*sigh* ...Every day is the same. Stocking those horrible shelves, going to the saloon, tossing and turning all night.$s|I hated my job at JojaMart, but now that I'm unemployed I feel even worse.$s",
  "CDE_Shane_summerThu10": "When your two best friends die on the same exact day, it really kind of messes you up.$s#$e#I had problems before they died, but that's really still the worst of it.",
  "CDE_Shane_summerThu8": "Man, the chickens won't stay out of trouble lately. Breaking stuff... Getting stuck in stuff...#$b#Hah, at least they need me for something.$h",
  "CDE_Shane_summerThu6": "Looking forward to gridball season?#$e#Sometimes it's fun to watch the junior league in the off-season, too. Tickets are cheaper.",
  "CDE_Shane_summerFri10": "Out of a million people, I bet you're the only one who wouldn't have bailed on me by this point.#$e#Hey, I don't take these things for granted.",
  "CDE_Shane_summerFri8": "Seeing people who have it all... the money, the house, the honor-student kids...#$b#...it almost seems even more depressing than what I've got.#$e#Hey there, sport! Congrats on another straight-A report card! Let's get ice cream!$10#$b#Gross.$u",
  "CDE_Shane_summerFri6": "I saw some old classmates' photos online.$s#$e#The most revolting ones are of the people who can't take a photo without their freakin' baby in the shot.",
  "CDE_Shane_summerFri4": "What a hot day. I could really use a cold one.#$e#You in?",
  "CDE_Shane_summerSun10": "@, one thing you should probably know is that I'm technically Jas's godfather.$s#$e#Marnie's really the one who's been raising her, though. I really screwed that one up.$s",
  "CDE_Shane_summerSun8": "$d Joja#Back to work for another week tomorrow. Yayyy...$s|I kind of miss having actual weekends, like I used to. But I guess that's the tradeoff for being a full-time chicken man, now.",
  "CDE_Shane_summerSun6": "Looks like I'm gettin' a little gut. Oh boy. Soon I'll be the guy who has it all!$u",

  "CDE_Shane_fallMon10": "Do you ever feel like the whole world is scrutinizing you like some disgusting insect?",
  "CDE_Shane_fallMon8": "I missed the gridball game last night. Whatevs. It's better live, anyway.",
  "CDE_Shane_fallMon6": "I saw some old classmates' photos online.$s#$e#The most revolting ones are of the people who can't take a photo without their freakin' baby in the shot.",
  "CDE_Shane_fallTue10": "It's strange how I don't ever seem to get bored with seeing you, @.#$e#That's never happened for me before.$l",
  "CDE_Shane_fallTue8": "Well, at least Clint's life is crappier than mine. Guy lives alone.#$e#Sorry, yeah, that was a crappy thing to say.$s",
  "CDE_Shane_fallWed10": "Your farm seems like a great place to raise chickens.$h",
  "CDE_Shane_fallWed8": "I guess I've grown attached to Marnie and Jas. We're a ragtag bunch but it kind of feels like a weird family.#$e#I never really had much of a family as a kid.$s",
  "CDE_Shane_fallWed6": "$d Joja#*sigh* ...Every day is the same. Stocking those horrible shelves, going to the saloon, tossing and turning all night.$s|I hated my job at JojaMart, but now that I'm unemployed I feel even worse.$s",
  "CDE_Shane_fallThu10": "I have my ups and downs still. But lately, things seem to be a bit better.#$e#Like, today's good, right? You stopped to talk, for one thing.$h",
  "CDE_Shane_fallThu8": "You like talking to me? I guess I believe you... maybe you're as weird as I am.$h",
  "CDE_Shane_fallThu6": "Hey @.#$e#So, are you drinking tonight? It's cool if you want to join me.",
  "CDE_Shane_fallFri10": "@, I appreciate you being there for me. But you realize that you're not gonna fix me, right?#$e#I'm just saying, what you see is what you get.#$e#Give it some thought. I don't want to hurt you.$s",
  "CDE_Shane_fallFri8_1": "Clint's a bit awkward. I don't know how Emily puts up with the obvious hots he's got for her.#$e#Or maybe she's just oblivious...$u",
  "CDE_Shane_fallFri8_2": "I'll definitely be going to the saloon tonight. What else is there to do?",
  "CDE_Shane_fallFri4": "$d Joja#That guy Sam? Yeah, I work with him. Don't really talk to him much, though.|That guy Sam? Yeah, we worked together. Never really talked to him much, though.",
  "CDE_Shane_fallSat10": "It never would've worked out for me and Emily... for obvious reasons. I'm glad I have you.$l^Emily and I were always just friends. I'm glad that we kept it that way.$l",
  "CDE_Shane_fallSun10": "A new chick hatched on our farm last night. It's been a good day so far.$h",
  "CDE_Shane_fallSun8": "If I watch more TV maybe I can forget about life. That would be relaxing.$u",
  "CDE_Shane_fallSun6": "...I think I might be gaining weight.$s",

  "CDE_Shane_winterMon10": "When your two best friends die on the same exact day, it really kind of messes you up.$s#$e#I had problems before they died, but that's really still the worst of it.",
  "CDE_Shane_winterMon8": "I don't get how someone like Emily is so content with her life.#$e#I couldn't put up with her job and her life if I were in her shoes.#$e#And I probably wouldn't hang out with guys like me, either.$s",
  "CDE_Shane_winterMon4": "I learned a while ago that it's easier to shut new people out before they get to know me.#$e#A lot of people just turn out to be jackasses.",
  "CDE_Shane_winterTue10": "My counselor's been helping me out a lot with my thoughts of suicide.#$b#Alcohol is still a tough one, though.#$e#A lot of people don't get it. I can't just 'stop going' to the saloon.$s",
  "CDE_Shane_winterTue8": "Do chickens have it better or worse than humans? Hmm...$u#$e#Worse, I'd say.#$b#Unless they're free-range chickens. Then... I don't know.",
  "CDE_Shane_winterTue4": "Poor little mother cluckers are stuck inside all winter long. Gotta take good care of them.#$e#You got that I meant chickens, right?$u",
  "CDE_Shane_winterWed8": "I try to do my best for Jas. She says she has some good memories with me already.#$e#I don't remember some of the ones she mentions, though.$s",
  "CDE_Shane_winterWed6": "$d Joja#*sigh* ...Every day is the same. Stocking those horrible shelves, going to the saloon, tossing and turning all night.$s|I hated my job at JojaMart, but now that I'm unemployed I feel even worse.$s",
  "CDE_Shane_winterThu10": "I'll say... I had you completely wrong.#$b#First time I saw you, I thought you'd be an absolute tool. I'm glad I was wrong.$h",
  "CDE_Shane_winterThu8": "You like talking to me? I guess I believe you... maybe you're as weird as I am.$h",
  "CDE_Shane_winterThu6": "Kind of a crappy day today...$s#$e#So what's the drunkest you've ever been?",
  "CDE_Shane_winterFri10": "$d Joja#The thought of getting to see you is what gets me through the day. Are we hanging out tonight?|Hey, I hope you're staying warm. I've got an old coat you can borrow if you need it.",
  "CDE_Shane_winterFri8": "Seeing people who have it all... the money, the house, the honor-student kids...#$b#...it almost seems even more depressing than what I've got.#$e#Hey there, sport! Congrats on another straight-A report card! Let's get ice cream!$10#$b#Gross.$u",
  "CDE_Shane_winterFri6": "I'll definitely be going to the saloon tonight. What else is there to do?",
  "CDE_Shane_winterSun10": "What you have to understand, @, is that when I do my best, it looks a lot worse than what other people do.$s#$e#I just thought you should know that.",
  "CDE_Shane_winterSun8": "What's it like for those functional alcoholic millionaires? Like, the CEOs who always have half a minibar behind their desk?#$b#Do they just stay plastered all day and get paid for it? 'Cause if so, sign me up.#$e#Looks like I missed my calling.",
  "CDE_Shane_winterSun6": "It's been an interesting gridball season.#$e#Or so I hear. I've missed a ton of the games.",

  "CDE_Shane_Mon8": "Emily's a pretty good girl. She gives me beer and she listens. Not much else I need.#$e#You're pretty cool, too.",
  "CDE_Shane_Wed10": "My counselor's been helping me out a lot with my darkest thoughts. I think I'm moving past 'em.#$b#Alcohol is still a tough one, though.#$e#A lot of people don't get it. I can't just 'stop going' to the saloon.$s",
  "CDE_Shane_Wed6": "$d Joja#*sigh* ...Every day is the same. Stocking those horrible shelves, going to the saloon, tossing and turning all night.$s|I hated my job at JojaMart, but now that I'm unemployed I feel even worse.$s",
  "CDE_Shane_Wed4": "Have I ever gotten really weird and vulnerable with you while I was drunk? I have the tendency to do that.$u#$e#Whatever I said, don't read into it.$u",
  "CDE_Shane_Wed2": "...'Suuuuup.$s",
  "CDE_Shane_Thu10": "I have my ups and downs still. But lately, things seem to be a bit better.#$e#Like, today's good, right? You stopped to talk, for one thing.$h",
  "CDE_Shane_Thu2": "...'Ey.$s",
  "CDE_Shane_Fri2": "You're just not gonna leave me alone, are you? $s",
  "CDE_Shane_Sat10": "Oh man, I got really drunk before I went to bed last night.$s#$q 530/531/532 Sat_old#You must be disappointed in me.#$r 530 -250 Sat_530#Yeah! I thought you wanted to get clean!#$r 531 0 Sat_531#Recovery has its ups and downs.#$r 531 0 Sat_531#Sorry, I know it's hard for you.#$r 532 -50 Sat_532#No prob. You do you.",
  "CDE_Shane_Sat_old": "$p 530#Look, I'm doing my best. I'm sorry if I let you down sometimes.$s|But I appreciate that you're always around, no matter what.",
  "CDE_Shane_Sat_530": "...#$b#Well clearly I'm not good enough for you.#$b#It's cool. Go hang out with someone else.",
  "CDE_Shane_Sat_531": "...#$b#How are you such a good person? Don't you ever get mad about anything?$s#$e#Thanks, though.",
  "CDE_Shane_Sat_532": "...#$b#Seriously, what the hell. Do you even care about what I do?$a",

  //generic weekday dialogue
  "CDE_Shane_Mon": "I don't know you. Why are you talking to me?",

  //Shane's Married Dialogue
  //weather specific dialogue
  "CDE_Shane_Married_RainyDay_1": "I hope Jas and Marnie are doing alright without me.#$e#I'm not too worried... Jas is old enough now to take care of the animals on her own.",
  "CDE_Shane_Married_RainyDay_2": "Do me a favor... when I pass away, use my dust to fertilize some corn for the hens.",
  "CDE_Shane_Married_RainyDay_3": "My knees are kind of stiff today. Does that ever happen to you, or is that just me?$s",
  "CDE_Shane_Married_RainyDay_4": "Here... take this.[346 174 303 305 215] I bought some of those a while ago and they're almost expired...",
  "CDE_Shane_Married_RainyDay_5": "Here, take this for later. [346 346 303] Just a little reminder not to work too hard when you can afford to be lazy.",
  "CDE_Shane_Married_RainyDay_6": "Buhh... I don't feel like being productive today.",
  "CDE_Shane_Married_RainyDay_7": "...Alright. Screw it. I'm dipping my pizza in ranch dressing today.$u",
  "CDE_Shane_Married_RainyDay_8": "Well, should I do something useful today?... or just nap forever?",
  "CDE_Shane_Married_RainyDay_9": "I was so dedicated last night to doing some sit-ups today. But this rain is really killing my motivation.",

  "CDE_Shane_Married_RainyNight_1": "Hmm... seems like a good night to microwave a few pizza rolls.#$e#Some people like to cook them in the oven, but it just takes too long for me. Plus I like that squishy texture.$h",
  "CDE_Shane_Married_RainyNight_2": "The tip-tappa-tip of the rain takes me to a different time... a different place.",
  "CDE_Shane_Married_RainyNight_3": "I hope Charlie's not scared out there.$u",
  "CDE_Shane_Married_RainyNight_4": "I guess... if I had some pants I might've gone outside today... but, nah.",
  "CDE_Shane_Married_RainyNight_5": "What if we just let Charlie live inside? It's not like there'd be that big a mess...$u",
  "CDE_Shane_Married_RainyNight_6": "I like gloomy weather, but I feel kinda bad for the hens.",
  "CDE_Shane_Married_RainyNight_7": "I still can't believe how you spend all that time outside when it rains, just like it's no big deal.",
  "CDE_Shane_Married_RainyNight_8": "Tip-tappa-tip-tappa-tip... I'm starting to feel thirsty.$6",
  "CDE_Shane_Married_RainyNight_9": "Do we have any homemade brews? Guess I'm feelin'... fancy tonight.",

  "CDE_Shane_Married_IndoorDay_1": "Buh... sometimes life feels like a slow, gray blur... know what I mean?",
  "CDE_Shane_Married_IndoorDay_2": "Here's to the start of another pointless day. Hey, not that that has to be a horrible thing.",
  "CDE_Shane_Married_IndoorDay_3": "Hey. Take this... I put a bit too much in the microwave. [195 215 206]Sorry if it's squishy.",
  "CDE_Shane_Married_IndoorDay_4": "Open your mouth. And close your eyes. And you'll get... a big surpriiiise. [195 215 206]",
  "CDE_Shane_Married_IndoorDay_5": "You know what? I think I've lost some weight since moving in with you.$6",
  "CDE_Shane_Married_IndoorDay_6": "Does it ever annoy you, that I'm not as peppy as a stereotypical dream husband?",
  "CDE_Shane_Married_IndoorDay_7": "*smooch*... Mmm, it tastes like someone's been nibbling on pizza rolls.$6",
  "CDE_Shane_Married_IndoorDay_8": "Hey, don't brush your hair. You're looking hot this morning.",
  "CDE_Shane_Married_IndoorDay_9": "I may keep to myself a lot, and I may seem unhappy sometimes... but I do appreciate all the work you do. I'm a lucky guy.$6",
  "CDE_Shane_Married_IndoorDay_10": "Give me something positive to focus on. I know it should feel like a good morning; I just need some help getting there.",

  "CDE_Shane_Married_IndoorNight_1": "I'm just gonna have a couple more beers before closing my eyes for the night.",
  "CDE_Shane_Married_IndoorNight_2": "I took a nap while you were out. I hope that doesn't screw up my sleep cycle.",
  "CDE_Shane_Married_IndoorNight_3": "If... If only... ah, I was just thinking back on the glory days, when I played gridball on the varsity team.$6#$b#Now I'm old and weak, though...",
  "CDE_Shane_Married_IndoorNight_4": "Ughh... *gurgle*... I feel a little bloated... oof... too much Joja all-purpose dipping sauce.",
  "CDE_Shane_Married_IndoorNight_5": "Hey, I was good today. I wanted to finish the bag of Carbo Cones, but I held off.",
  "CDE_Shane_Married_IndoorNight_6": "Buh... I wish I was six inches taller and a whole lot smarter... But you like me for who I am? I still have a hard time understanding that...",
  "CDE_Shane_Married_IndoorNight_7": "Hey. Want to... go to bed when I do?$l",
  "CDE_Shane_Married_IndoorNight_8": "I spent all day watching TV and now my legs feel like soft dough. Guess I'll have to take it easy until tomorrow.",
  "CDE_Shane_Married_IndoorNight_9": "Maybe I should drink something to help me sleep. Not a good solution, but it'd beat staying up all night.",

  //locational specific dialogue
  "CDE_Shane_Married_funLeave_1": "I'm going to go out today, alright?",
  "CDE_Shane_Married_funLeave_2": "Time for me to get a change of scenery or the walls'll close in. I'll be back later today.",
  "CDE_Shane_Married_funReturn_1": "Sorry if I'm sweaty... That was quite a walk... Buh, I'm out of shape.$6",
  "CDE_Shane_Married_funReturn_2": "Yeah, I had a good time going out. Don't worry, though. I was good.",

  "CDE_Shane_Married_OneKid_1": "It's weird, when I was younger I swore I'd never have a kid. I wonder what happened to me?$6",
  "CDE_Shane_Married_OneKid_2": "I want to make sure I don't screw things up for %kid1. Just... have some patience with me.",
  "CDE_Shane_Married_OneKid_3": "Let's make sure to give this kid lots of eggs... Baby's gotta grow those legs!",
  "CDE_Shane_Married_OneKid_4": "I want to give %kid1 the best childhood ever. I've got to make up for at least some of my screw-ups of the past.",
  "CDE_Shane_Married_OneKid_5": "Papa Shane reporting for duty...$6#$e#Buh... I've become corny in my old age.",
  "CDE_Shane_Married_TwoKids_1": "Well, if the kids stop behaving themselves today, I can always bust out some tunes for a spontaneous dance party.",
  "CDE_Shane_Married_TwoKids_2": "I already fed the kids two bowls of pizza puffs cereal. They'll be full for a while.",
  "CDE_Shane_Married_TwoKids_3": "I'll be honest... two kids is enough for me.#Oh my god, how does anyone ever raise more than two kids? I'm so exhausted.$s",
  "CDE_Shane_Married_TwoKids_4": "Whew... I hope the kids wind up with more of your traits than mine.",
  "CDE_Shane_Married_TwoKids_5": "Ugh... %kid2 is being a little brat today. Must've gotten that from me...",
  "CDE_Shane_Married_TwoKids_6": "*Sigh*... If only we could send the kids off to Joja work-camp for a season...#$e#I'm just kidding.$h",

  "CDE_Shane_Married_Outdoor_1": "I didn't sleep well last night so I'm hoping this fresh air will get the juices flowing.#$e#What juices, you ask? Heh... you're weird.$h",
  "CDE_Shane_Married_Outdoor_2": "Sometimes I stop and realize that I'm nothing more than a bag of juicy, squishy flesh.#$e#But hey... that's just fine... what's life, anyway?$h",
  "CDE_Shane_Married_Outdoor_3": "When I stop and think about it... I'm in a good place. My life is pretty nice.$6",
  "CDE_Shane_Married_Outdoor_4": "I can't really think of a better place to be right now, than here. Gotta keep things in perspective, right?$6",
  "CDE_Shane_Married_Outdoor_5": "Ooohh... my tongue is swollen from eating too many pepper poppers.$s",
  "CDE_Shane_Married_Outdoor_6": "Dang. I didn't realize how stagnant the air in my lungs was till I got out here.",
  "CDE_Shane_Married_Outdoor_7": "Hey. You were sleeping like a baby so I slipped out of bed and went for a morning walk around the farm. Everything looks fine.",
  "CDE_Shane_Married_Outdoor_8": "I don't know why, but I'm just feeling pretty good this morning. I must've slept well.$h",

  "CDE_Shane_Married_patio_1": "Charlie's doing well.$8",
  "CDE_Shane_Married_patio_2": "If Charlie's in a good mood, I'm in a good mood, too.$8",
  "CDE_Shane_Married_patio_3": "I love this bird.$9#$e#Sorry, babe. You're my one true love, but Charlie is my one true-true love.$9",

  //Date Specific Dialogue
  "CDE_Shane_Married_spring2": "It was awesome yesterday, seeing the chickens get outside for the first time in a while.$h",
  "CDE_Shane_Married_spring14": "Buh, I think I'm on post egg festival withdrawal. Just not a lot to look forward to for a while.$s#$e#Don't worry, I'll be alright in the long run. This always happens to me.",
  "CDE_Shane_Married_spring19": "Eventually, everyone gets tired of everything.#$b#Ha, am I just ahead of my time, or something?$h",
  "CDE_Shane_Married_spring27": "I'll admit I did not... drink in moderation the other night.$s#$b#But still, I'm a helluva lot better off than I was before I met you. I just hope that makes sense from your perspective.#$e#I mean, you haven't discovered me passed out cold any time lately, right?",

  "CDE_Shane_Married_summer2": "We're growing hot peppers this summer, right?",
  "CDE_Shane_Married_summer4": "Man, I miss Jas. Today's her birthday, too.#$e#I knew there was something I was forgetting.",
  "CDE_Shane_Married_summer12": "Ha, it was awesome yesterday, seeing Emily do her thing on the dance floor. Glad she's as well as ever.$h",
  "CDE_Shane_Married_summer16": "...Another year's gone by since I 'adopted' Jas. And then promptly screwed it all up.$s#$e#Things are turning out alright for her. No thanks to me.$s#$e#I guess things would've been different if it happened now. With you around, I'm a lot more stable than I used to be, believe it or not.",
  "CDE_Shane_Married_summer17": "How do people like you and Marnie just keep it together all the time? I don't even know where I'd be if Marnie hadn't taken in Jas... and me.$s#$e#Well, and then you came along.$l",

  "CDE_Shane_Married_fall3": "I suddenly felt like cooking, so I made omelets. Here you go. [195]#$e#Just don't ask me to do much real cooking besides this. Seriously. You'd regret it more than I would.$h",
  "CDE_Shane_Married_fall7": "Oh that's right. Gridball season just started. I'll have to check if there are any good games coming up.",
  "CDE_Shane_Married_fall10": "Today's a good day for a playthrough of Turbo 2. Or maybe Paths of Fury 2.#$b#Hm. ...Or maybe both.$u",
  "CDE_Shane_Married_fall12": "I was walking around yesterday, looking all over the farm. It's really something else, isn't it?#$e#YOU'RE really something else, I mean.$h",
  "CDE_Shane_Married_fall23": "We live for sleep. Everything we do is about it. We work, so we get tired, so we can sleep.#$b#We eat, so we're not hungry, so we can sleep. We do creative things so we feel fulfilled, and then we sleep.#$b#Are we all just unknowingly training to get more comfortable with our inevitable deaths?$u",

  "CDE_Shane_Married_winter1": "Any big plans this winter? I'll probably end up watching a lot of TV and just hanging out around the house.",
  "CDE_Shane_Married_winter28": "Well, another year gone by... I look a little older...$6#$b#...but you look good as ever.",
  //Season specific dialogue
  //Affection specific dialogue

  //Vincent
  //Vincent Gift Tastes
  "CDE_Vincent_GoldPumpkin": "*gasp* I knew it was real! The golden pumpkin is real!$h#$e#Mom didn't believe me that it's real, but it's real!",
  "CDE_Vincent_RockCandy": "You mean this candy will give me tons of extra energy? *crunch*#$b#...#$b#I don't feel any different.#$e#Tastes yummy, though! Thanks!$h",
  "CDE_Vincent_Pearl": "Cool! A marble!",
  "CDE_Vincent_PrismaticShard": "Is this candy? It looks really good!$h",
  "CDE_Vincent_CranberryCandy": "Mom says I can't have anymore candy today, except if it's a gift from you, then it's a 'special occasion.'#$b#Yayyy!$h",
  "CDE_Vincent_GingerAle": "I love soda!#$b#...#$b#It makes you burp!",
  "CDE_Vincent_Grape": "These taste like purple popsicles, but not frozen! Thanks, Mr. @!^These taste like purple popsicles, but not frozen! Thanks, Ms. @!",
  "CDE_Vincent_PinkCake": "Wowww. That looks... amazing.$u#$b#I can't believe you're giving it to me!$h#$e#Oh yeah, thank you!",
  "CDE_Vincent_Snail": "...Cool!",

  //Vincent's Misc Dialogue
  //these lines target files other than the standard characters/dialogue/npc location such as unmarried rainy dialogue

  //date specific dialogue
  "CDE_Vincent_spring1": "I am so happy today! Eeeeee!$h",
  "CDE_Vincent_spring12": "Finally! The egg festival is tomorrow!$h#$e#I always find the eggs that all the grown-ups are too tall to notice.$h",
  "CDE_Vincent_fall26": "It's Spirit's Eve tomorrow! I'm gonna get so scared!$h",
  "CDE_Vincent_winter24": "Feast of the Winter Star! I can't believe it's finally happening tomorrow!$h#$e#Are you excited, too?",
  "CDE_Vincent_winter28": "I get to stay up until midnight tonight!",

  //heart specific dialogue
  //i've been advised that for vincent specifically we may want to change the year qualifiers to a GSQ to see if kent has returned or not. we can revisit that when we are done migrating.
  "CDE_Vincent_summerMon10": "I'm bored. I wanna go on an adventure. When I'm older, I want to visit every single island in the gem sea.",
  "CDE_Vincent_summerTue4": "What's your favorite flavor of ice cream?#$e#Mine's mint chip.",
  "CDE_Vincent_summerWed6": "The rock-climbing wall is pretty fun, but I've climbed it so many times.",
  "CDE_Vincent_summerThu10": "I heard all the dinosaurs died out a long time ago. Is that true? Mr. Gunther says there are still tons of them living underground. But only some of the species.",
  "CDE_Vincent_summerFri10": "Ugh, I have a headache. Mom says it's 'cause I didn't drink enough water.$s#$e#I drank a lot of juice. Juice has water in it.$s#$e#What kind of juice? Orange soda.$s",

  "CDE_Vincent_fallMon10": "If I had a pet dinosaur, I'd name him Chompy. I wouldn't want him to chomp any people, though. Only bad guys.",
  "CDE_Vincent_fallWed8": "My big brother lets me try his guitar every once in a while.#$e#I can't play anything, though. I don't think I'll ever be as good as him.",
  "CDE_Vincent_fallThu8": "Jas is pretty cool. And not just for a girl, either.#$e#She's really smart, too.",
  "CDE_Vincent_fallThu4": "I tried throwing a gridball back and forth once with that guy Alex, but I couldn't keep up with how far he'd throw.",
  "CDE_Vincent_fallSat10y2": "Sam got me to try some of mom's fish casserole. It's kind of gross, but it also has cheese and noodles in it.#$b#So that makes it kind of good.",
  "CDE_Vincent_fallSun4": "There's so much mud outside!#$e#Mom's not a big fan.",

  "CDE_Vincent_winterTue4": "I built a block tower yesterday that was even taller than my brother!$h#$e#I had to stand on a stool to make it.",
  "CDE_Vincent_winterThu10": "I had a bad dream last night.$s#$e#I dreamt that Dad was gone again. Forever.$s#$e#I know. It's not real. But it was still scary.$s",
  "CDE_Vincent_winterFri10": "A long time ago, I hit Jas when we were playing.$u#$e#I always make sure I'm nice to her now.",
  "CDE_Vincent_winterSat10": "Hey! Wanna play in the snow?#$e#The snow is perfect today for the best snowballs ever!",

  "CDE_Vincent_Mon10y1": "@, maybe you can be my dad until my real dad comes back!^Even though you're a girl, maybe you can be my dad until my real dad comes back.",
  "CDE_Vincent_Mon10y2": "@, was your dad ever like mine?$u",
  "CDE_Vincent_Mon8_1": "Mom gave me a haircut. She's the one who usually does it.#$e#A long time ago, Sam gave me a haircut. He got in big trouble!$h",
  "CDE_Vincent_Mon8_2": "Mom made me stop playing just to show me Dad sleeping in.$u#$e#Then she started crying. It was really weird.$u",
  //intentionally changed from y1 and y2 in order to randomize between the two lines in year 2. _1 will still be the only one shown in year 1.
  "CDE_Vincent_Mon2": "My brother's really good at video games. I like watching him play more than I like playing against him.",
  "CDE_Vincent_Tue8inlawPenny": "It's so cool how you're married to my teacher.#$e#I never thought that would have happened!",
  "CDE_Vincent_Tue6y2": "Sam threw out some of his old computer games after Dad got back.$u#$e#I think they were the shooting ones.$u",
  "CDE_Vincent_Tue4": "I like to collect Foroguemon cards.#$e#My big brother only plays with me sometimes, though.",
  "CDE_Vincent_Wed8": "I wanna look for bugs, but Mom gets mad when I'm all dirty.#$b#It's a tough choice.",
  "CDE_Vincent_Wed6": "I found a millipede outside yesterday.#$b#Is it really called a millipede because they have a million legs?",
  "CDE_Vincent_Wed4": "There's spring onions out in the forest. Do you know how to find them?#$e#The taste of them is pretty bad, though. I just like hunting for 'em.",
  "CDE_Vincent_Thu8": "If I had a farm like you, I'd want it to be a candy farm!$h#$e#I know, I know, I'm just being silly.",
  "CDE_Vincent_Thu6": "It's fun living so close to Marnie's Ranch.#$e#I saw a cow wink at me one time.",
  "CDE_Vincent_Fri8": "Sam used to be kind of mean to me when I was little. But these days, he's a lot nicer to me.",
  "CDE_Vincent_Fri4": "Do you grow anything good on your farm?",
  "CDE_Vincent_Fri2": "Mom said she's making yellow curry tonight. Does that have curry powder in it?$u#$e#It does? Awwwww.$s",
  "CDE_Vincent_Sat10y2": "I wish Dad would play with me more...$u",
  "CDE_Vincent_Sat8y2": "I had a bad dream last night.$s#$e#I dreamt that Dad was gone again. Forever.$s#$e#I know. It's not real. But it was still scary.$s",
  "CDE_Vincent_Sat6y1": "My dad's gone, but Jas's mom and dad aren't around either.$u#$e#She never talks about them. And Ms. Penny says I shouldn't ask.$u",
  "CDE_Vincent_Sat4y1": "*sigh*... When's Dad coming back?$s",
  "CDE_Vincent_Sat4y2": "I'm having fun today! Are you?",
  "CDE_Vincent_Sat2": "Do you know anyone in the army? That's where my dad works.",
  "CDE_Vincent_Sun8": "I tried some of Mom's yellow curry. It was actually really good.#$b#But ONLY because of the sauce. Vegetables are still icky.",
  "CDE_Vincent_Sun4": "Ms. Penny makes me read a new book every week.$s#$b#At least she lets me pick them, sometimes!",

  //some of these are redundant, like fallSat10y1 and Sat10y1, and Sat and Sat6. we can add a comment to the end of the line for keys like this if its specifically imporatant that the line show up on sats with 6 hearts, and on any other saturdays when no more specific conditions have been met. otherwise i recommend moving them to generic weekday dialogue and freeing up the heart key. if no other key takes priority this would result in the line showing up on Sat6 at any heart level, otherwise lines with more importance would cover it up.
  //can summerSun10+Thu4 become Thu4? is it a 10 heart line? can winterSun10 be the same way? can we rehome fallSat10y1's line to be something players can see, or if you don't want it seen, can we remove it from the code so that the 10 heart key is freed up for other modders to use?
  "CDE_Vincent_summerSun10+Thu4": "How long can you hold your breath?#$b#I can hold mine for... eight minutes.#$e#Yuh-huh. I can.#$e#...But I just don't want to right now.",
  "CDE_Vincent_fallSat10y1+Sat10y1": "@, was your dad around much when you were a kid?$u",
  "CDE_Vincent_winterSun10+Tue2": "Red flavored gummies are really good, but the purple kind in this new brand is really REALLY good.#$e#The only problem? The other colors that come with the purple kind aren't as good.#$b#Hmmmmmmmmm...",
  "CDE_Vincent_Tue8+Tue6y1": "Can you keep a secret, mister?^Can you keep a secret, miss?$u#$b#I wanna marry Miss Penny when I grow up.#$e#Just don't tell her, okay?$u",
  "CDE_Vincent_Sat6y2+Saty2": "Dad seems weird since he came back. I wonder what happened to him?$s",

  //generic weekday dialogue
  "CDE_Vincent_summerTue": "Hey Mister @.^Hey Miss @.#$e#Is there anyone in town who you like?#$e#Yeah, like... LIKE like.$h#$e#Aw, c'mon, tell me!",
  "CDE_Vincent_summerWed": "Whoa! Cool! You're all sweaty!",
  "CDE_Vincent_summerSat": "Sam showed me this music video with a bunch of dancing crabs. It's so funny!#$e#If I saw dancing crabs in real life at the beach, I'd be like, 'Whaaaat?'$h",

  "CDE_Vincent_fallTue": "I've been collecting leaves. I found a bunch of really bright red ones!",
  "CDE_Vincent_fallWedinlawSam": "How's my brother doing?#$e#I guess he's a real grown-up now!",
  "CDE_Vincent_fallWed": "Did you know? My big brother is basically a rock star.$h",
  "CDE_Vincent_fallFri": "Ew, it's boiled beet night again...$s",

  "CDE_Vincent_winterMon": "I can't wait for the Feast of the Winter Star!$h#$e#I hope I get some toys! Or maybe something yummy!",
  "CDE_Vincent_winterWedinlawSam": "So are you and my brother like... really super in love?#$e#Hahaha!$h",
  "CDE_Vincent_winterWed": "Mom doesn't count hot chocolate as junk food when it's snowy.#$e#It's nice.",
  "CDE_Vincent_winterFri": "Ms. Penny's a pretty good teacher.#$b#I don't get a lot of questions right, but she's always really nice.",

  "CDE_Vincent_WedinlawSam": "How's my brother doing?#$e#I can't believe we're related now!$h",
  "CDE_Vincent_Fri": "Oh no... Mom's making lentil soup tonight.$s",
  "CDE_Vincent_Saty1": "Dad's coming back soon!#$b#I hope he brings me some toys.$u",

  //Willy
  //Willy Gift Tastes
  "CDE_Willy_GoldPumpkin": "I do love a good pumpkin, but this one's golden? Har har! What'll ye find next?$h",
  "CDE_Willy_Pearl": "If a mermaid sees me holdin' this, I reckon I'll be pretty popular! Har har!$h",
  "CDE_Willy_PrismaticShard": "Now THAT'S a treasure, lad!$h^Now THAT'S a treasure, miss!$h#$b#Supposin' I get picked up by pirates, this stone'll make a hearty ransom for my life, and then some!",
  "CDE_Willy_RabbitsFoot": "Thanks indeed. I can always use a little more luck when I go fishing.$h",
  "CDE_Willy_Catfish": "Aye, this'll make a fine meal. One o' the finest!$h#$b#Thanks, lad.$h^Thanks, miss.$h",
  "CDE_Willy_Diamond": "Come to share yer treasures with me? What a kind soul you are!$h",
  "CDE_Willy_IridiumBar": "Well I'll be! I could make a new iridium rod with this.$h",
  "CDE_Willy_Mead": "This was always ol' Pappy's favorite. My favorite now, too. Thanks, lad.$h^This was always ol' Pappy's favorite. My favorite now, too. Thanks, miss.$h",
  "CDE_Willy_Squid": "What a battle this one must've been! Aye, look at those arms wriggle!$h",
  "CDE_Willy_Pumpkin": "Ahh, the smell o' fresh pumpkin with the smell o' my old shack... It doesn't get much better than that.$h",
  "CDE_Willy_SeaCucumber": "Ah, a lad of sophisticated tastes, I see!$h^Ah, a lass of sophisticated tastes, I see!$h#$b#Sea cucumber is one o' the tastiest creatures in the sea, but it takes a bit o' practice to enjoy.",
  "CDE_Willy_Sturgeon": "Why, this one looks fit for a royal feast! What a lunker!$h",

  //Willy's Misc Dialogue
  //Willy has no rainy day dialogue at current

  //date specific dialogue
  "CDE_Willy_spring1y2": "Ahoy there! A happy new year to you, too!$h#$e#I'm surprised you found time to visit me. Today's such a busy day for your farm, right?$h",
  "CDE_Willy_summer4": "Looks like tuna have shown up off the coast of our beach. Be sure to stock up on 'em. They'll be gone again until winter.",
  "CDE_Willy_winter7": "Will you go ice fishing tomorrow at the festival? I don't even care whether I win these days. I just like to see more folks fishing.$h",
  "CDE_Willy_winter15": "I think I'll be needin' some peace and quiet from the night market after these next few days.#$e#I'll just have to manage until then.",
  "CDE_Willy_winter28": "Another year down. The passage of time is a beautiful thing if you can learn to appreciate it.",

  //heart specific dialogue
  "CDE_Willy_springFri8": "If you catch a really common fish, it's actually more profitable to clean it and cut it yourself.#$e#That's if you're sellin' elsewhere. Me, I only buy whole fish.",
  "CDE_Willy_springFri2": "Catfish will only bite when it's raining. You can catch 'em in fresh water in the spring and fall.#$e#Just thought I'd mention it. Catfish is one o' my favorites.$h",

  "CDE_Willy_summerMon10": "The islands south of us sure are some beauties, with Ginger Island bein' the best one, I think.",
  "CDE_Willy_summerTue10": "If ya listen closely to the fish, they'll tell ya what they want.#$e#Some o' them are li'l prima donnas, heh! I'm thinking those sturgeons have some delusions of grandeur.$h",
  "CDE_Willy_summerWed10": "Lately, I've been wonderin' if I've taken too much from the ocean. What could I give back to it? I owe it my entire livelihood.$s",
  "CDE_Willy_summerWed2": "That carpenter Robin'll build you a fish pond, mmm? That could work. Just make sure you treat those fish extra well.#$e#Some of 'em just need the wild ocean, or the streams, y'know? Not all fish live in ponds for a reason.",
  "CDE_Willy_summerThu6": "If you're fishing for tilapia this summer, make sure you do it in the morning.#$e#Sometimes, they'll show up in the early afternoon, but it's not too often.",
  "CDE_Willy_summerThu2": "It's rainbow trout season.#$b#And this is the only season when you can get 'em. Be sure to stock up if you like cooking with them.",
  "CDE_Willy_summerFri4": "If you ever catch a lobster in a crab pot, be sure to share some with Elliott. It's his favorite.",
  "CDE_Willy_summerSat10": "I woke up early this mornin' because there was a big ol' crab pinchin' my toe.$s#$e#Oh, I'm alright. He'll make a good dinner.$h",
  "CDE_Willy_summerSun10": "Keep an eye on the tide pools this season, 'specially after it rains.#$e#Those waves bring a lot to shore. You'll see what I mean.$h",

  "CDE_Willy_fallMon2": "The walleye is one o' the rarest fish you'll find in these parts. Try casting a line in fresh water when it rains this season.",
  "CDE_Willy_fallTue10": "Y'know, I'm comin' 'round to the idea of farm-raised fish. If anyone's gonna be listenin' to the fish and what they want, it'd be you, hmm?",
  "CDE_Willy_fallWed10": "*sniff sniff* Could be time for a wash. My clothes're all crusty.$s",
  "CDE_Willy_fallFri6": "A lot o' salmon have come swimming upstream. Be sure to catch 'em while they're here.#$e#You can only find salmon in the fall.",
  "CDE_Willy_fallFri2": "When it rains this month, be sure to catch some eels in the ocean. Otherwise, you'll have to wait until spring.",
  "CDE_Willy_fallSun10": "How's the mountain lake doing? I don't hike up there much anymore...",

  "CDE_Willy_winterTue8": "I guess I've gotta be thankful for farm-raised fish.#$b#If everyone ate nothin' but the good stuff I like to catch, we'd just about fish this whole ocean right up.",
  "CDE_Willy_winterWed10": "I've not been to Prairie Island in some time now. That was when I was much younger.#$e#I think I've seen some Prairie Island folks at the night market.",
  "CDE_Willy_winterThu10": "I wonder how Clint's doing.#$e#We see each other at the saloon all the time but we never get to talking much.",
  "CDE_Willy_winterSat10": "Ooh, I just don't have the strength I once had.#$b#But it's still plenty enough. Don't you worry about me.$h",
  "CDE_Willy_winterSun10": "Seein' the children in town always brings a smile to my face.$h",

  "CDE_Willy_fallThu10+Sat4": "If you see me out fishing, you just come on up beside me and cast your line, too.#$b#You're always welcome to.$h",
  "CDE_Willy_winterMon10+Thu4": "Sometimes I can find someone who'll play checkers with me at the Saloon.#$e#It's important to have a little human contact every now and then, no matter how comfortable I can be by myself.",

  "CDE_Willy_Mon8": "I'll post some more fishing challenges on Pierre's bulletin board if the mood fancies me. I hope you'll keep an eye out for 'em.",
  "CDE_Willy_Mon6": "If you sell me some fish, I'll be sure to tell whoever buys it that you're the one who caught it.$h",
  "CDE_Willy_Mon2": "Ahoy there, son.^Ahoy there, lass.#$b#Looks like decent weather for fishing, eh?",
  "CDE_Willy_Tue8": "I'm happy that I entrusted you with my old rod, @, back when we first met. You've been a good friend.$h",
  "CDE_Willy_Tue4": "To take the life of a fish, you have to respect it first. You certainly won't last long in this profession, otherwise.",
  "CDE_Willy_Tue2": "There are two worlds: the one we live in, and the much, much older one beneath the water.#$e#I think of what I do as a dialogue between those two worlds.",
  "CDE_Willy_Wed8": "I've never been married, no.#$e#I loved someone once, long ago. She left me for another man.#$e#Sometimes, the one that gets away, stays away forever.$s",
  "CDE_Willy_Wed6": "Remember, anywhere there's water, there's likely to be fish.#$b#You get out a little more than I do, so I hope you find some exotic varieties.$h#$e#Just don't bring it to me if it's a bit TOO exotic, though.$s",
  "CDE_Willy_Wed4": "Have I ever been lost at sea? No. Never.#$b#I always take the appropriate precautions. If you know what you're doing, you never compromise your safety.",
  "CDE_Willy_Wed2": "The waves are pretty calm at our beach. That's the only way I can manage to have my shop out on the dock itself.",
  "CDE_Willy_Thu8": "My biggest catch ever was from when I was young, like you.#$b#Who knows, though? It's still possible that I could outdo myself.$h",
  "CDE_Willy_Thu6": "There's rumors of some very rare fish in these parts... but only an experienced angler could stand a chance against them.#$e#You'll need the finest bait you can get if you want a rare fish to bite.",
  "CDE_Willy_Thu2": "It never ceases to amaze me how much trash winds up in the water.$s#$e#It's up to us to take care of it. Preferably, it should be recycled.",
  "CDE_Willy_Fri8": "We can all agree that fishing'll teach you patience. I can't think of a better skill to practice.#$b#Life itself is a waiting game. And then it ends. I pity anyone who never learns how to wait properly.",
  "CDE_Willy_Fri6": "Made any good chowder yet?$h#$e#It's an old classic.$h",
  "CDE_Willy_Fri2": "If you really want to get the fish biting, make sure you put some bait on your hook.",
  "CDE_Willy_Sat6": "When you're waiting for a bite, listening to a bit of music on the radio is a great way to pass the time.#$b#Our ancestors had no such luxuries, though. So sometimes I cut the music and listen to the sounds of nature, out of admiration for the old ways.",
  "CDE_Willy_Sat2": "I've learned some good fish recipes over the years. Maybe I'll share some with you sometime.",
  "CDE_Willy_Sun8": "My old neighbor passed away some years ago and entrusted his home to me.#$b#I'm glad Elliott was able to purchase it and move in. He's been a good neighbor.",
  "CDE_Willy_Sun6": "I'm sorry I don't ask enough about your farming. How is that going along?",
  "CDE_Willy_Sun4": "Sometimes, I reel in a little sunken treasure. I've found some pretty amazing things over the years.#$e#I hope you find some interesting treasures, too!",

  //generic weekday dialogue
  "CDE_Willy_winterTue": "Ye really can't beat wild-caught fish when it comes to taste. And nutrition.#$b#People who live too far inland don't really know what they're missin'.#$e#If they eat farm-raised fish, it's like a whole different food.",
  "CDE_Willy_Mon": "Any progress with fishing yet? Stick with it. It'll get easier with time.",
  "CDE_Willy_Fri": "How's your rod holding up?",

  //Wizard
  //Wizard Gift Tastes
  "CDE_Wizard_GoldPumpkin": "You were quite successful in the maze. I give you my sincere congratulations.#$b#Your returning of the golden pumpkin to me proves you are pure of heart.#$e#...That's it. Being pure of heart is its own reward.#$e#Disappointed? Hmmm. Well then...",
  "CDE_Wizard_RockCandy": "The magic residing within these crystals is beyond potent. Whoever made this candy is imbued with the supernatural, no doubt.",
  "CDE_Wizard_PrismaticShard": "This... with this, I can bring the forest's spirits a whole day of calm and prosperity.$h#$e#Hmm, I may even get to take a day off because of it.",
  "CDE_Wizard_RabbitsFoot": "Rabbits are beasts of pure innocence. This will be quite useful to brew, I think.",
  "CDE_Wizard_PurpleMushroom": "This, the rarest ingredient in a life elixer...$h#$b#Take heed, @. Your actions today may have saved a life in the near future.",
  "CDE_Wizard_SuperCucumber": "Ah, with this, I can concoct a libation that will compel the ocean spirits into peaceful revelry.#$b#You have done great work, @.",
  "CDE_Wizard_SolarEssence": "Thank you. This shall help maintain balance within our corner of the cosmos.",
  "CDE_Wizard_VoidEssence": "For anything good to exist, there must be perfect harmony between light and shadow. I'll put this to proper use.",

  //Wizard's Misc Dialogue
  //these lines target files other than the standard characters/dialogue/npc location such as unmarried rainy dialogue
  "CDE_Wizard_rainy_1": "Stormy days are the only time I can commune with certain elementals. I don't expect you to understand.",
  "CDE_Wizard_rainy_2": "If you have extra time on days like these, why not enter the mines and slay a few monsters?",
  "CDE_Wizard_rainy_3": "Though the rainclouds bring a dim melancholy, they are also a primary source of life for all things thriving in this valley.#$e#Light and shadow, although enemies, are actually co-dependent. Their conflict is the saving grace of the cosmos.#$e#That's the oversimplification. It takes a lifetime to fully understand it.",

  //Wizard's Standard Dialogue
  //Special dialogue

  //date specific dialogue
  "CDE_Wizard_spring1y2": "You came out here when you should be getting your farm back in shape for the new year?",
  "CDE_Wizard_fall26": "Will I see you tomorrow at the Spirit's Eve festival?#$e#No, I didn't look into my scrying orb for that one. I just figured it'd be easier to ask.#$e#What is it that you think I do here all day, anyway?",
  "CDE_Wizard_winter28": "Another year with no disasters. I've brewed up a celebratory potion with my name on it.$h#$e#No, you may not have any. Your body is not properly adjusted to it.#$e#That potion when we first met? That was about a 2. This is a 9.",

  //heart specific dialogue
  "CDE_Wizard_summerMon10": "Though I am looking for an apprentice, I can safely tell you that it will not be you.#$e#Do not be disappointed. This responsibility is not enviable.",
  "CDE_Wizard_summerMon4": "I will post a message in town if I need help stabilizing the local elemental forces. The creatures in the mine sometimes throw it out of balance.#$e#If you can't get to it, Marlon usually can, but his leg slows him down.",
  "CDE_Wizard_summerWed10": "Hmm... my beard is becoming greasy. I'll need to do a little anti-grease enchantment later.#$e#Oh, I haven't taken a bath in thirty some-odd years.#$b#There's no need when you have... magic!$h",
  "CDE_Wizard_summerFri6": "There is an accursed shrine in the eastern region of the mines. Have you ventured there?#$e#Ah, but of course, I already know the answer. I just wanted to see if your expression would be truly as unfazed as I thought it would be.#$e#You really are extraordinary for a mundane, @.",

  "CDE_Wizard_fallMon8": "To wield arcane power, one must have the highest integrity. Personal problems must never cloud our judgment.#$e#My friend Welwick is like this. She keeps up a gambling habit, but she refuses to apply her gift of clairvoyance in a card game.#$b#Even at the risk of financial ruin.",
  "CDE_Wizard_fallMon2": "Ahh, the spirits are very active during this season.#$e#It is an exciting time for my craft, but let us hope there are no... incidents this year.",
  "CDE_Wizard_fallTue10": "You say there's a warp portal to my ex-wife's hut... in my basement?$h#$b#That's... uh... how did that get there?#$e#Er... I knew it was there... I just... never got it to work for myself.#$b#That's right. It's uh, something to do with the technicalities of the arcane magic.",
  "CDE_Wizard_fallThu10": "What do you think of my hat?#$e#I think it is a wonderful hat.",

  "CDE_Wizard_winterMon4": "The affairs of mundane folk matter little to me, but the elementals like a chance to see you up close.#$e#It is for them that I created that silly maze at the Spirit's Eve festival.",
  "CDE_Wizard_winterWed4": "Yes, am quite well acquainted with Linus, though we typically only meet once per year.#$e#He understands the mountain better than most others. There is much you could learn from him.",
  "CDE_Wizard_winterThu10": "What continues to bring you back here, @? I must admit I never expected you to show such a personal interest in me.#$e#It's certainly kind of you. I appreciate it.",
  "CDE_Wizard_winterFri10": "I admit my work does not entirely occupy me around the clock.#$e#It's just that other people... make me nervous. This lifestyle suits me.",
  "CDE_Wizard_winterSat10": "Mmm... wouldn't a cup of tea help clear the senses? Perhaps that's what I need.",
  "CDE_Wizard_winterSat6": "Rrrgh. My head is killing me. I was testing out a potion.#$e#No, this is perfectly normal. I'll be fine.",

  "CDE_Wizard_Mon6": "My potions typically help me communicate with a variety of spirits who require my attention. Such was the case with you.#$e#But they also put me in the right physical state, in order to cast certain spells.",
  "CDE_Wizard_Mon2": "If you are looking for some kind of supernatural assistance with your farmwork, I am afraid this is the wrong place to be.#$e#It isn't that there is nothing I can do. Rather, there is nothing I SHOULD do.",
  "CDE_Wizard_Tue2": "Ahh, @, welcome. Would you care for something to drink?$h#$e#Oh, but I have more than just what is in that cauldron.$h#$e#Actually, come to think of it, never mind.",
  "CDE_Wizard_Wed8": "I am used to being treated with apprehension, but I appreciate your repeated visits, @.#$e#Normally, I have no interest in mundanes. But you remind me that I cannot neglect my human side.",
  "CDE_Wizard_Wed4": "I am most interested in objects that hold strong mystical properties.#$b#But a man also has to eat, so if you were to bring me a hot meal, I wouldn't say no.",
  "CDE_Wizard_Wed2": "It takes tireless effort to keep the valley's natural environment in balance.#$e#For that reason, I must continue my work.",
  "CDE_Wizard_Thu8": "The biologist who lives near the mines is actually quite bright. I respect his ability to understand the natural world.#$e#My practice is different, in that I focus on bending the natural world, through use of the world beyond.",
  "CDE_Wizard_Fri4": "My ability to teleport took a lifetime to develop, but a similar technique is also possible through use of warp totems.#$e#Your connection with the forest spirits should allow you to craft warp totems, too.",
  "CDE_Wizard_Fri2": "I believe the townsfolk are afraid of me.#$e#It is unfortunate, but I suppose it is human to be afraid of the unknown.",
  "CDE_Wizard_Sat8": "I traveled for years before I found a place rich enough in magical energy to construct this tower.#$e#No, of course I did not lay the bricks by hand. I wield the power of summoning for a reason.$h",
  "CDE_Wizard_Sun10": "Ah, @. I am glad you are here.#$e#Yes, I am happy to take a break from my work. How are you?",
  "CDE_Wizard_Sun6": "In the elemental wars, the dwarven race was almost completely wiped out by the shadow beings.#$b#But the war has finally ended. I hope that those who remain can move on.",

  "CDE_Wizard_fallFri10+Thu4": "Stardew Valley is a special place. It is rich with bountiful, living things.#$e#You can thank the spirits for that.",
  "CDE_Wizard_summerTue8+fallTue8": "I tried living for my own selfish pursuits some time ago and it didn't end well.#$b#The truth is that there are greater things for me to worry about than myself.",
  "CDE_Wizard_summerTue10+winterTue10": "I fear for the souls of those who abuse the dark arts, especially for selfish desires.#$e#To harm the innocent... truly, there is no greater crime in this world nor the next.",

  //Generic Weekday Dialogue
  "CDE_Wizard_Fri": "Think of me as an ambassador between this world and the world of spirits.#$e#That is but one of my duties, anyway.",
  "CDE_Wizard_summerFri+fallWed": "The bears in this region are not... ordinary.#$b#With your connection to the forest spirits, you may even be able to communicate with them. Have you tried?"
}