{ //Caroline

  //Caroline Gift Tastes
  "CDE_Caroline_GoldPumpkin": "I've seen something like this before! It was at a Spirit's Eve, long ago...$h",
  "CDE_Caroline_Pearl": "Oh! Isn't it perfect!$h#$b#Are you sure? This is such a rare item.",
  "CDE_Caroline_PrismaticShard": "When I hold this, I feel completely at peace. This might be the nicest thing anyone has given me!",
  "CDE_Caroline_RabbitsFoot": "How lovely! I know just the spot where this can go in my sunroom.$h",
  "CDE_Caroline_FishTaco": "Oh, this is one of my favorites!$h#$b#Fresh tuna, crunchy cabbage, tangy sauce... it's perfect!$h",
  "CDE_Caroline_GreenTea": "Oh goodness! There's nothing like sharing a cup of tea with a friend. Thank you so much!$h",
  "CDE_Caroline_SummerSpangle": "That one's a beauty. It's so bright and cheerful! Thank you!$h",
  "CDE_Caroline_TropicalCurry": "Did you make this yourself? The flavors are utterly magical!$h",

  //Caroline's Misc Dialogue
  //these lines target files other than the standard characters/dialogue/Caroline location such as unmarried rainy dialogue
  "CDE_Caroline_rainy_1": "My garden is happy today.$h#$e#...and our water bill will be lower this month.",
  "CDE_Caroline_rainy_2": "I hope the sun comes out soon. What did the weather report say today?",
  "CDE_Caroline_rainy_3": "You made it here in the rain... What do you think? Is it worth taking a walk today?#$e#...I guess not.",

  //Caroline's Standard Dialogue

  //Special Dialogue
  "CDE_Caroline_repeated_1":"#$1 Caroline1#Hmmm... I wonder if I can get Pierre to cook dinner tonight.#$e#Hmmm... what am I going to make for dinner tonight?#$e#Maybe I'll just get take-out from the Saloon.",
  "CDE_Caroline_repeated_2":"$d Joja#I'm worried about Pierre. Each time we lose business to JojaMart, he can barely sleep for days.|I'm never going to forget the day Pierre stood up to Morris like that. It reminds me of when we were both younger.$h",
  //Thu4, winter_Thu6
  //Thu6, winter_Thu8
  
  //festival related dialogue

  //date specific dialogue
  "CDE_Caroline_spring1":"Happy new year! Pierre's been waiting for you.$h",
  "CDE_Caroline_spring12":"Pierre has some really great things to sell tomorrow. Has he told you about it yet?$h",
  "CDE_Caroline_summer27":"The moonlight jellies are really a sight to behold. They bring back some great memories I've shared with Pierre.$h",
  "CDE_Caroline_fall15":"I wish Pierre wouldn't get so obsessed with his grange display. He has enough on his mind as it is...",
  "CDE_Caroline_winter28":"Well, here we are at the end of the year! Any resolutions you're starting tomorrow?",

  //heart specific dialogue
  "CDE_Caroline_Mon6":"Abby and I keep fighting. I really wish she'd understand that I know more than she thinks.$3#$e$Sorry, I hope your day is going well.",
  "CDE_Caroline_Mon4":"Abby's actually pretty musically talented, but she's never stuck with one instrument for too long.#$b#Have you ever heard her play anything?",
  "CDE_Caroline_Mon2":"Was Abby polite the last time you saw her?#$e#Usually, she's polite to others, but she does have the occasional outburst. I hope she's been good to you.",
  "CDE_Caroline_Tue10":"Jodi and I were just talking about some of the things you've done for the community.$h#$e#Personally, I'm glad that you're a positive influence on Abby.$h",  
  "CDE_Caroline_Tue8":"Pierre's a hard worker. Sometimes I feel guilty about how much he's sacrificed to keep this store running.",
  "CDE_Caroline_Tue6":"I'm still amazed with how Jodi went back for round two, raising another boy. I remember Sam was quite a handful.$h#$e#It was \"one and done\" for Pierre and me. That was our plan from the get-go.",
  "CDE_Caroline_Tue4":"Jodi and I have been friends for a number of years now. I'm so glad that she and her family moved into town.#$e#Sometimes I wonder if I could even get by without her.",
  "CDE_Caroline_Tue2":"If you need fast cash, Pierre will be happy to buy whatever produce you have.#$e#Even if it's foraged, we'll still take it. Those kinds of items give our stock a bit of local character.$h",
  "CDE_Caroline_Wed8":"I do what I can to stay social. Truth be told, though, it takes a lot of effort for me.#$b#That's the life of a recovering introvert, I guess.",
  "CDE_Caroline_Wed6":"Stardew Valley is nice, but I wish I knew more people.#$e#I'm glad that we've become friends.",
  "CDE_Caroline_Wed4":"Hey, have you tried making parsnip soup yet?$h#$e#It'd probably be easier if you saved some parsnips from the spring, huh?",
  "CDE_Caroline_Wed2":"Oh hello! I hope you're feeling a little more at home now, in Pelican Town.",
  "CDE_Caroline_Thu2":"It's nice that we never have to worry about being short on ingredients when it comes time to make dinner.",
  "CDE_Caroline_Thu":"I've seen wild horseradish in the forest.#$e#Foraging can be a fun way to earn some cash. Or you can use what you find as gifts or food.",
  "CDE_Caroline_Fri10y1":"Be sure to show some support for Jodi when you see her next. It's very difficult for her, the way her husband is away.",
  "CDE_Caroline_Fri10y2":"I thought I'd see a new side to Jodi after Kent returned from the war, but things still seem to be difficult for her.#$e#Maybe we could make her family some dinners?",
  "CDE_Caroline_Fri8":"$d Joja#Jodi's my best friend, but does she have to shop at JojaMart? I don't know how to address the topic appropriately with her.$s|One of the best things about JojaMart closing down is that I don't have to worry about Jodi shopping there anymore.$h",
  "CDE_Caroline_Fri6":"Pierre is multi-talented. Have you ever heard him sing?$h#$e#He's also quite athletic. Or he was, anyway...",
  "CDE_Caroline_Fri4":"Abby goes to the saloon with a couple of her friends on Friday nights. Maybe you could join them?",
  "CDE_Caroline_Sat8":"#$1 Caroline12#When we first moved here, I took a while to settle down... I wasn't ready for the domestic life.#$e#Pierre's a bit traditional... but he's a good man. He's ambitious, but he always puts his family first.",
  "CDE_Caroline_Sat6":"I thought I'd set a good example for Abigail with the aerobics classes I host, but if anything, it just seems like it pushed her away from wanting to exercise.#$e#I guess I shouldn't be surprised.",
  "CDE_Caroline_Sat4":"It's funny, I can't remember whether the aerobics club was my idea or someone else's.#$b#I think it just happened organically. Exercise has always been my thing, and our living room seemed perfect for it, so...",
  "CDE_Caroline_Sat2":"Is it just me, or does Abigail have an unhealthy interest in doom and gloom?#$e#Maybe I'm just too old to understand.",
  "CDE_Caroline_Sun8":"I worry too much as it is, and life is short. It's not worth it to let life get you down all the time.#$e#We have to make peace with what we have.",
  "CDE_Caroline_Sun6":"Everyone wants their own child to make fewer mistakes than they themselves made.$s#$e#Is it too much to ask, that Abby stays safe and happy?",
  "CDE_Caroline_Sun4":"Between the Shrine of Yoba, the aerobics classes, and the store, we've had to get used to  people just walking through our home on a regular basis.#$e#Communal living isn't so bad as long as people are respectful.",
  "CDE_Caroline_Sun2":"Feel free to pray at the Shrine of Yoba if you'd like.#$e#No, it's not really my thing. I do respect those who practice, though.",
  "CDE_Caroline_summerMon6":"Time seems to go by faster and faster the older you get...$s ",
  "CDE_Caroline_summerWed10":"Your workload eases up near the end of each month, doesn't it? Why not harvest some tea leaves with the extra time?",
  "CDE_Caroline_summerThu8":"Be sure to save some tomatoes at the end of the season so you can make vegetable stew.#$e#Once it's fall, all you need is a beet. It's a dream recipe for how good it is with so few ingredients.",
  "CDE_Caroline_summerThu6":"The wild grapes that grow here are great for making wine. Are you making any wine right now?",
  "CDE_Caroline_summerFri10":"I'm a tiny bit gluten intolerant, it seems. I've cut back on gluten this month and I've got a little more pep in my step.$h",
  "CDE_Caroline_summerSat6":"Sorry if Abby's ever said anything that made you feel awkward.#$b#I wonder if she could have learned better social skills if she'd gotten outside a bit more.",
  "CDE_Caroline_summerSun8":"Everyone needs to put in the appropriate time for self-care. I think you know my little rituals by now.$h#$e#Have you been putting in the appropriate time? You deserve it, you know.",
  "CDE_Caroline_summerSun4":"It's perfect weather for an iced tea, don't you think?",
  "CDE_Caroline_fallMon10":"I hope Abby doesn't make the same mistakes I made when I was her age...$s#$e#Uhm, I mean, looks like we've got another exercise class tomorrow! I'll see you around?",
  "CDE_Caroline_fallTue10":"I actually lost two pounds in the past couple of weeks, and that's even with Pierre cooking more often!$h#$e#Sorry, when Pierre cooks, I can only stomach so much of it, so I end up sneaking out to the store shelves and I nosh on the snack foods.#$b#Um, don't tell.$s",
  "CDE_Caroline_fallThu6":"There are some good recipes that you can make year round with wild mushrooms, so it's not a bad idea to stock up.#$e#Or if you're not much of a cook, you can always sell them to us.",
  "CDE_Caroline_fallSat8":"Is it just me, or does Abigail play too many video games?#$e#Maybe I'm a little old-fashioned.",
  "CDE_Caroline_fallSat4":"Abby's always had a strange interest in the occult. I'm sure it's just a phase...",
  "CDE_Caroline_fallSat2":"Abby's always had a strange interest in the occult. I'm not sure where she gets it from...",
  "CDE_Caroline_winterMon10":"So many people want to have these grand adventures. Me? Well, I got my fill when I was younger.#$e#Why not take it a little easier? That's what most everyone's after in the long-run, isn't it?",
  "CDE_Caroline_winterWed10":"Ugh, Abby needs to clean her guinea pig's cage. I can smell the fumes from halfway across the house.$s#$e#Can you nag her about it for me? Phew, thanks.",
  "CDE_Caroline_winterFri6":"Don't you think Abby would look better with her natural hair color?#$e#She used to have light chestnut-colored hair.",
  "CDE_Caroline_winterSun4":"Ahh, with a hot cup of green tea, it's like the cold doesn't even matter anymore.",

  //generic weekday dialogue
  "CDE_Caroline_Tue":"On Wednesdays the shop is closed.#$e#Keep that in mind if you're going to need anything.",
  "CDE_Caroline_Sat":"I host an aerobics class on Tuesdays in our living room. You can come if you'd like.",
  "CDE_Caroline_summerMon":"Do you grow any flowers on your farm this time of year?",
  "CDE_Caroline_summerThu":"I've been seeing wild fruits in the forest lately.#$e#Foraging can be a fun way to earn some cash. Or you can use what you find as gifts or food.",  
  "CDE_Caroline_fallThu":"Are you doing any foraging this season? I've seen edible mushrooms in the forest.#$e#I should probably mention that I'm not a big fan of them, though.",
  "CDE_Caroline_winterThu":"Winter is harsh, but you can dig up some roots if you're lucky.#$e#Foraging can be a fun way to earn some cash. Or you can use what you find as gifts or food.",

}
