{ //Elliott

  //Elliott Gift Tastes
  "CDE_Elliott_GoldPumpkin": "What a curious object indeed! I wonder if we could make some kind of pumpkin ale from it?",
  "CDE_Elliott_RockCandy": "An old-fashioned delight! I remember visiting candy shops on the coast when I was young. This takes me back.",
  "CDE_Elliott_Pearl": "Where on earth did you find this? It's exquisite!$h",
  "CDE_Elliott_RabbitsFoot": "Thank you! I'll hold this tight, next time I send something off to my publisher.$h",
  "CDE_Elliott_CrabCakes": "My my, a local delicacy!$h#$b#You simply have exquisite taste.",
  "CDE_Elliott_Lobster": "Ahh, fresh steamed lobster! I enjoy my minimalistic lifestyle, but I never compromise on cuisine. Thank you!$h",
  "CDE_Elliott_Pomegranate": "The fruit of myth and fairytale! How wonderful!#$b#It's as if it transports me to the pages of a storybook.$h",

  //Elliott's Misc Dialogue
  //these lines target files other than the standard characters/dialogue/Elliott location such as unmarried rainy dialogue
  "CDE_Elliott_rainy_1": "Sometimes when I lay in bed I can hear a distant foghorn cut through the rain.#$b#But when I look out the window I see only a curtain of gray.",
  "CDE_Elliott_rainy_2": "I'm afraid I haven't stepped outside a bit today.$s#$e#Thank you for coming by. Your visit is a light in this gloom.",
  "CDE_Elliott_rainy_3": "Perhaps it's time to give those old bedsheets a wash.#$e#With how old an musty the cabin is, I have to work extra hard to keep it fresh.",

  //Elliott's Standard Dialogue

  //Special Dialogue

  //festival related dialogue

  //date specific dialogue
  "CDE_Elliott_spring1":"Such a beautiful morning today! Happy new year!$h",
  "CDE_Elliott_summer27":"The moonlight jellies' visit made for a wonderful experience last year. I hope this year proves no different.#$e#And you can't beat the location of my home!$h",
  "CDE_Elliott_winter15":"These boats made quite the entrance when they arrived this morning!",
  "CDE_Elliott_winter28":"Here's to another chapter of our lives! [459]$h#$e#Cheers.",

  //heart specific dialogue
  "CDE_Elliott_Mon10":"When you're around, @, the feelings in my heart can only be called poetry without words.$l#$e#I hope all is well with you.$h",
  "CDE_Elliott_Mon4":"I hope you've come to think of this place as 'home.'",
  "CDE_Elliott_Mon2":"Pelican Town is a uniquely peaceful place. I could tell that from the moment I thought of settling in.#$e#I hope you feel the same.$h",
  "CDE_Elliott_Tue10":"In my life, I've spent so much time alone, but I think I may be ready for a change to that.$l",
  "CDE_Elliott_Tue2":"So many people go their whole lives without ever truly learning how to pay attention... to our surroundings, to ourselves...#$b#How much life is wasted in that manner?$s",
  "CDE_Elliott_Wed4":"Please excuse the sorry state of my cabin.",
  "CDE_Elliott_Wed2":"Be sure to drop by my cabin whenever you visit the beach.$h#$e#I often crave solitude, but too much can deter one's well being.",
  "CDE_Elliott_Thu10":"I've tried my hand at some sonnets lately.$l#$e#Oh! I've written nothing worth another's attention.#$e#Perhaps another time.",
  "CDE_Elliott_Fri10":"Maybe one of my next pieces will be about you, @. I hope you don't mind.$h",
  "CDE_Elliott_Fri8":"Farmwork with excellence must require a muse. What inspires you, @?",
  "CDE_Elliott_Fri2":"You must have met Leah by now, yes? She has been a good friend since I arrived in town.#$e#I do enjoy a good debate with her about aesthetics.",
  "CDE_Elliott_Sat8":"Some people are shy. Keep showing interest in them and they'll get comfortable around you.#$e#Everyone likes to have friends, even that grumpy blacksmith.",
  "CDE_Elliott_Sat6":"I have no TV, no computer, and no radio. Sometimes I wonder if I would have a difficult time rejoining 'mainstream' society.",
  "CDE_Elliott_Sat2":"I don't believe in holding onto many material possessions. I keep only what I need.",
  "CDE_Elliott_Sun4":"I respect Leah's pursuit of beauty in material art.#$b#For me, though, beauty only exists in the mind. Words, thoughts, and music are enough for me.$h",
  "CDE_Elliott_Sun2":"Oh, so you came here to escape your old life, too?#$e#It appears we have some commonalities.",
  "CDE_Elliott_summerMon10":"Is it any coincidence that I can't help but picture you whenever I sit down to write?$l",
  "CDE_Elliott_summerTue10":"I write these days, hoping that whatever I compose will be pleasing to you.#$e#It's a whole different experience, writing for someone else instead of myself, but I am already quite fond of it!",
  "CDE_Elliott_summerTue4":"Visit my cabin whenever you like. I could use the company.$h",
  "CDE_Elliott_summerTue2":"@? You look puzzled.#$b#I guess the hot summer air can make us a little dizzy."
  "CDE_Elliott_summerWed10":"We ought to share a bottle of wine sometime... to celebrate the progress we've shared in this life!",
  "CDE_Elliott_summerWed6":"If it weren't for the ocean, I fear that my cabin would practically become a sweat lodge during this month.",
  "CDE_Elliott_summerWed4":"The life of a single plant is a story within itself.#$b#Its struggle, its endurance, all for the sake of achieving its purpose of bearing fruit.#$e#The journey of a literary hero is quite similar.$h",
  "CDE_Elliott_summerThu10":"I think of how much I was bullied and outcast as a child. To find someone like you, I feel luckier than I ever thought I'd be.$l",
  "CDE_Elliott_summerThu6":"It's true that I didn't always have an easy time in school.$s#$b#I spent so much time being different from my peers, that eventually, 'different' became the only identity I knew.#$e#At least I've come to know myself pretty well because of that.",
  "CDE_Elliott_summerThu2":"I took to writing stories from an early age. I played imaginative games endlessly.#$b#But something certainly clicked the day I decided to start writing down the stories that had come so naturally to me.",
  "CDE_Elliott_summerFri6":"It was quite an ordeal bringing that piano into my home. Moving it across the beach was no easy feat.#$e#I'm just glad that Mayor Lewis had one for sale from a previous resident who had moved out.",
  "CDE_Elliott_summerFri4":"Writing with a pen is actually quite a bit easier than writing at a computer.#$b#With a pen, you have to commit to the words you write, so it makes me much less indecisive.$h",
  "CDE_Elliott_summerFri2":"Leah has been telling me about her latest art projects. They sound fascinating.#$e#Some of them she likes to keep secret until they are finished, though. I quite understand.",
  "CDE_Elliott_summerSat8":"I'd like to think of your work on the farm as a great romance. To conquer death and breathe life back into what was lost...#$b#Thematically speaking, that is where we as people find our hope.",
  "CDE_Elliott_summerSat6":"When the sound of the ocean is ever present, it almost seems to become a part of my very being. Walking into the silence of the woods is suddenly the exotic experience.",
  "CDE_Elliott_summerSat4":"'And darkness, conquered like a drunken bawd#$b#Submits a fallen face to summer's laud.'#$b#Ah, @, I was just coming up with a little bit of poetry to cheer me up. I hope your day is well.$h",
  "CDE_Elliott_summerSun6":"Writing is quite a bit like acting. Sometimes, I find myself lost in the mind of a character. It's always quite exciting.$h#$e#I prefer to keep my audience away until the story is complete, though.",
  "CDE_Elliott_summerSun4":"All of the characters I create are in some way a reflection of me.#$b#In that sense, I consider myself to have explored many of the far reaches of my personality.$h",
  "CDE_Elliott_fallMon10":"Hello, @. I must admit I've felt rather amorous lately.$l#$e#Have you?$l",
  "CDE_Elliott_fallMon6":"It's been said that a pirate's ship, full of plundered gold, shipwrecked here a long time ago.",
  "CDE_Elliott_fallTue4":"I've read most of the classics, but I find myself returning to them again and again.#$e#I wonder if anything I write will ever last for more than a generation?",
  "CDE_Elliott_fallWed4":"I admire the classics, but right now I have my nose buried in a few popular novels, too.#$e#I can always learn more from published authors if I hope to become their peer one day.$h",
  "CDE_Elliott_fallThu10":"It's wonderful to see you, @! Shall we go for a walk along the beach sometime?$h",
  "CDE_Elliott_fallThu6":"I cannot deny how the seasons affect my mood. No doubt, then, they must affect my writing?$s#$e#But what if, then, I miss my chance to write the scene that I need so badly, and I have to wait for a whole year?$s",
  "CDE_Elliott_fallThu4":"Oh dear! A tiny crab appears to have made his home in my shirt pocket.$l#$e#That's the trouble with living on the beach.",
  "CDE_Elliott_fallThu2":"It takes a lot of sweeping to keep the sand from forming a layer in my cabin.$s#$e#Just as long as it doesn't get in my bed.",
  "CDE_Elliott_fallFri8":"The plants in my home have been doing quite well. How about the ones on your farm?$h",
  "CDE_Elliott_fallFri6":"I have a terrible headache today from too much eyestrain. Maybe I need an appropriate lamp for when I stay up late to write.$s",
  "CDE_Elliott_fallFri4":"My legs are stiff from sitting at my writing desk all night.$s#$e#Sometimes I envy you, @.",
  "CDE_Elliott_fallSat10":"I've already started brainstorming some ideas for another book.#$e#Yes, this is something I intend to keep doing.$h",
  "CDE_Elliott_fallSat8":"I'm relieved to have finished my book, but I can't stop writing now. Creativity can vanish if it goes unused.",
  "CDE_Elliott_fallSat6":"Every time I go to write a scene, it ends up taking so much longer than I expect.$s#$e#The more complex a story becomes, the more I have to analyze whether the symbols and motifs are consistent, among other things.",
  "CDE_Elliott_fallSat4":"'A breath of leaves that sprightly-stirs the day$s#$b#And beckons mortals all unto decay...'$s#$b#Ah, @, it's just some lines of verse I'm working on. A little poetry offers some reprieve from my main project.$h",
  "CDE_Elliott_fallSun8":"There's something poetic about the thriving nature of a farm in autumn, as nature as a whole begins its steady decline toward winter.#$e#Life... death... rebirth, all three have their separate phases, but all exist simultaneously, too.",
  "CDE_Elliott_fallSun6":"Everyone always thinks of summer when they think of beaches. But an autumn beach has its own glassy beauty that should not go overlooked.",
  "CDE_Elliott_fallSun4":"I've been trying to catch up on some contemporary fiction. I must make sure that I haven't haphazardly duplicated another author's ideas.",
  "CDE_Elliott_winterMon4":"These dark winter days do affect my disposition.$s#$q 060/061/062/063 winterMon_old#Does the winter season affect your mood, too? #$r 060 0 Mon_060#It takes the wind out of my sails.#$r 061 0 Mon_061#It perks me right up!#$r 062 0 Mon_062#It's a mix of joy and melancholy.#$r 063 0 Mon_063#No affect on me.",
  "CDE_Elliott_winterMon_old":"$p 060#Are you taking good care of yourself?|I must not allow myself to succumb to a state of ennui.",
  "CDE_Elliott_Mon_060":"Oh dear! It must be difficult to be a farmer when every living thing is asleep. Please come talk with me whenever you like.",
  "CDE_Elliott_Mon_061":"Is that so? Yes, I suppose there is something quite uplifting about the holiday spirit.",
  "CDE_Elliott_Mon_062":"That's exactly how it is for me, too. Some of my best writing has come from wintertime, but it does tend to be darker in tone.",
  "CDE_Elliott_Mon_063":"Is that so? Well, I admire your impervious nature, then!",
  "CDE_Elliott_winterTue6":"I've written countless stories before, but if I'm going to submit something for publication, it has to be perfect!$a#$e#Writing can exacerbate my perfectionist tendencies quite a lot.$s",
  "CDE_Elliott_winterTue4":"$d Joja#JojaMarts have always filled me with a deep sense of loathing. I haven't been in one in years.|It warms my heart whenever I see others shopping at Pierre's. I'm reminded of how the soul of this town won me over.",
  "CDE_Elliott_winterWed6":"I've been so involved in my own work that I've neglected to ask how your work is going. How is the farm?#$e#Do you have plans for building anything new for the coming year?",
  "CDE_Elliott_winterWed4":"@, you've trudged through the snow to visit me?#$e#I'm honored!$h",
  "CDE_Elliott_winterThu10":"My parents were among those who thought I was crazy to move here.#$b#When I read their most recent letter, though, they seemed more accepting.",
  "CDE_Elliott_winterThu8":"Breathe deeply. Do you notice it? That's the smell of the sea.#$e#Whenever I smell the sea, it reminds me of my youth. The ocean really impressed me as a child.",
  "CDE_Elliott_winterThu6":"It was a fantastic night last night! I must have written another two full pages every hour!$h#$e#I try to relish those personal victories.",
  "CDE_Elliott_winterFri6":"I only got through writing three sentences all day yesterday. Three sentences!$s#$e#My brain simply must be exhausted.",
  "CDE_Elliott_winterSun8":"I think I'll make enough to get by for another few months!$h#$e#It's easier for me as I have so few expenses, but for a while, I was worried I would go broke.",
  "CDE_Elliott_winterSun6":"The cold does make my cabin feel lonelier.$s#$e#Perhaps if I could just use this loneliness as a source of inspiration...$s",

  "CDE_Elliott_Mon6+winterWed8":"I am a firm believer that beauty is in the eye of the beholder.#$b#If that's true, then I'd consider writing to be the most direct pathway to where our minds create the beauty we experience.",
  "CDE_Elliott_Tue8+winterWed":"A day can never be boring when you follow the whims of your imagination.$u#$e#Sorry, am I babbling on about nonsense?",
  "CDE_Elliott_Sat4+Sun8":"'Awake, my visage of the looming sun#$b#As nature's chorus lifts its voice as one.'#$b#Oh, @, I was mulling over some of my poetry just now. Lately, the springtime has awakened my creativity.",
  "CDE_Elliott_summerThu4+winterFri4+winterFri8":"Some of my best ideas jump into my head when I sit and play my piano.#$e#Of course, some of my worst hours of procrastination happen there, too...$s",
  "CDE_Elliott_summerSun10+winterFri10":"I can often see pieces of myself in the characters I create. But lately, I've written some vignettes that resemble you more than me.$l",
  "CDE_Elliott_fallWed2+fallWed6":"One thing I adore about this beach is that I can enjoy a luxurious steamed lobster dinner on the cheap.$h#$e#The finest things in life require very little money if you know where to look.",
  "CDE_Elliott_winterTue8+winterSat4":"'A sheen of silky snow across the knoll#$b#Invites the lonely one to find his soul...'#$b#Ah, @, I'm just working on a little poetry to invigorate my inspiration.$h",

  //generic weekday dialogue

  //Elliott's Married Dialogue

  //weather specific dialogue
  
  "CDE_Elliott_Married_RainyDay_1": "I feel inspired today... I think I'll do some writing.",
  "CDE_Elliott_Married_RainyDay_2": "I love waking up to the gentleness of that sound. Don't you?$h",
  "CDE_Elliott_Married_RainyDay_3": "The sound of rain, in some tiny way, reminds me of my cabin by the beach.#$e#I may be due for another walk down there soon.",
  "CDE_Elliott_Married_RainyDay_4": "Maybe sometime after the rain clears up, I'll take a walk down to the beach.#$e#The farm is wonderful, but I do miss the sound of the ocean.",
  "CDE_Elliott_Married_RainyDay_5": "I got up early and made coffee.[395]#$e#$c .5#This is a surpassingly delicious blend. I've become quite familiar with how coffee should taste, if I may say so.$h",
  "CDE_Elliott_Married_RainyDay_6": "I find that a cup of this exquisite brew makes the early morning a lot more pleasant.#$b#Drink up, my darling![395]$h",
  "CDE_Elliott_Married_RainyDay_7": "I think I'll remain indoors today, my dear. The rain causes my hair to go limp.",
  "CDE_Elliott_Married_RainyDay_8": "Goodness! I'm in constant admiration at how you boldly venture outside on these days, yet it never dampens your spirit.",
  "CDE_Elliott_Married_RainyDay_9": "My inspiration for writing is like the weather... it comes and goes at random. Today I feel entirely dull.$s#$e#Perhaps I'll read one of the classics to get my creative juices flowing.",

  "CDE_Elliott_Married_RainyNight_1": "Good evening. Did you have a productive day, @?",
  "CDE_Elliott_Married_RainyNight_2": "Our triumphant hero returns! How was your day?$h^Our triumphant heroine returns! How was your day?$h",
  "CDE_Elliott_Married_RainyNight_3": "You're ice cold! Let me keep you warm.$l",
  "CDE_Elliott_Married_RainyNight_4": "Dear, what are you doing, burying your wet face in my hair like that? I'm not a towel!$l",
  "CDE_Elliott_Married_RainyNight_5": "Ah, my dear, I was just thinking about you. Welcome home.$h",
  "CDE_Elliott_Married_RainyNight_6": "My skill with words is unmatched, yet I can't find the way to properly describe your allure.$l^My skill with words is unmatched, yet I can't find the way to properly describe your beauty.$l",
  "CDE_Elliott_Married_RainyNight_7": "What did I do today? I'll just say this... it takes a lot of work to maintain this rugged physique!",
  "CDE_Elliott_Married_RainyNight_8": "Isolating? No, it's never isolating here, compared to the beach. Simply the promise of your return each evening keeps my mind quite copacetic.$h",
  "CDE_Elliott_Married_RainyNight_9": "My love... I wouldn't trade you for 100 iridium bars.#$e#Nor 1000...#$e#Not even 10,000 bars, no.$7#$e#...$7#$e#No, not even 100,000 bars!$a#$e#...$s#$e#Wa... one million bars of pure iridium...? Don't make me do this...$8",

  "CDE_Elliott_Married_IndoorDay_1": "I've been taking much better care of myself now that we're together. The bachelor life wasn't particularly healthy for me.",
  "CDE_Elliott_Married_IndoorDay_2": "How on earth did I manage to rough it out in that old shack? Even now, it already feels like a memory out of someone else's life.",
  "CDE_Elliott_Married_IndoorDay_3": "Good morning! I made us a pot of coffee.[395]#$e#I find myself craving this robust flavor nearly every morning.",
  "CDE_Elliott_Married_IndoorDay_4": "Is that coffee you smell? You guessed correctly.[395]#$e#I know how to brew it just right, if I may say so. I'm a bit of connoisseur.$h",
  "CDE_Elliott_Married_IndoorDay_5": "If you find a spider in the house, don't squash it! Just let me know and I'll take the poor thing outside.",
  "CDE_Elliott_Married_IndoorDay_6": "I woke up with some thoughts swimming in my head for a little vignette. I'll have to write those thoughts down before they vanish.",
  "CDE_Elliott_Married_IndoorDay_7": "Today is going to be a fantastic day... I can feel it! I get this special feeling in my nose...$h",
  "CDE_Elliott_Married_IndoorDay_8": "A sheen of silky sun across your hair... reminds me how I know I've found my home, wherein your gleaming gaze invites to share... a moment in the sun to call our own.#$e#A happy day to you, dearest!$h",
  "CDE_Elliott_Married_IndoorDay_9": "Dear, what do you think we should do for dinner tonight? It's your pick.",
  "CDE_Elliott_Married_IndoorDay_10": "I've had this recurring nightmare that you gave me a buzz cut... You wouldn't ever do that to me, would you?$s#$e#I trust you.",

  "CDE_Elliott_Married_IndoorNight_1": "Mmm, good evening, my dear. Come closer.$l",
  "CDE_Elliott_Married_IndoorNight_2": "From the brightest winter star, to the shimmer of an iridium vein... nothing can compare to my wonderful man.$l^From the brightest winter star, to the fragrant fairy rose... nothing can compare with your captivating beauty.$l",
  "CDE_Elliott_Married_IndoorNight_3": "A crackling fire adds wonderful ambiance to the house... every piece of wood burns in a unique way.",
  "CDE_Elliott_Married_IndoorNight_4": "There's no sand on the floor, but I still have a lingering habit of brushing off the bottoms of my feet before I climb in bed.",
  "CDE_Elliott_Married_IndoorNight_5": "Every time I look out at the fields, I'm eager to learn more about your work. Why don't you teach me something new?",
  "CDE_Elliott_Married_IndoorNight_6": "I never had much success growing plants in my old beach house. Hopefully I can pick up a thing or two by watching you.##$e#In this respect, you are the master and I only a humble apprentice.",
  "CDE_Elliott_Married_IndoorNight_7": "When I behold thy wondrous face, a precious jewel of form and grace, my heart... torn by the dread of night, is purified with golden light.#$e#Poetry is the only way I can begin to describe my feelings for you.$l",
  "CDE_Elliott_Married_IndoorNight_8": "A darkened, starry sky will blanket us, and I will wrap you up within my arms. Locked in that shroud we'll find our peace and thus, we'll lull into repose with gentle charms.#$e#I hope my words can warm your heart.",
  "CDE_Elliott_Married_IndoorNight_9": "I came to know gourmet seafood quite well while I lived on the beach. [198 202 727 728]Bon appetit!$h",
  "CDE_Elliott_Married_IndoorNight_10": "I spent the afternoon daydreaming about the ocean. So I decided to cook some seafood. [198 202 727 728]$h",
  
  //location specific dialogue
  "CDE_Elliott_Married_funLeave_1":	"I think I'll walk down to the beach today. It's always nice to see the ocean again.",
  "CDE_Elliott_Married_funLeave_2":	"If I walk to the beach today, I wonder who I'll see? There's only one way to find out.$h",
  "CDE_Elliott_Married_funReturn_1": "I had a nice time at the beach by myself. I watched the waves come and go, just like old times.",
  "CDE_Elliott_Married_funReturn_2": "The beach was quiet today, and yet so full of life. I quite enjoyed myself. And how was your day?",
  
  "CDE_Elliott_Married_patio_1": "Ah, what a lovely day to read a book... don't you think, my dear?",
  "CDE_Elliott_Married_patio_2": "Feel free to join me if you're taking a break, my dear.$h",
  "CDE_Elliott_Married_patio_3": "As immersive as a book can be, the environment where you read it plays a crucial role in the experience.#$e#I couldn't ask for a better environment!$h",
  
  "CDE_Elliott_Married_OneKid_1": "How strange... I no longer feel like the protagonist of my own life. And yet, it doesn't bother me at all.",
  "CDE_Elliott_Married_OneKid_2": "Have you had any time to entertain little %kid1 today? Maybe a second child will make things easier for both of us.",
  "CDE_Elliott_Married_OneKid_3": "I feel like raising our child is the start of a brand new story! It will always be our greatest.",
  "CDE_Elliott_Married_OneKid_4": "Little %kid1 is going to have the perfect childhood here. There's so much to explore.",
  "CDE_Elliott_Married_OneKid_5": "What are some good toys that we can get? I want our child to be learning something new as often as possible.",
  "CDE_Elliott_Married_OneKid_6": "Caring for babies isn't exactly my strong suit... but I'll do my best to be a good father.",
  "CDE_Elliott_Married_TwoKids_1": "I wonder how long it'll be before our children can appreciate gourmet seafood?",
  "CDE_Elliott_Married_TwoKids_2": "I already gave %kid1 and %kid2 their food. They eat a lot for such small creatures!",
  "CDE_Elliott_Married_TwoKids_3": "I told the children a little story last night as they were drifting off. You can color me smitten.$l",
  "CDE_Elliott_Married_TwoKids_4": "I was carrying %kid1 earlier, and I could've sworn I heard a \"Da...da\".$h",
  "CDE_Elliott_Married_TwoKids_5": "Is raising children an art? If it is, I must say that it is quite the competition for my favorite art.$h",
  "CDE_Elliott_Married_TwoKids_6": "I'm going to teach %kid1 to read as soon as possible! That's a great way for children to learn about the world.",
  "CDE_Elliott_Married_TwoKids_7": "Goodness! I'm still able to write a little, but I have to do it in short bursts when our children require such attention.",
  "CDE_Elliott_Married_TwoKids_8": "We've done well, @. The farm is doing excellent and our healthy children are a great joy. I couldn't be happier.",

  "CDE_Elliott_Married_Outdoor_1": "My wildest dreams have come true... just look at this incredible landscape!",
  "CDE_Elliott_Married_Outdoor_2": "It's the strangest thing, but I get fewer tangles in my hair when I dry it outside. I try to do that on occasion.",
  "CDE_Elliott_Married_Outdoor_3": "The best authors manage to master a variety of voices and styles. That's an ongoing goal of my own",
  "CDE_Elliott_Married_Outdoor_4": "Fertile soil beneath my feet, fresh air to fill my lungs, and the sun's warmth to delight my skin... Life is going well.",
  "CDE_Elliott_Married_Outdoor_5": "I might stay here and write some poetry. I'm feeling a sudden surge of creativity! You go on ahead and take care of business.",
  "CDE_Elliott_Married_Outdoor_6": "Triumphant wheel that spins the sky, illuminate us with a sigh. For now the dawn-air's chorus croons, to summon nature's youthful tunes.$h",
  "CDE_Elliott_Married_Outdoor_7": "If I stay perfectly still, perhaps a resplendent butterfly will bless my nose with a landing.",
  "CDE_Elliott_Married_Outdoor_8": "Scarecrows seem to work well here. I can't imagine the birds are short on food in the nearby forests.",
  "CDE_Elliott_Married_Outdoor_9": "Good morning. May I steal a soft kiss from my love?$l",
  "CDE_Elliott_Married_Outdoor_10": "I drank too much coffee... my mouth feels about as dry as the Calico Desert.$s#$e#Oh... sorry about the coffee breath.$7",
  
  //Festival Specific Dialogue
  
  
  //Date Specific Dialogue
  "CDE_Elliott_Married_spring3":"I wonder what new stories we'll have to tell this year? This new chapter of our lives is still just beginning.",
  "CDE_Elliott_Married_spring15":"I wonder how Leah is faring this spring. Have you seen her much?",
  "CDE_Elliott_Married_spring18":"I have a new book from the library that's an absolute joy.#$b#The author's command of our language is masterful. The rhythmic sentence structures, the diction... I wonder if I could emulate the style a bit?",
  "CDE_Elliott_Married_spring28":"The fledgling days of the year are at a close. There's no reason to grieve, though! Summer, fall, and winter all have a precious beauty to them, too.",
  "CDE_Elliott_Married_summer6":"I have to make sure I write something today. Even if it's just a sentence, it makes all the difference in the world.#$e#I fear I would lose my momentum if I gave into any excuses for laziness.",
  "CDE_Elliott_Married_summer15":"My soul is alive today!$h#$b#And I know that will not be the case forever. I don't want to miss a second of what this day has to offer.",
  "CDE_Elliott_Married_summer18":"The halcyon days of summer are not gone! No, they're here in front of us, right now!$h#$e#Blissful as our childhood memories may be, we must not allow nostalgia to blind us. Today is just as precious as any day from years ago.",
  "CDE_Elliott_Married_summer22":"I wonder what little treasures of the sea are washing up on the beach these days?#$e#I've always enjoyed examining those tide pools. The edge of the pool is the edge of the world for some of those creatures!$h",
  "CDE_Elliott_Married_fall5":"None of the stories I've written are beautiful, so to speak. Beauty is an experience of the mind.#$b#I think of my written work as a gateway into that experience. Whether the reader successfully enters into beauty is largely up to them.#$b#But I like to think I make it easier for them.$h#$e#Sorry, is it too early to be speaking of such things?",
  "CDE_Elliott_Married_fall8":"That old piano is still sitting in my old shack. I wonder if today is a good day to pay it a visit?",
  "CDE_Elliott_Married_fall20":"Dear me. I should have flossed more carefully last night. I'm afraid one of my gums is rather sore.$s",
  "CDE_Elliott_Married_fall23":"I wrote a short little vignette yesterday. I just need to polish it up today.#$b#Would you like me to read it to you after we go to bed tonight?$h",
  "CDE_Elliott_Married_winter4":"Having a fresh field of unfettered snow... it's like having a blank sheet of paper and a pen.#$b#Such potential to explore!$h",
  "CDE_Elliott_Married_winter12":"I must say, it is delightfully cozy in here! My old cabin got so cold.$h#$b#Just as I might have started missing it, I remember how rudimentary it truly was.",
  "CDE_Elliott_Married_winter16":"My fingers used to get so stiff as I wrote in that cold, old cabin.#$b#I never have to worry about that here.$h",
  "CDE_Elliott_Married_winter21":"I've always thought, as long as speaking is one of the most fundamentally human things we do, I might as well take some pride in it.$h#$e#I say I should speak mellifluously, even if others may find it strange.#$b#Yet, you know me well, dear: It would be strange if I didn't speak in my most authentic voice, would it not?"

  //Season specific dialogue

  //Affection specific dialogue
}
