{ //Emily
  //Emily Gift Tastes
  "CDE_Emily_GoldPumpkin": "What a strangely beautiful object! It radiates with a curious spiritual energy...",
  "CDE_Emily_Pearl": "How gorgeous! To think, such beauty comes from the unforgiving, murky depths of the ocean...#$b#The whole world's like that, you know.",
  "CDE_Emily_PrismaticShard": "The prismatic shard is the most sacred of all stones. May Yoba bless this day between us.$7",
  "CDE_Emily_RabbitsFoot": "You wish me good fortune? Then I'll return the favor to you in my orisons.$u",
  "CDE_Emily_Wool": "Ohhh, it's so soft!#$b#And to think... an animal made this selflessly, just for us. It's humbling.$3",
  "CDE_Emily_Cloth": "Perfect! This is just what I need for my next tailoring project. Thank you!$h",
  "CDE_Emily_SurvivalBurger": "@, this looks delicious! Really, it's a work of art!#$b#This'll be my best meal all week!$h",

  //Emily's Misc Dialogue
  //these lines target files other than the standard characters/dialogue/Emily location such as unmarried rainy dialogue
  "CDE_Emily_rainy_1": "It never rains in Calico Desert... That's where my friend Sandy lives.#$e#I wish I could've visited her today.$s",
  "CDE_Emily_rainy_2": "If you stand in the rain and listen carefully, the raindrops sound like little whispered conversations.",
  "CDE_Emily_rainy_3": "The essence of a day like today deserves its credit, too.#$e#It's a good habit, you know, giving positive energy where it's needed most.",

  //Emily's Standard Dialogue
  //Special Dialogue
  "CDE_Emily_repeated_1": "In a way, Yoba plays an important role in my life, but I believe her presence goes beyond anything we can comprehend.#$b#Who knows? Maybe she isn't even a 'she.'",
  "CDE_Emily_repeated_2": "Life can't last for all time, so we have to make sure we embrace every day!#$b#But also, what IS 'time,' anyway?",
  //Sat8, fall_Tue10
  //fall_Fri8, winter_Sat8

  //date specific dialogue
  "CDE_Emily_spring1y2": "Where will fate lead us this year? I'm eager to find out.$h",
  "CDE_Emily_spring23": "Who will I dance with tomorrow at the festival? Wherever my presence is needed the most, that's where I'll end up!",
  "CDE_Emily_summer10": "Hey, look for me tomorrow at the luau. I'll greet you, but probably not in the way you're used to.",
  "CDE_Emily_summer27": "The moonlight jellies will be here soon. As people, we have so much we can learn from them.$l",
  "CDE_Emily_fall14": "I'm looking forward to the crowds at the fair in a couple of days. There will be so many interesting people to meet!",
  "CDE_Emily_fall26": "Gus has some pretty tasty treats that he's been prepping for Spirit's Eve. Be sure to say hi!",
  "CDE_Emily_winter9": "Those poor fish! I hope Mayor Lewis was responsible with them after yesterday's competition.$s",
  "CDE_Emily_winter24": "It's been a whirlwind at work lately.#$b#Gus has been in high gear with all the food he's been cooking for the feast!",

  //heart specific dialogue
  "CDE_Emily_summerMon10": "@, hold on a sec.$l#$b#%*kiss*#$b#...$l#$b#Have a wonderful day!$l",
  "CDE_Emily_summerMon6": "I don't completely buy into the idea of the 'self.'#$b#It makes much more sense to me that all of existence is one divine presence, and we are merely ripples upon it.",
  "CDE_Emily_summerTue4": "There are some great spots to go camping around here. Is that your thing, very much?",
  "CDE_Emily_summerTue2": "It's another workout day today. I love waking up all those dormant muscles in my body!",
  "CDE_Emily_summerWed10": "@... do you think we're... destined for more than just our day-to-day conversations?$l",
  "CDE_Emily_summerWed8": "Have you talked to the birds lately?#$b#...It's important to remember that we have so much more in common than you think.",
  "CDE_Emily_summerWed4": "I gave my friend Sandy a call earlier today. Sounds like it's pretty lonely out in the desert.$u#$e#I believe everyone is always where they need to be, but we'll see if the universe provides another path for her.$u",
  "CDE_Emily_summerThu8": "We're just standing here, but the universe has brought us to this exact moment!$h#$b#It's absolutely amazing if you stop and think about it.",
  "CDE_Emily_summerThu4": "I feel guided to take more risks, lately.#$q 040/041/042 summerThu_old#So, @, do you believe in fate?#$r 040 0 Thu_040#No, we control our lives.#$r 041 0 Thu_041#Yes, there's no such thing as choice.#$r 042 10 Thu_042#I'm not sure.",
  "CDE_Emily_summerThu_old": "$p 042#I still have to listen carefully to the conscience that the universe gifts to us, though.|I still have to listen carefully to the conscience that the universe communicates to us, though.",
  "CDE_Emily_Thu_040": "I've thought that, too, but what if I'd been born with a different brain? Would I have made the same choices?#$b#And could I still call those choices my own, if it was pure luck that I got that brain?",
  "CDE_Emily_Thu_041": "Right? I can't deny that we only make our 'choices' because of preexisting influences.#$b#That's why I can't ever judge someone for the situation they're in.",
  "CDE_Emily_Thu_042": "Hey, maybe that's the best way to be! There's so much to wonder at in the universe.",
  "CDE_Emily_summerSat10": "I want to love everyone equally, @, but I can't deny that what I feel for you is... a little deeper.$u#$e#Do you think you'll live here a long time?$u",
  "CDE_Emily_summerSat8": "My sewing machine's been getting a good workout this summer. I just have so many projects.#$e#I'll maybe get around to making something for Haley, but I also have to accept there's a good chance she'll never wear it.$u#$b#Oh well. *shrug*",
  "CDE_Emily_summerSat4": "We should always treat one another with not just respect, but love, too.#$e#I try to treat everyone the same. Sandy, Clint, Shane, you... everyone.#$e#Because you're all wonderful in your own ways!$h",
  "CDE_Emily_summerSun10": "Souls swirl together like clouds forming and reshaping in the sky. I'm glad we've crossed paths as we have, @.$l",
  "CDE_Emily_summerSun8": "Hi, @! We've become decent friends, haven't we?$h#$e#This may sound weird, but I've always been certain this would happen.",
  "CDE_Emily_summerSun6": "Hi, @! We've become decent friends, haven't we?$h#$e#That's fine with me. You're a cool guy.^I'm glad.$h",

  "CDE_Emily_fallMon4": "I've been working on some sweaters for when the days get colder.#$e#My goal is for the fabric to create a warm, nostalgic feeling for whoever wears it.",
  "CDE_Emily_fallTue8": "Everyone has something to contribute to this world. Whether it's big or small makes no difference.",
  "CDE_Emily_fallWed8": "I wish Gus wouldn't make his salmon dinner recipe. If we aren't careful, we'll run the world clean out of salmon.$s",
  "CDE_Emily_fallWed2": "One place where I put my foot down is with salmon. No other creature labors like they do to fulfill their purpose.$s#$e#If you catch one, I hope you'll toss it back.$s",
  "CDE_Emily_fallThu8": "I hope I get a chance to visit the desert again soon. I've got to see Sandy, of course, but...#$b#...there's also a trader whose wares are just amazing.#$e#Be sure to bring some gems with you for trading, if you go.",
  "CDE_Emily_fallThu4": "I practice transcendental meditation. It's very important, I think, to get in touch with the part of the world we cannot see.",
  "CDE_Emily_fallThu2": "I saw a little family of mushrooms living under one of the trees in town.$l#$e#Cutest thing ever!$h",
  "CDE_Emily_fallFri10": "It's okay for me if people see us kiss. Everyone in town knows I'm the touchy-feely type.#$e#Oh?#$b#%*kiss*#$b#Heehee...$h",
  "CDE_Emily_fallFri4": "Smell that clean air? It's lovely, isn't it?#$b#I just fear that the Joja Co.'s of the world will take this away from us.$u",
  "CDE_Emily_fallSat10": "Hi @.$l#$e#My heart rate picked up as soon as I saw you. Here, put your hand on my chest.$l#$e#I'm so glad you came by!",
  "CDE_Emily_fallSat8": "There's good people in this town who just can't seem to find happiness. It makes me sad.$u#$e#Working in the saloon, I hear first-hand about everyone's problems.$u",
  "CDE_Emily_fallSat4": "I don't have any huge plans for life. I prefer not to stress about the future.",
  "CDE_Emily_fallSun10": "You're such a nice person, @! Thanks for being good to me.$h",
  "CDE_Emily_fallSun8": "You're such a nice person, @! Thanks for being my friend.$h",
  "CDE_Emily_fallSun4": "There are so many invisible barriers holding us back. Why can't people learn to let go and celebrate freedom?#$e#Me? Well, you know what they say... 'You can't cage a wild Junimo'.",

  "CDE_Emily_winterMon10": "@, hold on a sec.$l#$b#%*kiss*#$b#...$h#$b#Have a wonderful day!$h",
  "CDE_Emily_winterMon8": "Be careful an icicle doesn't fall on your head! I wouldn't want you to get hurt!",
  "CDE_Emily_winterMon4": "With the weather as cold as it is, I've been working on a sweater for Shane.#$e#I think he'll like it. It's not too heavy, so it should fit nicely under his favorite hoodie.",
  "CDE_Emily_winterMon2": "Every now and then, I get a craving for a good vegan burger.#$e#I'm not actually vegan, or vegetarian. I just eat whatever feels most nourishing for my body and spirit.",
  "CDE_Emily_winterTue8": "I hope we all can learn to age as well as the changing of the seasons into winter.",
  "CDE_Emily_winterTue6": "We can all use a little more dancing in our lives, don't you think?#$e#In a way, all of life is a dance. It's just a matter of how well aware your physicality recognizes that.",
  "CDE_Emily_winterWed10": "Sometimes it feels like I have to be a parent to Haley. But that's not a role I can really fill...$u",
  "CDE_Emily_winterWed8": "I do wonder sometimes where Haley will end up.$u#$e#I'm sure she'll wind up exactly where she needs to be.",
  "CDE_Emily_winterWed6": "Haley and I aren't made for such a big house. It's a hassle to keep it clean.#$e#Ah well. I really shouldn't be complaining.#$e#Your farmhouse seems nice and cozy.$h",
  "CDE_Emily_winterWed4": "The last time I visited Calico Desert, I came across a merchant with a camel. She had so many beautiful things for sale, it almost took my breath away.#$e#Next time I go, I'll have to bring some of my gem collection for trading. She doesn't accept G.",
  "CDE_Emily_winterWed2": "I really wish Haley would pitch in more with keeping the house clean.#$e#Ah well. I just wish we all could learn to accept the responsibilities that are laid before us.",
  "CDE_Emily_winterThu10": "You look like you could use a little human connection.$h#$b#%*kiss*#$b#Touch is important. I wish more people were open about it.$h",
  "CDE_Emily_winterThu4": "It's free hug day today!$h#$b#%*hug*#$b#I hope your day goes wonderfully!$h",
  "CDE_Emily_winterFri8": "It isn't always easy trying to show love and compassion for everyone.#$e#What if the love I show for one person hurts someone else?$s",
  "CDE_Emily_winterFri6": "If I wasn't so busy I'd help you dig around in that cave by the lake.#$e#I bet there are some powerful crystals inside there.",
  "CDE_Emily_winterFri2": "Crystals hold various potent properties. Some of them can serve as a nexus for spiritual connections with others.#$e#Clint's big into crystals, too. That's probably why we're such good friends.$h",
  "CDE_Emily_winterSat6": "The world around us is sleeping, but the spirits are still very much alive.#$e#You can hear the spirits if you know how to listen with more than just your ears...",
  "CDE_Emily_winterSun10": "The spiritual connection that I feel to you... do you feel it too?$l#$b#It's like a million invisible threads connecting the two of us.$l#$e#...No?#$b#%*kiss*#$b#How about now?",
  "CDE_Emily_winterSun8inlawHaley": "Say hi to my sister for me! And remind her to visit me tomorrow.",
  "CDE_Emily_winterSun8": "My sister and I might fight sometimes, but I would really miss her if she left.#$e#I think she'll become a very nice young lady some day... Don't tell her I said that.$h#$e#So, is there anything you want to talk about?",
  "CDE_Emily_winterSun6": "There were some huge snowflakes outside the other night!#$e#Sometimes, I really enjoy walking home late at night.",
  "CDE_Emily_winterSun2": "My homemade sweaters have been really cozy in this cold weather.",

  "CDE_Emily_Tue10": "Hey, @.$l#$b#%*kiss*#$b#You don't mind if I do that, do you? Physical touch is really important to me.$l",
  "CDE_Emily_Tue2": "Leah comes into the saloon sometimes. You should go ahead and talk to her.#$e#She's a real sweetheart.",
  "CDE_Emily_Wed2": "I like sleeping in when I can. I stay out pretty late on nights that I work, so it's just a routine I've fallen into.",
  "CDE_Emily_Thu8": "Dancing is important to me, but I have no plans to dance for a big audience.#$e#It helps me to connect with the physical energy of the world around me.#$b#And if I share that connection with a handful of close friends, that makes it really special for me.",
  "CDE_Emily_Thu2": "I'm sorry, you must miss your grandfather so much.$u#$b#But once a soul comes into existence, there's no reason why it has to go away completely. I'm sure you'll see him again soon.",
  "CDE_Emily_Fri10": "I don't think anyone will be suspicious if they see me kissing you. Everyone knows I'm the touchy-feely type.#$e#Oh?#$b#%*kiss*#$b#Heehee...$h",
  "CDE_Emily_Fri8": "It's always important to spread goodness, but we also have to remember that everyone is on a different journey.#$b#In my view, there's never any room for judging someone else for their situation.#$e#Just love others, right? That's what it's all about.",
  "CDE_Emily_Fri6": "We have to remember that everyone is connected to everyone and everything else.#$b#The happiness you share today will make ripples across time for hundreds of years.",
  "CDE_Emily_Fri4": "The flowers are really alive out there! I look out at the grassy fields and I see a sea of souls, shifting and mingling.#$e#It's beautiful to be a part of it all.",
  "CDE_Emily_Fri2": "Friday nights at the saloon are a lot of fun. It's good to get into a sense of flow when the speed picks up.",
  "CDE_Emily_Sat4": "I've experimented with making my own dyes from materials that come from around here.#$e#Synthetic dyes just don't work on your skin the same way natural ones do.",
  "CDE_Emily_Sat2": "Clothing is the gateway between your body and the world that surrounds you.#$b#I like to make clothing that connects me harmoniously with the day's experiences.",
  "CDE_Emily_Sun10": "@, you're very special to me. You know that, right?$u#$e#Everyone and everything around me is also special, but you... I can't seem to stop thinking about you...$u#$e#...Come what may, I felt compelled to tell you that.$u",
  "CDE_Emily_Sun8": "I can't shirk my responsibilities to this town, to the house, to Haley...$u#$b#My parents are abroad, where they need to be, but I'm also here, where I need to be, so...",
  "CDE_Emily_Sun6": "I think it's neat how my parents learned to do what makes them happy.#$e#I do miss them, but it isn't really that different from anyone who moves out when they reach adulthood.#$b#For Haley and me, it's just the reverse.",

  //generic weekday dialogue
  "CDE_Emily_winterWedinlawHaley": "I'm so happy that Haley found you. The universe had a plan for her after all!$h",
  "CDE_Emily_winterWed": "I wish Haley would get a job or at least contribute to cooking and cleaning.$s#$e#I think she's hoping to marry someone rich.$u",

  //Emily's Married Dialogue
  //weather specific dialogue
  "CDE_Emily_Married_RainyDay_1": "I wonder where the flying insects go when it rains? Don't they get hit by the raindrops?",
  "CDE_Emily_Married_RainyDay_2": "I hope all the animals out there are taking shelter. Maybe they're all sleeping in.",
  "CDE_Emily_Married_RainyDay_3": "A day like this is a blessing from mother nature.",
  "CDE_Emily_Married_RainyDay_4": "When one raindrop falls on your head, how many times do you think its water molecules have been in the sky before?",
  "CDE_Emily_Married_RainyDay_5": "Good morning... I got this gift for you. Don't worry, I already purified it with sage incense. [428 440 444 338 207]",
  "CDE_Emily_Married_RainyDay_6": "It's pretty wet out there, isn't it? Here, this item will keep you well. [428 440 444 338 207]",
  "CDE_Emily_Married_RainyDay_7": "I meant to let the parrot go free, but his wing never fully healed. He seems content, though. I give him lots of attention.",
  "CDE_Emily_Married_RainyDay_8": "The parrot seems to enjoy living inside, especially on days like these. He told me that he's happy here.",
  "CDE_Emily_Married_RainyDay_9": "I never told you this... but when you first moved here I had a dream about you. I knew right then that our life-paths would intertwine.$4",
  "CDE_Emily_Married_RainyDay_10": "I've already forgotten last night's dreams. How strange. They were crystal clear when I first awoke.$u",

  "CDE_Emily_Married_RainyNight_1": "Every moment has a unique and precious beauty... do you notice? It can be easy to forget, sometimes.",
  "CDE_Emily_Married_RainyNight_2": "It's important to find something to love about each day. For me today, it was watching the fields dance to the rain in the afternoon.",
  "CDE_Emily_Married_RainyNight_3": "I can hear the plants talking to each other... they're so happy after today's rain!",
  "CDE_Emily_Married_RainyNight_4": "Does the weather have you feeling down? I wonder if a little clothing therapy would help?",
  "CDE_Emily_Married_RainyNight_5": "How was your day? You look a little soggy.",
  "CDE_Emily_Married_RainyNight_6": "Did you get everything done that you'd hoped?#$e#Don't worry if you didn't. Each day is special, even if it isn't what we planned.",
  "CDE_Emily_Married_RainyNight_7": "My day was very peaceful. How was yours?",
  "CDE_Emily_Married_RainyNight_8": "I wonder if the animals enjoy cuddling up together on a night like this.",
  "CDE_Emily_Married_RainyNight_9": "Want some dessert? It's my special raw, gluten-free version, sweetened only with cactus syrup.[232 234 223 220]$h",
  "CDE_Emily_Married_RainyNight_10": "I made you a treat! Sandy sent me the agave nectar that I used in it. [232 234 223 220]$h",
  "CDE_Emily_Married_RainyNight_11": "Does the sound of rain ever put you in a trance?",
  "CDE_Emily_Married_RainyNight_12": "I feel like our souls are especially in step tonight. Maybe we can head to bed a little early?$l",

  "CDE_Emily_Married_IndoorDay_1": "What physical objects do you feel especially connected to today? Be sure not to overlook them.",
  "CDE_Emily_Married_IndoorDay_2": "Another beautiful day on %farm farm... I have faith that something good will happen today!$h",
  "CDE_Emily_Married_IndoorDay_3": "Here, take this. It's for you. [428 440 444 338 207 395 749]",
  "CDE_Emily_Married_IndoorDay_4": "I've been saving this for a special occasion. Today seems like the right day. [428 440 444 338 207 395 749]",
  "CDE_Emily_Married_IndoorDay_5": "Hey, someone must've gotten a good night of sleep... you look fresh this morning.$h",
  "CDE_Emily_Married_IndoorDay_6": "One day, we'll all wake up from this life, as if from a pleasant sleep.#$e#But for now and many years, I just want to enjoy this dream.",
  "CDE_Emily_Married_IndoorDay_7": "My horoscope for the day isn't too good... but I'm going to make the best of it, as always. Let's get to work!",
  "CDE_Emily_Married_IndoorDay_8": "I wonder what Haley's doing today? I hope she has something planned.",
  "CDE_Emily_Married_IndoorDay_9": "Ughh... *gurgle*... I ate too many bran muffins for breakfast.$s",
  "CDE_Emily_Married_IndoorDay_10": "Good morning! Give me a kiss before you go.$l",
  "CDE_Emily_Married_IndoorDay_11": "Shh, take this and hold it to your heart.[428 440 444 338 207 395 749]$u#$b#Breathe deeply, then do with it what you wish.$u#$e#And don't tell anyone else about it. This is of great importance.$u",
  "CDE_Emily_Married_IndoorDay_12": "Work isn't really work if you enjoy it. Would you agree?",
  "CDE_Emily_Married_IndoorDay_13": "Some spiritual teachers preach that attachment is the cause of suffering, but I couldn't disagree more.#$b#Attachment is the most beautiful thing we can experience.$l",
  "CDE_Emily_Married_IndoorDay_14": "I'm not worried about the future. I can already read that our destinies are safe. And time is an illusion, anyway.",
  "CDE_Emily_Married_IndoorDay_15": "Your aura is a brilliant green today. Were you hoping to hit the town?#$e#It's a great day for meeting with our neighbors.",

  "CDE_Emily_Married_IndoorNight_1": "Is that a new hole I see in your shirt? I can sew that up for you, no problem.",
  "CDE_Emily_Married_IndoorNight_2": "I danced a little while you were out. It always helps bring me back in touch with reality.",
  "CDE_Emily_Married_IndoorNight_3": "Welcome home. I hope you had a wonderful day.",
  "CDE_Emily_Married_IndoorNight_4": "Welcome home. I love the way you look at me like that.$l",
  "CDE_Emily_Married_IndoorNight_5": "Is it bed time already? My, the day just floated away from me again.$u",
  "CDE_Emily_Married_IndoorNight_6": "I just got off the phone with Sandy. Sounds like she had a great time visiting Zuzu City not too long ago.",
  "CDE_Emily_Married_IndoorNight_7": "Ah, that aroma! It can only be you. It's a good smell.$h",
  "CDE_Emily_Married_IndoorNight_8": "I feel so comforted, the split-second I hear your footsteps land on the deck.$l",
  "CDE_Emily_Married_IndoorNight_9": "I swept the whole house, washed the windows, dusted, and cleaned the fridge. It was a very productive day!",
  "CDE_Emily_Married_IndoorNight_10": "Maybe someday when we retire, we can travel the world, like my parents. At least just for a little bit.$u",

  //location specific dialogue
  "CDE_Emily_Married_funLeave_1": "I'm going to visit town today, and later on I'm going to help out at the saloon. Have a nice day.",
  "CDE_Emily_Married_funLeave_2": "Gus rang. Said he had some work for me, so that's where I'll be later today if you need me.",
  "CDE_Emily_Married_funReturn_1": "My day went well... it's good to get out of the house now and then.",
  "CDE_Emily_Married_funReturn_2": "What a wonderful day today! It was nice to take a stroll through Pelican Town.$h",

  "CDE_Emily_Married_spouseRoom_1": "I'm going to spend some time with the parrot today. It breaks my heart that he'll never fly again.$u",
  "CDE_Emily_Married_spouseRoom_2": "Some of your clothes are getting a bit tattered, so I'll be mending a few of them today.",
  "CDE_Emily_Married_spouseRoom_3": "The parrot needs love. All living things need love, really.$u#$b#But destiny brought him to my doorstep, so the connection he shares with me is extra special.$u",
  "CDE_Emily_Married_spouseRoom_4": "I've got a fresh bolt of cloth queued up for myself. I wonder what I can start making with it today?",
  "CDE_Emily_Married_spouseRoom_5": "I can stare at that painting on the wall for hours if I let myself. It's a kind of meditation, I'd say.#$e#You'll keep noticing finer and finer details if you really stop and look.$h",

  "CDE_Emily_Married_OneKid_1": "I hope we can raise our child to be kind and considerate. That's more important than getting A's in school.",
  "CDE_Emily_Married_OneKid_2": "Little %kid1 will probably grow up to like vegetables if we set a good example. What do you think?",
  "CDE_Emily_Married_OneKid_3": "Is one child enough, or should we raise another? I guess we'll just see where fate leads us.",
  "CDE_Emily_Married_OneKid_4": "To think... if you'd never felt upset at your old job, you never would've moved here, we'd have never met, and %kid1 wouldn't even exist.$l",
  "CDE_Emily_Married_OneKid_5": "I lit a pale green candle and shook a sprig of baby-mint over our little one. That should ward off any dangerous spirits.",
  "CDE_Emily_Married_OneKid_6": "I love %kid1's cute little baby noises.$h",
  "CDE_Emily_Married_TwoKids_1": "A big house, two kids and a parrot... I have my hands full!",
  "CDE_Emily_Married_TwoKids_4": "Yoba has blessed our home so much! We have that much more responsibility to show love and support to others.",
  "CDE_Emily_Married_TwoKids_3": "Well, %kid2 certainly has your hair...",
  "CDE_Emily_Married_TwoKids_6": "I hope the parrot doesn't feel neglected, but I have to admit that these kids keep my hands more than full.$s",
  "CDE_Emily_Married_TwoKids_7": "Oh, I already fed the kids their organic quinoa puffs with goat milk. You just focus on the farm!",
  "CDE_Emily_Married_TwoKids_8": "I forgot to tell you, the kids loved seeing their Aunt Haley yesterday. She stopped by.",

  "CDE_Emily_Married_Outdoor_1": "I love getting up early. There's a certain freshness to the air and the wildlife is much more active.",
  "CDE_Emily_Married_Outdoor_2": "Shh, if you pause and listen very carefully, you can hear the ocean.",
  "CDE_Emily_Married_Outdoor_3": "What's on the agenda today, dear?",
  "CDE_Emily_Married_Outdoor_4": "If you need a break later today, you can meditate over at the crystal garden. There's no wrong way how to do it.",
  "CDE_Emily_Married_Outdoor_5": "A little sunlight is good for you. Just don't get crispy, okay?",
  "CDE_Emily_Married_Outdoor_6": "There's so much to do today! Not in the stressful sense, but just in the 'appreciation' way.",
  "CDE_Emily_Married_Outdoor_7": "Good morning! I was wondering when you'd finally roll out of bed!$h#$e#I was hoping you wouldn't miss this beautiful morning.",
  "CDE_Emily_Married_Outdoor_8": "Living here, I can't help but get up extra early. I'm usually up before you, huh?#$e#It's okay... you deserve a good night of rest.",

  "CDE_Emily_Married_patio_1": "This is my favorite spot for a morning meditation. I visualize the energy from this crystal garden flowing through my body.",
  "CDE_Emily_Married_patio_2": "%Emily is in a deep meditative state.",
  "CDE_Emily_Married_patio_3": "Ahh! Feels good!$h#$b#Y'know, just being alive. If you take the proper time to notice it, it's undeniable.",

  //Date Specific Dialogue
  "CDE_Emily_Married_spring14": "The farm must seem like an endless expanse to the bugs and worms. It's an entire world, really.#$e#When I think about people standing all over the planet, we're just like the bugs who only know the farm. What lies beyond?#$e#Everything is relative. It's just a matter of perspective.",
  "CDE_Emily_Married_spring19": "It's Friday! Are you going to have a night out, or are you going to stay in?",
  "CDE_Emily_Married_spring27": "The parrot sang me a little song right before you got up. Did you hear it, or were you still out?",
  "CDE_Emily_Married_summer7": "I'll never forget that bear that showed up on our camping trip.#$b#Nor the part that came after that.$l",
  "CDE_Emily_Married_summer12": "I hope I didn't go overboard with the dancing yesterday. I'm thirstier today than I expected.$u#$e#When you dance, it's important not to care if anyone's watching. That's the only life I'll ever care to know.",
  "CDE_Emily_Married_summer18": "Do we have any structures that could be temporarily repurposed as a sweat-lodge? It's just a thought I had.",
  "CDE_Emily_Married_summer22": "I know some people might be a little put-off by the things I believe and the way I act. But it's just the way I am.$u#$e#I don't know how to be myself any other way.",
  "CDE_Emily_Married_summer26": "Today is 'Do Something Nice for a Random Person' Day. Maybe I'll pay for Clint's burger tonight at the Saloon.#$e#Anyone in mind whose day you'd like to brighten?",
  "CDE_Emily_Married_fall4": "*sigh*... Salmon season.$s#$e#I hope as many as possible complete their long upstream journey.$s",
  "CDE_Emily_Married_fall7": "Mmm, maybe we can make it survival burger night, tonight?#$e#I've just got a craving.",
  "CDE_Emily_Married_fall10": "Are you going down into the mines any time soon? I know that Yoba will protect you, but it doesn't hurt to be vigilant on your end, too.$u",
  "CDE_Emily_Married_fall14": "When my feelings for you first developed, I secretly feared I'd lose my passion for loving the world around me...$u#$b#...that all my love was diverted into you.$u#$b#But now, I can see it's not a problem at all. The bond I share with you just spurs me on, to love everyone and everything even more!#$e#...$l",
  "CDE_Emily_Married_fall20": "The spirits are really active this time of year. Stand by the trees in the forest, and you can hear more than just the wind whispering through.",
  "CDE_Emily_Married_winter10": "You know, I noticed that Haley's keeping the house in pretty good shape!#$e#Who knew that all I had to do was move out, and she'd suddenly step it up?$h",
  "CDE_Emily_Married_winter22": "@, I just wanted to say, as long as we've known each other, you've never tried to change me from the person I am.$u#$b#I know... a lot of people don't really understand me, and possibly sometimes I do things that even confuse you a little, too...$u#$b#...But you've always accepted me.$u#$e#So... thank you.$u",
  "CDE_Emily_Married_winter16": "I hope Shane and Clint are doing okay. I don't see them as much as I used to.$u"

  //Season specific dialogue
  //Affection specific dialogue
}