{ //George

  //George Gift Tastes
  "CDE_George_GoldPumpkin": "Gold... pumpkins? Pumpkins are gold now? What'll they think of next?#$b#Still, though, it's gold...$h",
  "CDE_George_RockCandy": "Ah, the original sugar sweet! And still the best kind! I'll take that!$h",
  "CDE_George_Pearl": "With your young set of lungs, you must've gone diving for this yourself! That's the spirit!$h",
  "CDE_George_PrismaticShard": "This? I found dozens of these back in my days as a miner. Or I would have, if I'd had more time.#$b#But uh, I'll admit it, I'm impressed.$h",
  "CDE_George_Leek": "$c 0.5#Ha! You've got taste, kid, I'll give you that!$h#Ha! Now this'll wake up the ol' taste buds. Did you wash it?$h",
  "CDE_George_FriedMushroom": "Now that's what I call an honest-to-goodness meal! It's all you really need. Just mushrooms, oil...#$b#You didn't put any newfangled seasonings on it, did you?",

  //George's Misc Dialogue
  //these lines target files other than the standard characters/dialogue/George location such as unmarried rainy dialogue
  "CDE_George_rainy_1": "It's awful cold, isn't it? What a rotten day.",
  "CDE_George_rainy_2": "Why do I even bother getting out of bed when the day looks like this?",
  "CDE_George_rainy_3": "Soaked, are you? Good. Means you've been working hard.#$e#You're not soaked to the bone, though. You could stand to get a few more chores done out there.#$e#Mm-hmph.",

  //George's Standard Dialogue

  //Special Dialogue

  //festival related dialogue

  //date specific dialogue
  "CDE_George_spring1":"Everyone in the news is just talking new year's this, new year's that. Isn't anything happening in the world?#$e#Hah, the news people must assume the whole world just stops when they stop talking about it.$h",
  "CDE_George_summer10":"What? There's another festival tomorrow? Didn't we just have one?",
  "CDE_George_winter15":"Night Market? No thank you. Nothing would make me want to go to that aberrant sideshow.#$e#Why's it have to be so late, anyway?",
  "CDE_George_winter24":"Now why wouldn't I be excited about tomorrow? Take a wild guess.#$e#Oh, do you enjoy sitting in the freezing cold for hours?",
  "CDE_George_winter28":"Another year gone. My life feels like a flip-book.",


  //heart specific dialogue
  "CDE_George_Mon10":"You may or may not have heard already, but our daughter passed away some years ago.$s#$e#I don't know how Evelyn manages each day. I know that she's just as broken up about it as I am.$s",
  "CDE_George_Mon8":"Is there really a place for me in this world, anymore?#$e#Maybe that's just the way it has to be.",
  "CDE_George_Mon6":"I'm surprised you want to be friends with an old-timer like me.",
  "CDE_George_Mon4":"Still haven't given up yet, huh?#$e#The farm, I mean. Still goin'?",
  "CDE_George_Mon2":"All right. What is it you want from me, anyway?",
  "CDE_George_Tue10":"You know, I shouldn't get too depressed about my legs.#$e#I should just be happy that I'm alive.$h",
  "CDE_George_Tue6":"I don't understand what you young people are planning to do with this world.#$e#All I can say is that it ain't the world I once knew.",
  "CDE_George_Tue4":"What're you doing, wasting your time talking to an old man like me?#$e#Don't young people even stay busy anymore?",
  "CDE_George_Tue2":"Yeah, look at you, runnin' around like that. Just rub it in, why don't ya?",
  "CDE_George_Wed10":"@! Let me turn off this darned television and we can have a little chat.$h#$e#So what are the young people doing these days?",
  "CDE_George_Wed8":"I wish my legs worked so I could play catch with Alex.$s#$e#That'll never happen.$s",
  "CDE_George_Wed4":"You be thankful for what you have on that farm, d'you hear?#$e#Before you know it, life'll pull the rug out from under you.#$e#It's only a matter of time.",
  "CDE_George_Wed2":"Are you trying to get me to buy something? I'm not interested.",
  "CDE_George_Thu10":"There are few things better in life than a nice fresh leek, wouldn't you say?$h#$e#What? What's wrong with leeks? They're not just 'good,' they're outstanding. Everyone loves leeks.#$e#Do young people not love leeks anymore? Man alive...$3",
  "CDE_George_Thu8":"You ever watch this show \"36\"? Now that's some good entertainment.$h#$e#Nobody ever stops this guy from fighting the terrorists. He just does whatever he wants and it's hilarious.$h",
  "CDE_George_Thu4":"Looks like another rerun today.#$e#Shouldn't you be out and about?",
  "CDE_George_Thu2":"What do you want? Now's not a good time.#$e#Why? 'Cause it ain't.",
  "CDE_George_Fri6":"You be thankful now, that Stardew Valley is one of the few places where you can still work the land how you want.#$e#These politicians just want to regulate, regulate, regulate like they own this country. Hmph.",
  "CDE_George_Fri2":"So you're a farmer, huh? At least it's honest work.",
  "CDE_George_Sat8":"Evelyn's always been the best cook I know. And she just keeps getting better.#$e#Wish I could say the same about something I can do.$s",
  "CDE_George_Sat6":"Is it the weekend already? I guess I'll have to get out of the house soon, then.",
  "CDE_George_Sat4":"My prescription just keeps getting more and more expensive.#$e#This wouldn't have been a problem a generation or two ago. But these drug companies keep hiking the cost!",
  "CDE_George_Sat2":"Hi there.#$e#What's going on out there, anyway?",
  "CDE_George_Sun10":"I didn't spend much time praying till recently.#$b#For a while, I was furious with Yoba, what with me losing everything I had.#$e#I have a kernel of faith that there's something better for me after this old body's ticker runs out.#$b#It's not much, but what's an old man like me to do?$s",
  "CDE_George_Sun6":"It'll be good to be out of the house for a while.#$e#What are you up to today, young man?^What are you up to today, young miss?",
  "CDE_George_Sun4":"Is it the end of the week already? I lose track of what day it is.",
  "CDE_George_Sun2":"Aren't you cold? They don't make sweaters like they used to.#$e#*Sigh*",
  "CDE_George_summerMon10":"You keep workin' hard on that farm, y'hear? Somebody's gotta feed this old town if the world's economy bottoms out.#$e#D'you know what I mean?",
  "CDE_George_summerTue10":"From time to time, I can still see Clara in Alex's eyes.#$e#Alex is a good kid. You make sure you look out for him.",
  "CDE_George_summerWed10":"Bah! It's so hot! I'm in a cranky mood today.#$e#What? An old guy like me is allowed to be cranky when it's this hot.",
  "CDE_George_summerFri10":"Some of the things you see on the news these days... Why are young people so lazy these days?#$e#At least you've got some sense about hard work. But some young people just want the world to roll out a red carpet for 'em.",
  "CDE_George_summerSun10":"Whoa there! You'd better make way for me when I'm on the move, you rascal, or I might just run you down with this juggernaut!$h",
  "CDE_George_fallMon10":"Recently, I've been trying my best to stay positive each day.#$e#It isn't always easy. I apologize if I seem a little up and down.",
  "CDE_George_fallTue10":"When you get as old as me it's a lot harder to adjust to new things.#$e#One day you'll know what I mean.#$e#Go on, enjoy yourself while you're still young.",
  "CDE_George_fallThu10":"I don't watch the news to \"stay informed.\" I watch it because I just want to know what's going on.#$e#Look, there's a difference, okay?",
  "CDE_George_fallFri10":"I'm not stupid. I know there's some bias in the news programs. I just keep my thinking cap on while I watch.#$b#That's what everyone needs to do.",
  "CDE_George_fallSat10":"Tomorrow's an altar day. The way things used to be, you'd see half the town showing up at the Shrine of Yoba each Sunday.",
  "CDE_George_fallSun10":"Yep, I can do jumps, wheelies, spins... all kinds of tricks.$h#$e#Look over there!#$b#Oop, ya just missed me doing a somersault. Too bad.$h",
  "CDE_George_winterWed10":"Don't go wasting your youthful energy, @. You've gotta put in enough living for the both of us, y'hear?",
  "CDE_George_winterThu10":"I wonder what Evelyn's baking today...? Did she mention anything?#$e#Oh, I don't know, she may have mentioned something to me. But who am I to remember?",
  "CDE_George_winterSat10":"Sometimes I wonder if everybody is just waiting for me to die.#$b#Heh. I'll show them. I have plenty of years left in this old body.",
  "CDE_George_winterSun10":"I don't know how Evelyn even puts up with me anymore.$s#$e#Sometimes I feel more like a patient than her husband.$s",

  //generic weekday dialogue
  "CDE_George_Fri":"That farm's been in miserable shape for years.#$e#And you want to restore it? Hmph. Good luck.",
  "CDE_George_Sun":"What's it take for a little peace and quiet around here?",
}
