{ //Jas

  //Jas Gift Tastes
  "CDE_Jas_GoldPumpkin": "It's so sparkly! Like something out of a fairy tale! Wow!$h",
  "CDE_Jas_RockCandy": "I love candy! Yummy!$h",
  "CDE_Jas_Pearl": "This will fit right in my princess doll's crown! Thank you!$h",
  "CDE_Jas_PrismaticShard": "Wowww.$u#$b#It's... not just pretty, it's... b-beautiful.$u",
  "CDE_Jas_FairyRose": "*gasp* The fairies love these! And I do, too! Thank you, Mr. @!$h^*gasp*The fairies love these! And I do, too! Thank you, Ms. @!$h",
  "CDE_Jas_PinkCake": "That cake is... for me?$u#$b#Oh, thank you thank you thank you! It's the prettiest cake ever!$h",
  "CDE_Jas_PlumPudding": "I know what that is! That's plum pudding! Thank you!$h#$e#Aunt Marnie made me plum pudding when I moved here.",

  //Jas's Misc Dialogue
  //these lines target files other than the standard characters/dialogue/Jas location such as unmarried rainy dialogue

  //Jas's Standard Dialogue

  //Special Dialogue

  //festival related dialogue

  //date specific dialogue
  "CDE_Jas_winter28":"Happy new year, Mister @.^Happy new year, Ms. @.",

  //heart specific dialogue
  "CDE_Jas_Mon10":"@! It's youuu!$h#$e#I love you.$h",
  "CDE_Jas_Mon8":"I wish there were some other kids to play with around here.#$e#Vincent's a nice friend, but I see him almost every day.",
  "CDE_Jas_Mon6":"What's Zuzu city like? I've never been.",
  "CDE_Jas_Mon2":"So you live next door, right?$u", 
  "CDE_Jas_Tue10":"If you're good at taking care of animals, you're probably also good at taking care of dolls.#$e#A barn is kind of like a dollhouse, right? You have to go in and check on them and make sure they're all loved and happy.",  
  "CDE_Jas_Tue4_inlaw_Shane":"Shane always used to look so sad, but then he met you.#$e#I love happy endings.$h",
  "CDE_Jas_Tue8":"My dolls like going on adventures. I don't take the old ones outside, though, because I don't want them to get dirty.#$e#I don't know where the old ones came from. But they're my most special ones.",
  "CDE_Jas_Tue4":"Aunt Marnie always tells me to stay away from the tower on the other side of the pond.#$b#That's a rule I don't mind following.",
  "CDE_Jas_Tue2":"Aunt Marnie said I'm supposed to say hi to you.$u#$e#Um... hi.$u",
  "CDE_Jas_Wed10":"I'm getting pretty good at coloring books. The key is to color it darker when you're closer to the lines, and lighter when you're away from them.",
  "CDE_Jas_Wed8":"I'm pretty good at drawing. Aunt Marnie went and got me a set of 48 crayons, so I draw her a lot of pictures.",
  "CDE_Jas_Wed6":"Leah carved a little wooden doggie for me when she first moved in next door.#$e#She's really nice, but we haven't spent too much time with her since then.",
  "CDE_Jas_Thu10":"I remember my old school a little, from before I moved here. I wasn't there for very long, though.#$e#I just remember there were a lot of other kids.",
  "CDE_Jas_Thu8":"I like school. Sometimes it's hard to sit inside for so long, but Ms. Penny is the best.#$e#She's really smart, too.",
  "CDE_Jas_Thu6":"Sometimes I have to fix my own dinners. Usually I just microwave something, but I'm also pretty good at making eggs.#$b#And rice.",
  "CDE_Jas_Thu4":"Ms. Penny is teaching me how to write in cursive.$h#$e#She has such pretty handwriting.",
  "CDE_Jas_Thu2":"Do you like taking good care of animals?$u#$e#I was just curious.$u",
  "CDE_Jas_Fri8":"You're always so nice to me, Mr. @.$h^You're always so nice to me, Ms. @.$h#$e#Grown-ups are usually mean and boring, but you're different.",
  "CDE_Jas_Fri6":"Do you like skipping stones? It's easy if you know what kind of rock to look for.#$e#One time, Shane threw a rock that skipped six times in a row.$h",
  "CDE_Jas_Sat8":"I'm glad you're a nice grown-up. Back when I lived with my parents, there were some grown ups who were not nice.#$e#They would come over at night and be really noisy. I couldn't sleep.$u",
  "CDE_Jas_Sat6":"Angelina used to be my favorite Courtwick princess, but these days I like Cordelia more. She has the same hair as me.#$e#Plus, her sidekick goat is really funny.",
  "CDE_Jas_Sat4":"Ms. Penny started giving us homework this year. I thought it would be hard, but it's actually kind of fun.#$e#And I'm already done with it this weekend!",
  "CDE_Jas_Sun8":"The traveling merchant is in town today. I went with some of the money I saved.#$b#I was going to buy this one weird thing, but I didn't know what it was, so I got candy instead.",
  "CDE_Jas_Sun6":"Sometimes a traveling merchant comes through our neighborhood, and there's a pig who pulls the carriage.#$b#I named him Mumpy.",
  "CDE_Jas_Sun4":"What's up in the mountains anyway?#$b#I've never even been.$u",
  "CDE_Jas_summerMon4":"Our poor animals don't like these hot days.#$e#I wish we could just give the cows some ice cream.#$e#Eww, that'd be weird if it was their own milk!$h",
  "CDE_Jas_summerTue4":"I saw a snake out in the woods.#$e#It wasn't really scary. You just have to stay away from them.",
  "CDE_Jas_summerThu10":"I've been reading some chapter books from the library lately. Marcie and the Underground Castle is really good.#$e#Well, some of the parts didn't make sense to me, but I got the main idea.",
  "CDE_Jas_summerSat10":"If I grow up and work on a farm someday, would you be proud of me?",
  "CDE_Jas_fallWed4":"Have you found any wild plums on the ground?#$e#They're really yummy in plum pudding!$h#$b#I don't like them plain, though.$u",
  "CDE_Jas_fallThu4":"Fall flowers are my favorite. Are you growing any on your farm?",
  "CDE_Jas_fallThu10":"I love fall.",
  "CDE_Jas_fallFri10":"Sometimes I wonder what it'd be like to have my mom and dad with me at home, and it makes me sad.$u#$b#But I still have Aunt Marnie, Uncle Shane, Miss Penny, and You. There are a lot of grown-ups who are nice to me.",
  "CDE_Jas_fallSat10":"Grown ups always talk about how life goes by so fast. It doesn't seem like that to me.#$e#It's going to be SO long until my next birthday. I'm going to be an old lady by then!$s",
  "CDE_Jas_fallSun10":"When I grow up, maybe I'll work on a farm. Maybe I'll write stories or paint pictures.#$e#Or maybe I'll be a veterinarian.#$b#I don't know! We'll see.$h",
  "CDE_Jas_winterMon10":"Once, I woke up in the middle of the night. The shadows looked like they were moving, and then a face appeared.$u#$b#I almost screamed but then it disappeared.$u#$e#Maybe it was all a dream. I can't really tell.$u",
  "CDE_Jas_winterWed10":"Can I tell you a secret? Mayor Lewis is kind of weird.#$b#He's nice, too, but... I don't know. It's hard to explain.",
  "CDE_Jas_winterFri8":"Can you keep a secret?#$e#One time, I threw a snowball at Vincent and it almost knocked him over.#$b#But I was hiding in the bushes, so he never even found out it was me!$h",
  "CDE_Jas_winterSat6":"I love snow!$h#$e#One time, Shane came home at night when it was snowing. We danced under the back porch light until almost an hour after my bedtime.#$e#It was so pretty. *sigh*",
  "CDE_Jas_winterSun8":"Ms. Emily made me some mittens for this winter. She's so, so, so nice.#$e#I actually like gloves better, but not when the mittens are homemade.",

  //generic weekday dialogue
  "Tue_inlaw_Shane":"I miss Shane. Is he going to move back in?$s",
}