{ //Leo

  //Leo Gift Tastes
  "CDE_Leo_RockCandy": "*lick* It's sweet! What a yummy treat!$h#$b#...$u#$b#That rhymed!$h",
  "CDE_Leo_Pearl": "I-is this your treasure? The parrots told me of these, but I never found any.$u#$b#Thank you!$h",
  "CDE_Leo_PrismaticShard": "S-so nice! With this in my hand, I don't feel shy of anything!$h",
  "CDE_Leo_RabbitsFoot": "Ahh, it's nice and soft. I like it very much.",
  "CDE_Leo_DuckFeather": "So soft, so pretty... You are saying I may have this?#$b#Thank you!$h",
  "CDE_Leo_Mango": "Ah! A mango! Yes, this is what I love!$h",
  "CDE_Leo_OstrichEgg": "An ostrich egg! The parrots say ostrich is king of the birds. Did you know?#$e#I will keep it safe until it hatches, and then I will find it a home.",
  "CDE_Leo_Poi": "You made the special meal, just like the parrots taught me!$h#$e#*slurp* Mmm, it's just like they make it.",

  //Leo's Misc Dialogue
  //these lines target files other than the standard characters/dialogue/Leo location such as unmarried rainy dialogue

  //Leo's Standard Dialogue

  //Special Dialogue
    //no repeated dialogue
  
  //festival related dialogue

  //date specific dialogue

  //heart specific dialogue
  "CDE_Leo_Mon2": "Did you... find some Golden Walnuts today?#$e#No... don't share them with me. My family needs them most.$3#$e#I'll find enough for myself.",
  "CDE_Leo_Tue4": "...My hut? No, I couldn't build it by myself.$3#$e#The parrots are good helpers. They help me so much. You know?#$e#Do they help you, too?",
  "CDE_Leo_Tue2": "Is Willy your friend?#$e#...He's nice.#$e#I'm not so shy with him.",
  "CDE_Leo_Wed4": "...@, do birds ever fly here from your home?$3",
  "CDE_Leo_Thu4": "Oh, @! You're here!$h#$e#I'm happy you keep coming here so much.",
  "CDE_Leo_Thu2": "You know mangoes? They're... mmmmm! Delicious!$h#$e#I once ate them every day. My favorite tree grew them.#$b#...But then, the sky got mad... and broke the tree with lightning.$s#$e#...More trees can grow again, right?",
  "CDE_Leo_Fri2": "Sometimes I see an old man, with... what are they called? Glasses.#$e#I don't think he knows I'm here.$3",
  "CDE_Leo_Sat4": "I'm scared to ride a boat, because...$s#$b#...but, do you think Willy could help me try?",
  "CDE_Leo_Sat2": "...You come here on a boat? Willy, too?#$e#No... I can't ride boats. Too scared...$s#$e#Mother... Father...$s",
  "CDE_Leo_Sun4": "Don't be afraid of gorillas if you see them.#$b#Just be nice to them. They will be nice to you.",
  "CDE_Leo_Sun2": "I've seen an old woman on the island's other side. Have you?$3#$e#...I'm shy to her. And scared.$s#$e#I don't think she wants to be friends with birds.$s#$e#But you do.",

  //generic weekday dialogue
  "CDE_Leo_summerMon": "Hm? You ask about my... birthday?$3#$b#Um... what season is this? I don't have a... what is it? A calendar.$3#$e#Oh, this is summer now? It's... summer 26! The parrots told me I hatched on that day."
  
