{ //Linus
  //Linus Gift Tastes
  "CDE_Linus_GoldPumpkin": "Good show, old friend.$h#$e#I saw you from the edge of the maze. Did you see me?",
  "CDE_Linus_Pearl": "Nature is filled with countless beautiful secrets. A pearl may be one of the finest.$h",
  "CDE_Linus_PrismaticShard": "W-why, what a sight!$3#$b#This world we inhabit never ceases to amaze.$3",
  "CDE_Linus_RabbitsFoot": "Rabbits are selfless creatures. We must never take them for granted.#$b#Neither do I take this gift for granted. Thank you.$h",
  "CDE_Linus_BlueberryTart": "*sniff* Mmm, it smells divine. Thank you.$h#$e#I love blueberry tarts, but it's difficult for me to make them over an open fire.",
  "CDE_Linus_CactusFruit": "You traveled far to find this. I miss these succulent fruits.$h#$e#The valley is my home now, but long ago, I spent a little time living in Calico Desert.",
  "CDE_Linus_Coconut": "Wonderful, thank you!$h#$b#As much as I love the valley, there's nothing quite as nourishing as a coconut here.",
  "CDE_Linus_DishotheSea": "Thank you. What a work of wonder you've put on this plate.$h#$e#We must never take the ocean's sacred gifts for granted.",
  "CDE_Linus_Yam": "Ah! I'll roast this over my campfire tonight. I know how to get it just right.$h",

  //Linus's Misc Dialogue
  //these lines target files other than the standard characters/dialogue/Linus location such as unmarried rainy dialogue
  "CDE_Linus_rainy_1": "A warm rain is a pleasant way to get clean.$h",
  "CDE_Linus_rainy_2": "It looks like the rain doesn't bother you much, either.",
  "CDE_Linus_rainy_3": "Nature gives us many blessings.#$b#Even if we don't appreciate them in the moment, we must appreciate them in the grand scheme.",

  //Linus's Standard Dialogue
  //Special Dialogue
    //no repeated dialogue

  //date specific dialogue
  "CDE_Linus_spring1y2": "Breathe in that spring air!$h#$b#The valley is coming to life.$h",
  "CDE_Linus_summer10": "I think I might take a risk tomorrow at the luau and share a little of my cooking.",
  "CDE_Linus_winter15": "I caught a glimpse of the ships docking at the beach, from my view up on the mountain.#$e#Maybe I'll give them a look up close.",
  "CDE_Linus_winter28": "We made it.$h#$e#*chuckle*$h",

  //heart specific dialogue
  "CDE_Linus_summerMon10": "Where did all the trash in the water come from? I don't understand...$s",
  "CDE_Linus_summerTue8": "Marlon and Gil? Yes, I see them every now and then.#$e#We mostly keep to ourselves.",
  "CDE_Linus_summerWed10": "The world existed long before we ever did. And it will continue to exist long after we leave it.#$e#Thinking deeply about this truth has guided the way I live.",
  "CDE_Linus_summerThu10": "I respect what you do on your farm, @. As long as you take care of the ecosystem your farm is a part of, we have nothing to fear.",
  "CDE_Linus_summerSat10": "What is it that mankind ultimately lives for? Comfort? No, it cannot be something so base as that.#$e#I have no single answer for why we are here. Kindness? Harmony? Love? These are the things I desire most.",
  "CDE_Linus_summerSun6": "I once caught a bass in the lake that was longer than my arm.$h#$e#That was a long time ago. I don't know that I'll ever break that record.",

  "CDE_Linus_fallMon8": "I'll admit, I've followed you into the mines before, from a distance.#$e#I'm sorry. I just want to make sure you stay safe...",
  "CDE_Linus_fallTue10": "Hi there, @!$h#$e#Find any good foraging spots today?",
  "CDE_Linus_fallWed8": "The mountain owes us nothing, yet it still gives. Anything we take is an undeserved gift. We must never forget to be thankful.",
  "CDE_Linus_fallFri10": "I've never lived only for myself. I just wish to be in harmony with all parts of nature... the plants and trees, the animals, even the rocks.#$e#Lately, I might have a tiny bias in favor of people over the rest of nature. Perhaps that's only natural.$h",
  "CDE_Linus_fallSat10": "Everyone must discover and understand the role they can best play in the world.#$e#For example, there's just as much nature underground as there is up here.#$b#But if I stay in the mines too long, my lungs get heavy and my eyes long for sunshine. It goes against my nature.#$e#The same could be said for all aspects of life, inside and out.#$b#Have you found your role yet, @?$h",
  "CDE_Linus_fallSun10": "Have you tried fishing with wild bait yet?",

  "CDE_Linus_winterMon8": "I could hide indefinitely from the cold in the hot spring, but that isn't where I live.#$e#I'd rather not step on anyone's toes. The building belongs to the village.",
  "CDE_Linus_winterTue8": "If I play things right, I can go for a week or so without food.#$e#It isn't my first choice, but I can do it if it becomes necessary.",
  "CDE_Linus_winterWed8": "Rasmodius is a good friend. We only run into each other every now and then, but we always pick up where we left off.",
  "CDE_Linus_winterThu8": "The family in that house seemed annoyed by my presence when I first settled here. Lately, though, they seem fine with me.",
  "CDE_Linus_winterFri10": "Is suffering a natural part of a harmonious life? I'm inclined to say yes, though it depends upon the kind of suffering.#$e#Do not be afraid of any discomfort or hardship that is ultimately feasible, @. We are always stronger than we think.",
  "CDE_Linus_winterSat10": "Each day we live is a gift to be cherished with deep gratitude. We already have more than we deserve.",
  "CDE_Linus_winterSun8": "It's important to know that we don't really matter. The world will carry on whether we humans exist or not.",

  "CDE_Linus_Mon8": "Me? Married? Haha, no, I've never been married.$h#$e#I've never demanded that anyone else should conform to my lifestyle.",
  "CDE_Linus_Mon6": "There's nothing like the feeling of making it through another winter with just the gifts of the mountain.$h",
  "CDE_Linus_Mon4": "When berry season arrives, there's more than enough food to go around.#$e#You just have to know how to look for them, and they come in abundance.",
  "CDE_Linus_Mon2": "I found some trash on the ground here. I hope it wasn't you, was it?",
  "CDE_Linus_Tue10": "Well, @, I suppose I could consider you a part of my new family, if that's alright.$h#$e#Oh, please don't be alarmed. The trees, the rocks, the lake, the sky... they are all my family, too.",
  "CDE_Linus_Tue6": "A long time ago, yes, I grew up in a family. I haven't seen them for many years.#$e#I don't think I can even remember their faces anymore...$s",
  "CDE_Linus_Tue2": "Is there something that you want?",
  "CDE_Linus_Wed4": "This land will continue to exist for many eons past our lifetimes.#$b#Please do treat it with respect.",
  "CDE_Linus_Thu10": "There is a beauty in caring for others.#$b#So if I find something delicious and there's enough for two, I'll leave it in your mailbox.$h",
  "CDE_Linus_Thu8": "Sometimes, people don't understand me, but that doesn't make them bad.#$e#It just bothers me when they show hostility.",
  "CDE_Linus_Thu6": "Yes, you saw me taking food from the trash cans that one time...$s#$e#Usually, I just live on the food that nature provides, but the food that others throw out goes to complete waste if I don't take it.$s#$e#Is that any way to treat the world that provides for us?",
  "CDE_Linus_Thu2": "...Maybe I need to pack up my tent and move again.$s",
  "CDE_Linus_Fri8": "Where do we go after we die? I suppose I'll go into the ground.#$e#Just back into the flow of nature, is all.#$e#It doesn't have to be so bad, if you think about it.#$e#I guess I'm not quite ready for that yet, though.$h",
  "CDE_Linus_Fri2": "Why do you keep visiting me?",
  "CDE_Linus_Sat10": "At this rate, I may just stay here indefinitely.$h#$e#I can live in nature as much as I want, but I'm not too far away from at least one good neighbor. Thank you, @.",
  "CDE_Linus_Sat8": "Perhaps I'll stay here another year.#$e#I don't normally stay put in one place for this long, but...$s",
  "CDE_Linus_Sat6": "I don't imagine I'll stay here much longer.#$e#Don't be alarmed if you come up here and my tent is suddenly gone.#$e#That's how I've always done it.",
  "CDE_Linus_Sat2": "...Hello, again.",
  "CDE_Linus_Sun8": "When I first met you, @, I was sure I would be leaving the valley soon. Thank you for helping to change my mind.",
  "CDE_Linus_Sun2": "You don't have to speak to me if you don't want to.", 
//generic weekday dialogue
