{ //Robin
  //Robin Gift Tastes
  "CDE_Robin_GoldPumpkin": "Looks like that haunted maze had quite the prize after all! I can't believe you want me to have it!$h",
  "CDE_Shane_Pearl": "@, are you sure?$h#$b#Thank you. I never expected to have a neighbor who's so generous.",
  "CDE_Robin_PrismaticShard": "This is amazing! It'll make for the most beautiful decoration in one of my upcoming projects!$h",
  "CDE_Robin_RabbitsFoot": "Very nice! By any chance, did this come from your coop?$h",
  "CDE_Robin_GoatCheese": "Ooh, what a treat! I know what I'm having for my next snack!$h",
  "CDE_Robin_Peach": "Well look at this! I always knew you'd wind up growing the very best fruit!$h",
  "CDE_Robin_Spaghetti": "I was just craving this! It's like you read my mind.$h",

  //Robin's Misc Dialogue
  //these lines target files other than the standard characters/dialogue/Robin location such as unmarried rainy dialogue
  "CDE_Robin_rainy_1": "The rain doesn't stop me from getting a job done!$h#$e#Although soggy wood isn't a joy to work with.$s",
  "CDE_Robin_rainy_2": "Your roof isn't leaking, is it? Let me know if it that ever happens.",
  "CDE_Robin_rainy_3": "This weather doesn't bother you too much, does it? Same here.",

  //Robin's Standard Dialogue
  //Special Dialogue

  //date specific dialogue
  "CDE_Robin_spring1y2": "Happy springtime! Hey, now's a good time to let me know of any projects you might have for me.",
  "CDE_Robin_summer27": "I don't think I'll ever get tired of seeing the moonlight jellies with Demetrius.#$e#I hope you can make it, too.",
  "CDE_Robin_fall15": "The Stardew Valley Fair is really something else. I hope you'll put together a grange display for us to see!",
  "CDE_Robin_winter15": "I thought we might head down as a family to that Night Market on one of these nights.#$e#I don't know if I can get Sebastian to go, though...",
  "CDE_Robin_winter28": "Another year down. Another couple decades of this and I'll be old.#$e#I'll keep doing what I'm doing for many years, though.$h",

  //heart specific dialogue
  "CDE_Robin_summerMon10": "How'd I learn to build things so fast? A whole lot of practice, I'd say.#$e#If you set your mind to something, eventually you will become an expert at it.",
  "CDE_Robin_summerTue10": "Have you tried anything creative with note and drum blocks yet?#$e#Remember that you can change the tones on them.",
  "CDE_Robin_summerTue6": "Mmm, I'm craving a ripe peach. Do you have any on your farm?",
  "CDE_Robin_summerWed8": "What? You're worried I work too late on my construction projects? No, I take plenty of breaks throughout the day.#$b#Just not when you're looking, I guess.$h#$e#Besides, it takes a lot of work to build as quickly as I do.",
  "CDE_Robin_summerWed": "I'll work in the direct sun if I need to. Don't worry, I've got some of the heaviest-duty sunscreen you can find.",
  "CDE_Robin_summerThu10": "What's the best crop you've got growing on the farm this summer?#$e#I don't suppose you could bring some by...?$h",
  
  "CDE_Robin_fallMon8": "It was about when Maru became a teenager that I knew she was something else with machines.#$e#As a kid, she would always take apart our electronics, though she couldn't always put them back together.#$e#But eventually, she reached a point where she'd put them back together in her own way, with modifications.#$b#I'm really proud of how advanced she's become.",
  "CDE_Robin_fallMon4": "Has Maru showed you any of her latest projects yet?",
  "CDE_Robin_fallWed10": "It's always an honor to help rebuild your farm. I couldn't have done it without you collecting all those resources.#$e#I appreciate you letting me do it.$h",
  "CDE_Robin_fallThu8": "When things work out for us, it's our duty to help others in need.#$b#Don't you think so, too?",
  "CDE_Robin_fallFri6": "Hardwood is tough to come by, but there's nothing better to work with.#$e#I don't suppose you have any extra lying around, do you?$h",
  "CDE_Robin_fallSun10": "Everyone needs a project to get them out of bed each day and keep going. What's yours right now?",
  
  "CDE_Robin_winterMon8": "I've always had a passion for building things, even when I was a kid.#$e#Sometimes I'd get a \"look\" from others about my hobbies. I just didn't let it bother me.",
  "CDE_Robin_winterMon6": "Do you like your fireplace? Let me know if you ever want to remodel it.#$e#The right fireplace makes the biggest difference in making a room's appearance come together.",
  "CDE_Robin_winterTue10": "My kids have their own interests. I never really pushed either of them into carpentry.#$e#They still seem to enjoy their hands-on activities, though. Maru's got her gadgets and Sebastian's got his motorcycle.",
  "CDE_Robin_winterWed6": "Architecture styles and home fashions might come and go, but they all have one goal in mind: to make a better place to live.#$e#Humanity has always sought a better place to live. It's as old as history itself. So I enjoy the feel of that connection in my work.",
  "CDE_Robin_winterThu10": "With all these cold days, how's your hearth treating you? Need me to restyle it?",
  "CDE_Robin_winterSat8": "As a girl, I remember looking up how to make a real igloo and then putting it together.#$e#It turned out pretty good! I acted as foreman and put a couple of my friends to work.$h",
  "CDE_Robin_winterSun10": "There were a lot of things in this town that have needed fixing, but I wasn't ever able to get started on many of them until you showed up.",
  
  "CDE_Robin_summerSat10+Thu8": "Sometimes, I wonder if Sebastian passively resents me for not having his father around.$s#$e#Maybe he feels like Maru's got it all, and he lives in her shadow...$s",
  "CDE_Robin_summerSun10+Thu6": "I met Demetrius in college while working an apprenticeship and raising Sebastian.#$e#My head still spins when I wonder how we managed to find time for it all!",  
  "CDE_Robin_FallTue10+Wed2": "When we first moved here, we had to rough it out in a trailer until I could get the house finished.#$e#Demetrius had a separate trailer for his lab.",
  "CDE_Robin_FallSat10+Tue6": "Demetrius may be a bit stoic, with his scientific brain, but I learned pretty quickly how to get through to his romantic side.#$e#I did teach him how to dance with me, after all.$h",

  "CDE_Robin_Mon6": "Demetrius's work technically brought us out here. I'd say it's worked out pretty well, though.",
  "CDE_Robin_Mon4": "Nahh, I don't go into the mines all that much. Too dark and dangerous.#$e#Let me know if you find anything neat down there, though.",
  "CDE_Robin_Mon2": "Have I told you that I built our house from the ground up?#$e#It's definitely been the highlight of my career so far.",
  "CDE_Robin_Tue8": "I must say, you've certainly been quite a support for our business since you moved into town.$h",
  "CDE_Robin_Tue4": "Leah's got a good handle on woodworking, too. I just prefer to make things with a little more practical use.",
  "CDE_Robin_Tue2": "There used to be some great buildings on your farm, but they're all gone now.#$e#I'd love to help restore the farm anew. Just let me know what I can do.",
  "CDE_Robin_Wed8": "Sebastian's father? He was a good guy. Things just didn't work out.#$e#We were both very young.",
  "CDE_Robin_Wed4": "Do you have some good furniture for your home yet?#$e#I just can't imagine coming home to a house that I don't love.#$e#Sorry, I mean, whatever works for you though, right?$h",
  "CDE_Robin_Thu10": "@, it's great to see you!$h#$e#Having you as a neighbor has been one of the best things that's happened to us since we moved here.",
  "CDE_Robin_Thu4": "I hear strange electrical noises coming from Maru's room from time to time.#$e#I always wondered whether her interests would take after me or Demetrius. Guess it was a little of both.$h",
  "CDE_Robin_Thu2": "Have you tried reaching out to Sebastian yet?",
  "CDE_Robin_Fri8": "It's strange. I don't feel old enough to be the mother of two adult-aged children.#$e#Life just gets faster and faster as you go, I guess.",
  "CDE_Robin_Fri2": "Sam comes over occasionally to play games with Sebastian. Maybe they'll invite you join them sometime.",
  "CDE_Robin_Sat8": "Out here, I get a little more flexibility to do the projects that interest me.#$e#I don't think I'd get that kind of freedom working in the city.",
  "CDE_Robin_Sat6": "Demetrius is usually laid back about everything, with the exception of anything Maru-related.#$e#That's the one area in which you really have to earn his trust.#$e#Sorry if he's ever said anything standoffish. It's not just you.",
  "CDE_Robin_Sat4": "Ugh, I wish Sebastian wouldn't smoke.$s#$e#I don't even know where he picked that up from.$s",


  //generic weekday dialogue
  "CDE_Robin_summerFri_inlaw_Sebastian": "Has Sebastian been getting outside much lately?#$e#Make sure you two take good care of each other!$h",
  "CDE_Robin_summerFri_inlaw_Maru": "Has Maru been tinkering around with anything neat lately?#$e#Make sure you two take good care of each other!$h",
  "CDE_Robin_winterWed": "I think I need a little me-time. A visit to the hot spring might be in order.#$e#Do you ever go?",
  "CDE_Robin_winterFri_inlaw_Maru": "Is Maru staying cozy over at your place?#$e#Be sure to tell her to visit soon!",
 
  "CDE_Robin_Mon": "Hey there, @.#$e#I was just daydreaming about some new carpentry projects.#$e#Are you doing OK at your place? How's the woodwork in your cottage holding up?",
  "CDE_Robin_Wed": "Hey, how are things going?#$q 604/605/606 Wed_old#Are you settling in okay?#$r 604 0 Wed_604#So far so good.#$r 605 0 Wed_605#I'm alright, just overwhelmed.#$r 604 0 Wed_604#This place is refreshing.#$r 606 -10 Wed_606#This place sucks. Why am I here?",
  "CDE_Robin_Wed_old": "$p 006#I hope things are starting to get better.|Be sure to drop in anytime.",
  "CDE_Robin_Wed_604": "I'm glad to hear it. Let me know if you need anything.$h",
  "CDE_Robin_Wed_605": "Hang in there. It'll get better.#$b#Remember, we didn't even have a house when we first moved out here. I'm sure you'll land on your feet soon, too.",
  "CDE_Robin_Wed_606": "Oh gosh, I didn't realize it was that bad.$s#$b#Thank you for being honest. Please know you're never alone here. We're all on your side.",
  "CDE_Robin_Fri_inlaw_Maru": "I did think you and Maru would get along well. It really makes me happy to see the two of you together.",
}