{ //Sandy

  // Gift Tastes
  "CDE_Sandy_RockCandy": "A little sweet from my sweetie! Aren't you just the nicest? <$h",
  "CDE_Sandy_Pearl": "*gasp* No! You didn't!#$b#You did? You brought me a pearl? Just because?$h#$b#Sweetie. I don't know what to say.",
  "CDE_Sandy_PrismaticShard": "Now isn't that the prettiest? I could make the best earrings ever with this!$h",
  "CDE_Sandy_RabbitsFoot": "Oh, that's nice! <$h#$b#Did this come from your farm? It's awfully generous.",
  "CDE_Sandy_MangoStickyRice": "*gasp* You're the sweetest, sweetie! <$h#$b#These tropical flavors take me far, far away from this dull desert.",

  //Sandy's Misc Dialogue
  //these lines target files other than the standard characters/dialogue/Sandy location such as unmarried rainy dialogue
  "CDE_Sandy_rainy_1": "I heard it's raining back home. Is that why you came here?$h#$e#I kind of miss the rain, actually...$s",
  "CDE_Sandy_rainy_2": "I do sometimes wonder how anything manages to grow out here without rain.#$e#Just a miracle of nature, it seems.",
  "CDE_Sandy_rainy_3": "Helloooo~ What a surprise to see you!$h#$e#It's been awfully quiet out here today.",

  //Sandy's Standard Dialogue

  //Special Dialogue

  //festival related dialogue

  //date specific dialogue
  "CDE_Sandy_spring13":"Wheee! ~ The desert festival starts next week!$h#$e#Things are about to get lively around here!$h",

  //heart specific dialogue
  "CDE_Sandy_Mon10":"Hey honey! Made any of that tom kha soup lately? I don't think I'll ever get tired of the flavor.#$e#Grab a coconut before you go, if you see one.",  
  "CDE_Sandy_Mon6":"I got lunch with Emily not too long ago! It was so great to catch up with her.$h#$e#We talked for a bit about you, actually. All good things, I promise!$h",
  "CDE_Sandy_Mon2":"You made it out here again! I'm so glad.$h#$e#What's new in the valley?",
  "CDE_Sandy_Tue10":"Well gosh! How many times have you ridden that bus out here now?#$e#Hey, I appreciate every visit.",
  "CDE_Sandy_Tue8":"Hi!~ Stay as long as you like.#$e#The air conditioning sure feels nice, doesn't it?",  
  "CDE_Sandy_Tue2":"That skeleton out back is a 'sand dragon.' As a kid, did you love dinosaurs, too?#$e#Sometimes, tourists will stop to take pictures.",
  "CDE_Sandy_Wed10":"Hey, it's @! I'm glad to see you, kid. I was starting to think you'd never come back!#$e#If I didn't have this shop to run I'd come back to the valley with you for a day or two... just you and me on the old farm.$s#$e#You'll just have to visit me more often so I don't get depressed.$h",
  "CDE_Sandy_Wed8":"Isn't it expensive, coming to the desert so often like you do?#$e#You must really like to see me, huh? Hmmm...$h",
  "CDE_Sandy_Wed6":"I see all sorts of folks out here. Sometimes, they're on road trips or they work in shipping.#$e#But most regular customers just head for the back room.",
  "CDE_Sandy_Wed2":"Hey there, sweetie!$h#$e#How's Emily doing? I hope Haley's not too much of a handful.",
  "CDE_Sandy_Thu8":"I know it doesn't look like it, but business has been decent lately.#$e#Part of it's thanks to you. Cost of living out here is dirt cheap, so just a simple seed purchase goes a long way!$h",
  "CDE_Sandy_Thu4":"Hey... I think I can trust you. You can keep a secret, right?#$b#*whisper* That guy in the back... it's some kind of exclusive club. I've never been inside myself, but they pay me a generous monthly rent so I don't ask any questions.#$e#SOOOOoo! How's that Stardew Valley weather right now?",
  "CDE_Sandy_Fri8":"Hey there! How's the farm, sweetie?#$e#I'm guessing things must be in good shape if you're able to spare the time to trek out here.#$e#It's always a treat to see you.$h",
  "CDE_Sandy_Fri4":"Well look who's here! How you been?#$e#I just got done reading the best book. 'Marcie and the Underground Castle.' Definitely worth the read, if you've got time.",
  "CDE_Sandy_Fri2":"I think the thing I miss most about the valley is the wild flowers. Just a lotta good memories that go with them.#$e#Bring some by if you find any, okay, sweetie?",
  "CDE_Sandy_Sat10":"Hey @. It's free sample day! Enjoy. [218]",
  "CDE_Sandy_Sat4":"You look really thirsty. Here, have a taste of this ice cold milk. [184]#$e#Tasty, huh?$h",
  "CDE_Sandy_Sat2":"The cavern north of here is best worth avoiding.$s#$e#I peeked inside once. There's this door? ...and *shiver* Ugh, never again.#$b#Never. Again.$s",
  "CDE_Sandy_Sun10":"The cavern? Look, if you've been in there, I don't wanna know.$s#$e#I trust you'd stay safe if you did, though, huh?",
  "CDE_Sandy_Sun2":"Hi there, honey. Yep, it's just me, alone in this big old shop. Hmmm...#$e#Well, except for that creepy guy in the back. But he never moves a muscle, so I often forget about him.",
  "CDE_Sandy_summerMon10":"Are my roots showing? My hairdresser canceled on me again.$s#$e#*sigh* It's such a long journey into the city, too, I can't just reschedule for the next day.$s",
  "CDE_Sandy_summerTue10":"How's the desert trader's camel doing? Is she up for some pets?",
  "CDE_Sandy_summerWed8":"I heard there used to be Pepper Rexes wandering this desert in packs, long ago. Imagine that!",
  "CDE_Sandy_summerWed6":"Next year's desert festival is so far away... *sigh*$s#$e#Better get used to some lonely months.$s",
  "CDE_Sandy_summerWed4":"I saw a hot air balloon soaring through the sky the other week. Who d'you suppose was up there?$h",
  "CDE_Sandy_summerWed2":"I've heard stories about a pot of gold at the end of a rainbow.#$b#I'd love it if I even got to see a rainbow in the first place!",
  "CDE_Sandy_summerThu10":"If you see Emily, be sure to let her know that I'm free to meet up with her at the time she mentioned.",
  "CDE_Sandy_summerFri6":"The desert trader came in and looked around for a bit the other day. She didn't say much. Didn't buy anything, either.#$e#What a mysterious person. I wonder what her real life is like?",
  "CDE_Sandy_summerSun10":"Ohhh! I just got the cutest shirt in stock! Want to try it on?$h",
  "CDE_Sandy_fallWed10":"Good thing you showed up! I haven't had a customer all day!#$e#...as expected.$s",
  "CDE_Sandy_fallThu10":"Well hellooooooo ~ What brings you to the desert today?#$e#Treasure hunting? Coconut foraging? ...Meeeeee? <$h#$e#Haha, just kidding.",
  "CDE_Sandy_fal_Fri4":"Seems like that desert trader usually knows how to predict when you'll show up.#$b#Then she heads home just as soon as you leave. Can she predict the future or something?#$e#Wish I could do that...",
  "CDE_Sandy_winterFri6":"At least it's a little cooler here in the winter. That sun sure doesn't let up, though.",
  "CDE_Sandy_winterSat10":"Do you go fishing in that pond across the street?#$e#I've seen those fish. I can't imagine eating something like that! Blech.",
  "CDE_Sandy_winterSun10":"What do you think about having a store cat who lives here?#$e#The owner of the building would definitely say no, I'm sure, but I think a cat would love living in the desert.#$e#There's even a mysterious cat totem a stone's throw from here. You've seen it, yeah?",

  "CDE_Sandy_repeated_1":"Emily's got a real knack for reading people. It's like she's on a different wavelength, or something.#$e#She can't help but treat everyone with equal respect, though, no matter how the other person acts. I admire that.",
  "CDE_Sandy_repeated_2":"One time, a couple literally camped out here for their honeymoon. Whatever floats their boat, right?",
  "CDE_Sandy_repeated_3":"I complain about the heat nonstop, but nothing can really beat the coolness of the desert when the sun goes down.#$e#The way a desert sunset looks is hard to beat, too.",
  "CDE_Sandy_repeated_4":"My name's not really Sandy, you know. It's just good for business.#$e#But everyone calls me Sandy anyway, so I've just gotten used to it.",
  "CDE_Sandy_repeated_5":"Those antenna-like structures northeast of here? No idea.#$e#Apparently, they were featured on an old episode of 'Mysteries of the Unknown.'#$e#They must have been built there for some reason, anyway!",
  "CDE_Sandy_repeated_6":"I listen to the radio sometimes. After you hear the same pop song twice an hour for a month, though, it's tough to keep it going.$s",
  "CDE_Sandy_repeated_7":"@! Come on in. I've got a treat for you. [233]#$e#I figured you'd love it.$h",
  "CDE_Sandy_repeated_8":"I took a trip to Zuzu City last month. Can't miss out on living it up at the clubs every once in a while!$h#$e#I don't waste a second. I stay out all night.#$e#There are college kids who can't even keep up with me! Heehee!$h",  
  "CDE_Sandy_repeated_9":"I guess I've seen at least one guy from the back room who occasionally heads up north.#$e#I wonder if he's headed for that freakish cavern?$s",
  "CDE_Sandy_repeated_10":"I floated around in the valley for a few years. Wish I could live there, but it's pretty hard to find reliable work.#$e#So that's how I wound up here!",
  //Mon8+winterWed10
  //Mon4+winterTue10
  //Tue6+summerSat10
  //Tue4+winterMon10
  //Thu6+fallSun10
  //Fri6+summerWed10
  //Sat8+winterThu10
  /Sun8+fallMon10
  /Sun6+fallTue10
  //Sun4+fallSat10

  //generic weekday dialogue
  "CDE_Sandy_Fri":"That trader with the camel comes through here pretty often. I don't know how she expects to do any business, though.#$e#Hey, I speak from experience. It's tough out here.",
  "CDE_Sandy_Sat":"Hi! Welcome to Sandy's Oasis, the number one destination in Calico Desert!#$e#*whisper* Did I sound professional?$h#$e#Make sure to check out our seasonal seed selection.",
  "CDE_Sandy_summerWed":"*sigh*... I do miss the beautiful flowers of Stardew Valley...$s",
  "CDE_Sandy_fallFri":"You wouldn't have much luck farming out here, honey.#$e#Well, unless you were a cactus farmer.$h",
  "CDE_Sandy_winterFri":"I can't believe there's snow right now where you live.#$e#Oh well. Sand is kind of like snow. It'll have to do for me.",
}
