//NPC Dialogue
{
  //Willy Gift Tastes
  "CDE_Willy_GoldPumpkin": "I do love a good pumpkin, but this one's golden? Har har! What'll ye find next?$h",
  "CDE_Willy_Pearl": "If a mermaid sees me holdin' this, I reckon I'll be pretty popular! Har har!$h",
  "CDE_Willy_PrismaticShard": "Now THAT'S a treasure, lad!$h^Now THAT'S a treasure, miss!$h#$b#Supposin' I get picked up by pirates, this stone'll make a hearty ransom for my life, and then some!",
  "CDE_Willy_RabbitsFoot": "Thanks indeed. I can always use a little more luck when I go fishing.$h",
  "CDE_Willy_Catfish": "Aye, this'll make a fine meal. One o' the finest!$h#$b#Thanks, lad.$h^Thanks, miss.$h",
  "CDE_Willy_Diamond": "Come to share yer treasures with me? What a kind soul you are!$h",
  "CDE_Willy_IridiumBar": "Well I'll be! I could make a new iridium rod with this.$h",
  "CDE_Willy_Mead": "This was always ol' Pappy's favorite. My favorite now, too. Thanks, lad.$h^This was always ol' Pappy's favorite. My favorite now, too. Thanks, miss.$h",
  "CDE_Willy_Squid": "What a battle this one must've been! Aye, look at those arms wriggle!$h",
  "CDE_Willy_Pumpkin": "Ahh, the smell o' fresh pumpkin with the smell o' my old shack... It doesn't get much better than that.$h",
  "CDE_Willy_SeaCucumber": "Ah, a lad of sophisticated tastes, I see!$h^Ah, a lass of sophisticated tastes, I see!$h#$b#Sea cucumber is one o' the tastiest creatures in the sea, but it takes a bit o' practice to enjoy.",
  "CDE_Willy_Sturgeon": "Why, this one looks fit for a royal feast! What a lunker!$h",

  //Willy's Misc Dialogue
  //Willy has no rainy day dialogue, not in my mod nor in the base game.

  //date specific dialogue
  "CDE_Willy_spring1": "Ahoy there! A happy new year to you, too!$h#$e#I'm surprised you found time to visit me. Today's such a busy day for your farm, right?$h",
  "CDE_Willy_summer4": "Looks like tuna have shown up off the coast of our beach. Be sure to stock up on 'em. They'll be gone again until winter.",
  "CDE_Willy_winter7": "Will you go ice fishing tomorrow at the festival? I don't even care whether I win these days. I just like to see more folks fishing.$h",
  "CDE_Willy_winter15": "I think I'll be needin' some peace and quiet from the night market after these next few days.#$e#I'll just have to manage until then.",
  "CDE_Willy_winter28": "Another year down. The passage of time is a beautiful thing if you can learn to appreciate it.",

  //heart specific dialogue
  "CDE_Willy_Mon8": "I'll post some more fishing challenges on Pierre's bulletin board if the mood fancies me. I hope you'll keep an eye out for 'em.",
  "CDE_Willy_Mon6": "If you sell me some fish, I'll be sure to tell whoever buys it that you're the one who caught it.$h",
  "CDE_Willy_Mon2": "Ahoy there, son.^Ahoy there, lass.#$b#Looks like decent weather for fishing, eh?",
  "CDE_Willy_Tue8": "I'm happy that I entrusted you with my old rod, @, back when we first met. You've been a good friend.$h",
  "CDE_Willy_Tue4": "To take the life of a fish, you have to respect it first. You certainly won't last long in this profession, otherwise.",
  "CDE_Willy_Wed8": "I've never been married, no.#$e#I loved someone once, long ago. She left me for another man.#$e#Sometimes, the one that gets away, stays away forever.$s",
  "CDE_Willy_Wed4": "Have I ever been lost at sea? No. Never.#$b#I always take the appropriate precautions. If you know what you're doing, you never compromise your safety.",
  "CDE_Willy_Wed2": "The waves are pretty calm at our beach. That's the only way I can manage to have my shop out on the dock itself.",
  "CDE_Willy_Thu8": "My biggest catch ever was from when I was young, like you.#$b#Who knows, though? It's still possible that I could outdo myself.$h",
  "CDE_Willy_Thu6": "There's rumors of some very rare fish in these parts... but only an experienced angler could stand a chance against them.#$e#You'll need the finest bait you can get if you want a rare fish to bite.",
  "CDE_Willy_Thu2": "It never ceases to amaze me how much trash winds up in the water.$s#$e#It's up to us to take care of it. Preferably, it should be recycled.",
  "CDE_Willy_Fri8": "We can all agree that fishing'll teach you patience. I can't think of a better skill to practice.#$b#Life itself is a waiting game. And then it ends. I pity anyone who never learns how to wait properly.",
  "CDE_Willy_Fri6": "Made any good chowder yet?$h#$e#It's an old classic.$h",
  "CDE_Willy_Fri2": "If you really want to get the fish biting, make sure you put some bait on your hook.",
  "CDE_Willy_Sat6": "When you're waiting for a bite, listening to a bit of music on the radio is a great way to pass the time.#$b#Our ancestors had no such luxuries, though. So sometimes I cut the music and listen to the sounds of nature, out of admiration for the old ways.",
  "CDE_Willy_Sat2": "I've learned some good fish recipes over the years. Maybe I'll share some with you sometime.",
  "CDE_Willy_Sun8": "My old neighbor passed away some years ago and entrusted his home to me.#$b#I'm glad Elliott was able to purchase it and move in. He's been a good neighbor.",
  "CDE_Willy_Sun6": "I'm sorry I don't ask enough about your farming. How is that going along?",
  "CDE_Willy_Sun4": "Sometimes, I reel in a little sunken treasure. I've found some pretty amazing things over the years.#$e#I hope you find some interesting treasures, too!",

  "CDE_Willy_springFri8": "If you catch a really common fish, it's actually more profitable to clean it and cut it yourself.#$e#That's if you're sellin' elsewhere. Me, I only buy whole fish.",
  "CDE_Willy_springFri2": "Catfish will only bite when it's raining. You can catch 'em in fresh water in the spring and fall.#$e#Just thought I'd mention it. Catfish is one o' my favorites.$h",

  "CDE_Willy_summerMon10": "The islands south of us sure are some beauties, with Ginger Island bein' the best one, I think.",
  "CDE_Willy_summerTue10": "If ya listen closely to the fish, they'll tell ya what they want.#$e#Some o' them are li'l prima donnas, heh! I'm thinking those sturgeons have some delusions of grandeur.$h",
  "CDE_Willy_summerWed10": "Lately, I've been wonderin' if I've taken too much from the ocean. What could I give back to it? I owe it my entire livelihood.$s",
  "CDE_Willy_summerWed2": "That carpenter Robin'll build you a fish pond, mmm? That could work. Just make sure you treat those fish extra well.#$e#Some of 'em just need the wild ocean, or the streams, y'know? Not all fish live in ponds for a reason.",
  "CDE_Willy_summerThu6": "If you're fishing for tilapia this summer, make sure you do it in the morning.#$e#Sometimes, they'll show up in the early afternoon, but it's not too often.",
  "CDE_Willy_summerThu2": "It's rainbow trout season.#$b#And this is the only season when you can get 'em. Be sure to stock up if you like cooking with them.",
  "CDE_Willy_summerFri4": "If you ever catch a lobster in a crab pot, be sure to share some with Elliott. It's his favorite.",
  "CDE_Willy_summerSat10": "I woke up early this mornin' because there was a big ol' crab pinchin' my toe.$s#$e#Oh, I'm alright. He'll make a good dinner.$h",
  "CDE_Willy_summerSun10": "Keep an eye on the tide pools this season, 'specially after it rains.#$e#Those waves bring a lot to shore. You'll see what I mean.$h",

  "CDE_Willy_fallMon2": "The walleye is one o' the rarest fish you'll find in these parts. Try casting a line in fresh water when it rains this season.",
  "CDE_Willy_fallTue10": "Y'know, I'm comin' 'round to the idea of farm-raised fish. If anyone's gonna be listenin' to the fish and what they want, it'd be you, hmm?",
  "CDE_Willy_fallWed10": "*sniff sniff* Could be time for a wash. My clothes're all crusty.$s",
  "CDE_Willy_fallFri6": "A lot o' salmon have come swimming upstream. Be sure to catch 'em while they're here.#$e#You can only find salmon in the fall.",
  "CDE_Willy_fallFri2": "When it rains this month, be sure to catch some eels in the ocean. Otherwise, you'll have to wait until spring.",
  "CDE_Willy_fallSun10": "How's the mountain lake doing? I don't hike up there much anymore...",

  "CDE_Willy_winterTue8": "I guess I've gotta be thankful for farm-raised fish.#$b#If everyone ate nothin' but the good stuff I like to catch, we'd just about fish this whole ocean right up.",
  "CDE_Willy_winterWed10": "I've not been to Prairie Island in some time now. That was when I was much younger.#$e#I think I've seen some Prairie Island folks at the night market.",
  "CDE_Willy_winterThu10": "I wonder how Clint's doing.#$e#We see each other at the saloon all the time but we never get to talking much.",
  "CDE_Willy_winterSat10": "Ooh, I just don't have the strength I once had.#$b#But it's still plenty enough. Don't you worry about me.$h",
  "CDE_Willy_winterSun10": "Seein' the children in town always brings a smile to my face.$h",

  "CDE_Willy_fallThu10+Sat4": "If you see me out fishing, you just come on up beside me and cast your line, too.#$b#You're always welcome to.$h",
  "CDE_Willy_fallSat10+Tue2": "There are two worlds: the one we live in, and the much, much older one beneath the water.#$e#I think of what I do as a dialogue between those two worlds.",
  "CDE_Willy_winterMon10+Thu4": "Sometimes I can find someone who'll play checkers with me at the Saloon.#$e#It's important to have a little human contact every now and then, no matter how comfortable I can be by myself.",
  "CDE_Willy_summerWed6+winterWed6": "Remember, anywhere there's water, there's likely to be fish.#$b#You get out a little more than I do, so I hope you find some exotic varieties.$h#$e#Just don't bring it to me if it's a bit TOO exotic, though.$s",

  //generic weekday dialogue
  "CDE_Willy_winterTue": "Ye really can't beat wild-caught fish when it comes to taste. And nutrition.#$b#People who live too far inland don't really know what they're missin'.#$e#If they eat farm-raised fish, it's like a whole different food.",
  "CDE_Willy_Mon": "Any progress with fishing yet? Stick with it. It'll get easier with time.",
  "CDE_Willy_Fri": "How's your rod holding up?",
}