{ //LeoMainland

  //LeoMainland Gift Tastes
  "CDE_LeoMainland_RockCandy": "*lick* It's sweet! What a yummy treat!$h#$b#...$u#$b#That rhymed!$h",
  "CDE_LeoMainland_Pearl": "I-is this your treasure? The parrots told me of these, but I never found any.$u#$b#Thank you!$h",
  "CDE_LeoMainland_PrismaticShard": "S-so nice! With this in my hand, I don't feel shy of anything!$h",
  "CDE_LeoMainland_RabbitsFoot": "Ahh, it's nice and soft. I like it very much.",
  "CDE_LeoMainland_ParrotEgg": "This is a precious egg... A baby! I'm glad you brought it to me, I'll keep it safe.",
  "CDE_LeoMainland_DuckFeather": "So soft, so pretty... You are saying I may have this?#$b#Thank you!$h",
  "CDE_LeoMainland_Mango": "Ah! A mango! Yes, this is what I love!$h",
  "CDE_LeoMainland_OstrichEgg": "An ostrich egg! The parrots say ostrich is king of the birds. Did you know?#$e#I will keep it safe until it hatches, and then I will find it a home.",
  "CDE_LeoMainland_Poi": "You made the special meal, just like the parrots taught me!$h#$e#*slurp* Mmm, it's just like they make it.",
  
  //LeoMainland's Misc Dialogue
  //these lines target files other than the standard characters/dialogue/LeoMainland location such as unmarried rainy dialogue
  "CDE_LeoMainland_rainy_1": "The valley is peaceful when it rains.#$e#To me... nature is someone I know, with different moods.",
  "CDE_LeoMainland_rainy_2": "I can get myself clean today.$h",
  "CDE_LeoMainland_rainy_3": "The rain is a bit chilly, but I will be okay.",

  //LeoMainland's Standard Dialogue

  //Special Dialogue

  //festival related dialogue

  //date specific dialogue
  "CDE_LeoMainland_spring1": "Ahh, I slept well last night. Are you ready for a new year?#$e#I'm excited to see the valley tomorrow when I get back.",
  "CDE_LeoMainland_winter28": "It's a new year tomorrow, right? Willy said the snow might be melted by the time I get back to the valley.#$e#Not much changes around here, though. I used to forget sometimes.",

  //heart specific dialogue
  "CDE_LeoMainland_Mon10": "It's funny... I'm happy to be visiting here on the island, but I also miss my new home a little.#$e#I wonder what everyone's doing in Stardew Valley.",
  "CDE_LeoMainland_Mon8": "I finally talked to the old lady! You know? The one who fishes?#$b#It turns out, her name? It's Birdie! Haha!$h#$e#I should not have been so shy of her. She's very nice, actually.",
  "CDE_LeoMainland_Tue8": "I really like reading. If only I'd had some books when I lived on Ginger Island...#$e#Miss Penny found me a book about birds from all over the world. There are so many different kinds I never knew about!",
  "CDE_LeoMainland_Wed10": "So many things that Vincent eats for lunch come out of... plastic boxes. Are they really food?",
  "CDE_LeoMainland_Wed8": "When the trains come through behind my treehouse, the noise scared me the first time, but not anymore.#$e#They're loud but so exciting! Where do you think they go?",
  "CDE_LeoMainland_Fri10": "I think I'm growing big and strong. I'm eating a lot more these days, and I can run faster and jump higher than I used to.",
  "CDE_LeoMainland_Sat8": "Ahhhh... me and Willy are going to get up extra early tomorrow to visit Ginger Island.#$b#I can't wait to tell the parrots about all my adventures this week!$h",
  "CDE_LeoMainland_Sun8": "I caught a fish off the side of Willy's boat early this morning.$h#$e#It was just a little one. I threw him back to his home.",
  "CDE_LeoMainland_summer_Mon8":"Vincent said he wants to move to my hut here on Ginger Island.$h#$e#His mother won't let him. Haha, maybe someday.",			
  "CDE_LeoMainland_summer_Tue10":"I wonder if there are others like me... living on islands of their own. What if they're all alone?$u#$e#I was never alone, but I understand now that things weren't the way they should have been.$u",
  "CDE_LeoMainland_summer_Fri10":"A lot of people are talking about their week-end. I get what it is, but why is it such a big deal?",
  "CDE_LeoMainland_summer_Sat10": "At first, I thought there was no more room in my heart for more family...#$b#...but it turns out there's plenty more room! You, Uncle Linus, Willy, everyone.,,$h#$e#I have two families now.",
  "CDE_LeoMainland_fall_Thu10":"My socks are wet. Used to be... I'd dry my feet in the hot sand. What do I do now?$u",
  "CDE_LeoMainland_fall_Sat10":"Even the fish in the valley change from season to season. It's so interesting.#$b#On the island, they are always the same.",
  "CDE_LeoMainland_winter_Wed10": "The cold isn't so bad if you have a campfire. Uncle Linus taught me.",
  "CDE_LeoMainland_winter_Sun8": "Ahhhh, it's nice to take a break from the cold in the Stardew Valley.#$e#Still, it'll be fun when I can get back and play in the snow.",

  //generic weekday dialogue
  "fall_Tue": "I took a bath at the hot spring! It feels so good to get all clean.$h",
  "fall_Wed": "The leaves! They're so beautiful!#$e#Why don't the trees change color on Ginger Island?",
  "winter_Wed": "So... c-c-cold.$3#$e#Uncle Linus says I'll get used to it.$3",
  