{ //Sam

  //Sam Gift Tastes
  "CDE_Sam_GoldPumpkin": "Seriously? Isn't this your prize from the maze?$h#$b#I'm speechless. Thanks!",
  "CDE_Sam_RockCandy": "Alright! Sugar rush, here we come!$h",
  "CDE_Sam_Pearl": "This looks ultra rare. Where'd you find it?$10",
  "CDE_Sam_RabbitsFoot": "Nice! I can hang this on my guitar case. Thanks!$h",
  "CDE_Sam_CactusFruit":"Awesome! These are SO refreshing.$h",
  "CDE_Sam_MapleBar":"Oh, those are so good! And you're giving me one?$8#$b#Dude, you rock.$h^Oh my gosh, you rock.$h",
  "CDE_Sam_Tigerseye":"This stone is rad! Something about it just makes me want to rise up and rock out.",

  //Sam's Misc Dialogue
  //these lines target files other than the standard characters/dialogue/Sam location such as unmarried rainy dialogue
  "CDE_Sam_rainy_1": "Rain muffles sound, so I can play my guitar louder without my Mom getting mad. Hehe.$h",
  "CDE_Sam_rainy_2": "It feels kinda badass to walk through the rain without letting it faze you.",
  "CDE_Sam_rainy_3": "Am I gonna let a day like this dampen my spirits? Nahh.#$e#There's always something fun going on if you look for it.",

  //Sam's Standard Dialogue

  //Special Dialogue

  //festival related dialogue

  //date specific dialogue

  "CDE_Sam_spring1":"Hey @, pretty amazing start to the year, isn't it? I thought last year would never end.$h#$e#Thanks for stopping by.",
  "CDE_Sam_spring12":"My little brother gets so excited for festivals. He's been talking about tomorrow's egg hunt all day.",
  "CDE_Sam_spring21":"Sometimes those spring petals that float around make my nose drip.$s#$e#I like summer best, myself.",
  "CDE_Sam_spring23":"Why couldn't the flower dance be today so I could get work off?$s",
  "CDE_Sam_summer10":"I don't have to work tomorrow! I've never been so happy.$h",
  "CDE_Sam_fall7":"The first week of fall is already over. Man, that went by fast.$s#$e#Whatever. I'm just happy that you came to visit me!#$e#So do you have anything new to tell me?",
  "CDE_Sam_fall9":"I ordered a new pair of shoes online. They're the same style so I know they'll fit right.",
  "CDE_Sam_fall16":"I ordered some shoes online more than a week ago! Man, they're really taking a long time.#$e#I guess we must really live in the middle of nowhere.$s",
  "CDE_Sam_fall23":"Ah, my feet feel great in these new shoes. They're a little crisp, but they'll break in. Especially after I run through the haunted maze this weekend.$h",
  "CDE_Sam_fall26":"Tonight, after everyone is asleep, that weird old man who lives in the woods will set up the haunted maze. He always makes sure no one is around to see him working.",
  "CDE_Sam_winter7":"One time, Gus fell in the river during the Ice Festival. We had to build a huge fire in the saloon to dry him out.#$e#We were all worried we'd never taste his famous spaghetti ever again.",
  "CDE_Sam_winter24":"The Feast of the Winter Star is supposed to be a time to show gratitude for all the good things in life.#$b#Me? I'm mostly interested in the food. Hehe.$h",
  "CDE_Sam_winter28y1":"I've got a strange feeling about tonight. Something big is about to happen.#$e#I just hope it's a good something.",
  "CDE_Sam_winter28":"Guess I'll stay up late with Vincent tonight. I figure there's only a limited number of times he'll want to do that.",

  //heart specific dialogue

  "CDE_Sam_Mon4":"I got into skateboarding when I was a little kid.#$e#It's rewarding to do the same hobby as an adult, though. You really end up viewing it in a whole new light.",
  "CDE_Sam_Tue8":"Sometimes I look at other people and notice how everyone changes. Some people I grew up with just aren't the same.#$e#It sucks to have to leave behind those parts of your childhood. Why does everyone settle for it?",
  "CDE_Sam_Tue4y1":"Mom's always worried about Vincent. Personally, I think he'll turn out fine.#$e#I mean, did she forget about what I was like at that age, or something?$h",
  "CDE_Sam_Tue4":"I tried fixing a bowl of cereal for my dad, but as soon as I poured milk on it, he flipped out. What was up with that?$s",
  "CDE_Sam_Tue2y1":"Hey, @.#$e#So, do you play any video games?",
  "CDE_Sam_Thu8y1":"I'm amazed we've made friends with each other as quickly as we have! You are seriously the best person ever, @!",
  "CDE_Sam_Thu8":"Hey, if you get to talking with my dad, just uh... show him some support, if it's not too much to ask.#$e#He doesn't really like talking about himself around me, so maybe it's easier if you're not as close?$s",
  "CDE_Sam_Thu4y1":"I think my Dad might be coming back in a year or so.#$e#I guess you might be able to meet him, then. If you're still living here.#$e#You wouldn't abandon the farm after putting so much effort into it!",
  "CDE_Sam_Thu4":"...I have mixed feelings about my father being back. He seems strange.$s#$b#But I guess I haven't seen him in 3 years... so that could explain it.",
  "CDE_Sam_Thu2":"Well, my Dad is back. You've met him, right?#$b#I'm just glad he's okay.",
  "CDE_Sam_Fri10":"The older I get the more attached I feel to the valley.#$b#Although I could be biased... for a certain reason.$l#$e#So, how are you doing today?$h",
  "CDE_Sam_Fri2":"I miss the city sometimes, but if I moved there again, I'd end up working around the clock just to get by.#$e#I wonder which is more worth it?",
  "CDE_Sam_Sat8y1+Sat6":"Abby came up with a cool drum solo. I just have to figure out how to incorporate it into one of our songs.#$e#I didn't think too much of Abby when I was younger, but it turns out she's really creative.",
  "CDE_Sam_Sat8":"Having my dad back has been... even more different than I expected.$s#$e#I just don't know I'm supposed to act around him. Like, am I a kid again or am I a man?$s",
  "CDE_Sam_Sat4":"Oh! I just remembered I'm supposed to call my Grandma. Okay, I'm going to put this rubber band on my wrist so I don't forget.#$e#I have to make little reminders for myself or else I'll totally forget to do things.$h",
  "CDE_Sam_Sat2":"I picked up guitar just a few years ago. It came to me pretty naturally.#$e#I've still had to practice a lot, though. There's 'good,' but then there's 'actually good,' y'know?$h",
  "CDE_Sam_Sun8":"Sometimes I wonder if my mother is actually happy with her life...$s#$e#I asked her once and got the feeling she was hiding some inner pain.",
  "CDE_Sam_Sun4":"I've been experimenting with an effects pedal. It's a lot of fun, but we'll see if I can find a place for it in our band's music.#$e#If you create a sound that's just gimmicky, it ends up sounding cheesy. High risk, high reward, I guess.",
  "CDE_Sam_Sun2":"If I head outside, sometimes I start getting ideas for lyrics just popping into my head.#$e#You must like working outside a lot, huh?",
  "CDE_Sam_summerMon10":"Getting to play in Zuzu City was a dream come true, but I feel like I've gotten that out of my system.#$e#My thoughts have been moving onto other things, lately.$l",
  "CDE_Sam_summerMon":"There's a little less pollen in the summer... my nose is really happy.",
  "CDE_Sam_summerTue10":"Maybe I should learn how to cook#$b#You wouldn't mind being my taste tester, right?$h#$e#I dunno, I just thought it might be something you'd like.$l",
  "CDE_Sam_summerTue6":"Hmm, tomorrow morning should be a pancake day.#$e#I bet Vince would really like that.",
  "CDE_Sam_summerWed6":"$d Joja#Another shift at JojaMart today. Yay, another few hours of my life wasted.$s|If I work quickly, Gunther sometimes lets me off my shift early. Morris never would've let that slide.",
  "CDE_Sam_summerThu6y1":"@, thanks for reaching out to me like you have. Things have been tough lately with my dad being gone.$s#$e#No news is good news, right? Gotta stay positive.",
  "CDE_Sam_summerThu6":"Sometimes I can hear my Dad pacing down the hallway at night.$s#$b#...But he won't tell us what's troubling him.",
  "CDE_Sam_summerThu4":"Sebastian has some pretty cool board games.#$b#A long time ago, I wasn't into board games, but he knows how to make them fun.$h",
  "CDE_Sam_summerFri10":"I've been writing a song lately.#$e#It's uh... it's about you.#$e#Hey, c'mon, don't laugh!",
  "CDE_Sam_summerFri6":"I was homesick a lot when we first moved here, but that was ages ago.#$e#This is really the only home Vince has ever known. Seeing him fit in makes it easier for me, too.",
  "CDE_Sam_summerFri4":"Oh man. I ate an entire large pizza at like... eleven last night.#$e#I just opened the fridge, and I was like, 'jackpot'!#$e#...Haha, nope, I feel fine.$h",
  "CDE_Sam_summerSun10":"You know, I don't think I miss my old home anymore. It's fun to do a gig in Zuzu City, but I don't really have any urge to actually live there again.",
  "CDE_Sam_summerSun8":"Ever notice how there are a ton of single old dudes in Pelican Town?$s#$e#It's just kinda weird, don't you think?$s",  
  "CDE_Sam_summerSun6":"Hoo. I could go for some donuts right now.#$e#It doesn't matter what time of day it is. It's always donut time.",
  "CDE_Sam_summerSun4":"Booyah! I got another set of lyrics cranked out last night!$h#$e#I'm on fire lately. Still lots of work to do, though, before we're ready to play live.",
  "CDE_Sam_summerSun2":"Hey, having a good summer?#$e#Stop by my place if you're looking for somewhere to cool off.",
  "CDE_Sam_fallMon10y1":"You're the best, @. I can't wait for my dad to meet you when he gets back.$l",
  "CDE_Sam_fallMon10":"I told my dad, \"Look, Dad, you don't have to hide stuff from me. I'm not a kid anymore.\"$s#$b#For one second, he looked like he might actually open up, but then he just stood up, did this weird smirk, and walked away.$s#$e#I think he'll never give up wanting to protect me. If it hasn't happened now, it probably won't ever happen.$s",
  "CDE_Sam_fallMon6y1":"Band practice went awesome last week. Abby and Sebastian have been putting in a lot of hard work.",
  "CDE_Sam_fallMon6":"My dad? Yeah, I dunno. It's easier just to stay out of his way most of the time.",
  "CDE_Sam_fallMon2":"I like taking walks in the forest this time of year. The temperature is so comfortable.#$e#...$h",
  "CDE_Sam_fallTue8":"I did a little cleaning up around the house to make things easier for my mom, but she doesn't actually seem any happier.#$e#She was thankful, but... I dunno. She's always saying that's her biggest source of stress. I'm not so sure, though.",
  "CDE_Sam_fallTue6":"After Dad left for his tour, I made a conscious decision to give Vince the best childhood he can get.#$e#I realized, if I don't help make that happen for him, who else will?",
  "CDE_Sam_fallWed10":"It's tough for me to focus on writing lyrics lately. I think some of my muse came from feeling isolated in this town.#$e#But that's... not really an issue anymore.$l",
  "CDE_Sam_fallWed8":"Been cooking any pizza lately? Man, I could really go for a slice.",
  "CDE_Sam_fallWed6":"I think I'm becoming a pizza purist. Toppings are nice, but if you get just the right blend of cheeses, that's all you really need.#$e#I wish I could cook.$s",
  "CDE_Sam_fallWed4":"My mom makes pretty awesome pizza, as long as she doesn't put any weird toppings on it.#$e#Don't tell her, but the pizza at the saloon is downright perfection. Gus knows his stuff.",
  "CDE_Sam_fallThu6y1":"I think my Dad might be coming back next year.#$e#I guess that's kind of soon. Weird.",
  "CDE_Sam_fallThu6":"I guess I should start thinking about moving out soon...$s#$e#...But I would miss Mom's fish casserole, so I dunno...$s#$e#I hate making decisions.",
  "CDE_Sam_fallThu4+fallSat2":"Hi @.#$e#Hmm... I wonder if I could grow a cactus in my room?",
  "CDE_Sam_fallFri8":"I got my paycheck yesterday. Hmm... should I save it or should I spend it...",
  "CDE_Sam_fallFri6":"...I stayed up late playing games on my computer last night. I really wish I'd focused on writing some more lyrics.",
  "CDE_Sam_fallSat8":"$d Joja#So glad I have the day off. Working at JojaMart's been really grating on me lately.|I was looking at the exhibit displays during my shift at the museum. We've got some pretty cool stuff in there.",
  "CDE_Sam_fallSat4":"I'm lucky to have the biggest room in the house to myself.#$e#I guess there's advantages to being the oldest child.",
  "CDE_Sam_fallSun8":"@, what gets you out of the Sunday-night blues? Y'know, when you have to go back to work the next day?#$e#Oh, right. You never take a day off.#$b#Well, you must really love what you do, then. I'm envious.$h", 
  "CDE_Sam_fallSun6":"It's hard to have fun on Sunday... I keep thinking about having to go to work tomorrow.$s",
  "CDE_Sam_fallSun2":"Oh man, I scraped my knee so badly on my skateboard a couple days ago.#$e#Nahh, it doesn't hurt. Just a little battle damage.",
  "CDE_Sam_winterMon10":"Hey, if we lived together, would you get annoyed at me playing guitar too loud?#$e#There's no wrong answer. It'd be whatever worked for you.",
  "CDE_Sam_winterMon8":"Vince is looking forward to the Feast of the Winter Star. I'm coming up with ideas for how to make it extra special for him this year.",
  "CDE_Sam_winterMon4":"We had another good band practice this weekend! Things are coming along.$h#$e#Oh, don't worry, I'm definitely getting you tickets to our first show.",
  "CDE_Sam_winterMon2":"Everyone's indoors during the winter, so I can play guitar as loud as I want.$h",
  "CDE_Sam_winterTue8":"Penny and I used to hang out a lot when we first moved here.#$e#We still hang out occasionally, and we've got this weird, almost... flirty? ...thing going, but we don't have a lot in common anymore.$s",
  "CDE_Sam_winterTue8_inlaw_Penny":"I'm glad things worked out for you and Penny! I always kinda wondered about her.$h",
  "CDE_Sam_winterWed10":"Heyyy... you aren't... 'hiring' at your farm, or anything, are you?$l", 
  "CDE_Sam_winterWed6":"$d Joja#I know our jobs are kinda crap, but it'd be nice if Shane was a little friendlier at work to pass the time.|I wonder how Shane's doing? He always seemed like he hated his JojaMart job even more than I did.",
  "CDE_Sam_winterThu4y1":"I think my Dad is coming back this spring.#$e#It's been 3 years since I've seen him. This is going to be strange.",
  "CDE_Sam_winterThu4":"Dad's been back for a while now. I guess I'm finally getting used to it.",
  "CDE_Sam_winterFri6":"Vince and I had an epic snowball fight yesterday. We're almost getting evenly matched.$h#$e#A couple more years, and I'll legitimately have to watch my back.",
  "CDE_Sam_winterFri4":"I'm hoping for some more dry, powdery snow before everything outside turns to slush.",
  "CDE_Sam_winterFri10":"@! It's so good to see you!$h#$e#Give me a hug. ...Ooh! You're nice and warm!$l",
  "CDE_Sam_winterFri8":"Snowboarding's a lot of fun, but I've only been a couple times. Too bad there aren't any good slopes nearby...",
  "CDE_Sam_winterSat6":"After we moved here, Penny and I grew up together. Now she's my little brother's teacher. How does that even happen?#$e#Maybe it's high time I actually get a move on my life. Sebastian's got the right idea.#$e#You do, too, for that matter.",
  "CDE_Sam_winterSun10":"Maybe if I moved out, my mom would finally be a little happier.#$e#I wonder if she's stressed just because she's worried about me?",
  "CDE_Sam_winterSun6":"Try not to make a mess in the house. My Mom's pretty obsessive about keeping things clean.#$e#It's uh... actually a legit struggle sometimes...$s",
  "CDE_Sam_winterSun4":"I caught Vince at the door with wet shoes. Glad I caught him before he went running into the kitchen.",

  //generic weekday dialogue

  "CDE_Sam_Thu":"My dad dropped by your farm, right?",

  //Sam's Married Dialogue

  //weather specific dialogue
  
  "CDE_Sam_Married_RainyDay_1": "Might be a good day to sit back and jam on the guitar.#$e#Hey, you can relax too if you want.",
  "CDE_Sam_Married_RainyDay_2": "Hey, sweet. Looks like good ol' nature's doing your work for you today. Take advantage of that!",
  "CDE_Sam_Married_RainyDay_3": "Do you think Sebastian and Abigail will ever hook up? Heh... now that I'm married I'm trying to get everyone else married too.",
  "CDE_Sam_Married_RainyDay_4": "Sebastian's a few years older than me. I never expected I'd beat him to the punch with tying the knot.",
  "CDE_Sam_Married_RainyDay_5": "Hey, I found one of these rolling around in the back of a drawer. [90 88 86 535]I thought you might be able to use it.",
  "CDE_Sam_Married_RainyDay_6": "Aw man, I was gonna go skateboarding today.$s",
  "CDE_Sam_Married_RainyDay_7": "Aw, man. These cloudy days are kind of a drag...$7",
  "CDE_Sam_Married_RainyDay_8": "Maybe today's a good day for me to give Punkman 2 another try. I never did beat that game.",
  "CDE_Sam_Married_RainyDay_9": "How'd you sleep? The sound of rain really makes me zonk.",
  "CDE_Sam_Married_RainyDay_10": "I hope my mom's mood is okay today. At least she won't have to worry about me tracking footprints in the house.",

  "CDE_Sam_Married_RainyNight_1": "Hey, how was your day? I just lay around and read comics most of the day... it was great.$h",
  "CDE_Sam_Married_RainyNight_2": "I love living here, with no neighbors! I cranked my amp up to eleven!$h",
  "CDE_Sam_Married_RainyNight_3": "It was a pretty low-key day for me... colas, frozen pizza, a few hours noodling around on the guitar. I feel relaxed.",
  "CDE_Sam_Married_RainyNight_4": "It'll be fun when Vince grows up a bit, into a teenager. Think he could crash here for movie nights?",
  "CDE_Sam_Married_RainyNight_5": "Earlier, I listened to our live recording from that show we played. Remember that? Man, was that sloppy.#$b#It made me a little nervous that you were there, I didn't want to mess up and have you think I was a loser!$l",
  "CDE_Sam_Married_RainyNight_6": "I hope Vincent's got enough role models helping to bring him up, especially since I'm not around all the time.#$e#You know, he's probably going to be fine. It's not like I moved across the country, or anything.",
  "CDE_Sam_Married_RainyNight_7": "I hope Vincent's not too lonely now that I'm gone... I kinda felt responsible for the little guy.$s#$b#But, life's all about change... right? Kids need to learn that, eventually... Or else adulthood will destroy them.$7",
  "CDE_Sam_Married_RainyNight_8": "Hey, I tossed a couple frozen pizzas into the oven. Here's yours. [206]$h",
  "CDE_Sam_Married_RainyNight_9": "Here you go. The only frozen pizza we had was barbecue chicken. Sorry, I had the four-cheese. [206]",

  "CDE_Sam_Married_IndoorDay_1": "Phew... I'll tell you one thing I don't miss about my old life... working at JojaMart.",
  "CDE_Sam_Married_IndoorDay_2": "I'll get some cleaning done today. At least that's one good thing I learned from my old job.",
  "CDE_Sam_Married_IndoorDay_3": "Hey, I made you some instant pancakes. Enjoy. [211]$h#$e#What? I never learned to cook... mom always did that.",
  "CDE_Sam_Married_IndoorDay_4": "I just finished making some pancakes. Here you go! [211]$hI consider myself to be an instant pancake connoisseur. Just... you probably don't want me to try cooking much else.",
  "CDE_Sam_Married_IndoorDay_5": "Hey. I know I joke around a lot, but I want you to know that I seriously love you...$l",
  "CDE_Sam_Married_IndoorDay_6": "Oh! 'Morning. Does my hair look okay today?$l",
  "CDE_Sam_Married_IndoorDay_7": "Do you have big plans for the day?#$e#Oh, not me... I usually decide what to do a few moments beforehand...",
  "CDE_Sam_Married_IndoorDay_8": "Let's see... what should I do today?#$e#I might play some old favorites on my guitar.",
  "CDE_Sam_Married_IndoorDay_9": "Maybe Sebastian's going to be online later. I kinda feel like playing video games today.",
  "CDE_Sam_Married_IndoorDay_10": "Um... Maybe I'll help out on the farm some other day. I feel lazy today.$s#$e#You're not mad?",

  "CDE_Sam_Married_IndoorNight_1": "Hey, you look tired. Let me help you relax tonight, okay? Maybe I'll give you a massage later.",
  "CDE_Sam_Married_IndoorNight_2": "Whoa, you're home! Guess that's my cue. OK, relax-o time for you! [184 346 206]",
  "CDE_Sam_Married_IndoorNight_3": "My day? Oh... I can hardly remember. I didn't really do anything of note. Just relaxed and had a good time.",
  "CDE_Sam_Married_IndoorNight_4": "I dusted and swept today. And I cleaned the kitchen. See? I do stuff sometimes, too.",
  "CDE_Sam_Married_IndoorNight_5": "Hey, sorry I didn't make the bed. You know I'm sloppy... that's why you like me, right?$h",
  "CDE_Sam_Married_IndoorNight_6": "Me? Oh, I got caught up on some shows today. I'm feelin' a bit stir crazy; they were kinda intense.",
  "CDE_Sam_Married_IndoorNight_7": "The only thing I miss about living at home is Mom's fish casserole.",
  "CDE_Sam_Married_IndoorNight_8": "Hey. I kinda missed you today. I went looking for you at one point, but I figured you were probably busy.",
  "CDE_Sam_Married_IndoorNight_9": "Ready to hit the hay? I actually made the bed for once...",
  "CDE_Sam_Married_IndoorNight_10": "Want me to play you a guitar lullaby? I'm in no rush to fall asleep, myself, but you're probably pretty tired.",
  
  //locational specific dialogue

  "CDE_Sam_Married_funLeave_1":	"I'm gonna visit the family today, okay? I'll be home in the evening.",
  "CDE_Sam_Married_funLeave_2":	"I've gotta check in on my family today. Seeya tonight!",
  "CDE_Sam_Married_funReturn_1": "Seeing family is nice, but it's also kind of depressing in a weird way. Like... our lives are totally separate now, and everything feels more formal than it used to.$7",
  "CDE_Sam_Married_funReturn_2": "My family's doing alright, but they're all struggling with something or other. I hope it's cool with you if I see 'em again soon.$7",
  
  "CDE_Sam_Married_OneKid_1": "It's weird, but I really like being a father!$h",
  "CDE_Sam_Married_OneKid_2": "*yawn* Man oh man, I'm definitely feeling a new appreciation for stay-at home parents.$s",
  "CDE_Sam_Married_OneKid_3": "I think we should have another kid. Why stop now?",
  "CDE_Sam_Married_OneKid_4": "Sure, being a dad is way more exhausting than I imagined, but I'm up for a challenge!$h",
  "CDE_Sam_Married_TwoKids_1": "I woke up early, fed the kids and changed their diapers! We're all set. You can just focus on raking in that sweet money.$h#$e#I'm just kidding... I didn't marry you for the money.",
  "CDE_Sam_Married_TwoKids_2": "Two kids... Crazy. Well, if my mom can survive it, so can I!",
  "CDE_Sam_Married_TwoKids_3": "We have to make sure and give %kid1 a lot of attention now that we have %kid2. We don't want any jealousy between them.",
  "CDE_Sam_Married_TwoKids_4": "It's fun to see the babies playing with each other. I think they're going to be very close.",
  "CDE_Sam_Married_TwoKids_5": "I think I'll do a private concert for the kids today. That's the only kind of audience I really need!$u",
  "CDE_Sam_Married_TwoKids_6": "I never thought I'd become such a family man, but I'm really satisfied with what we've built here. Life is going great.$l",
  "CDE_Sam_Married_TwoKids_7": "My parents are still pretty young. They could easily live to see great grandbabies. Or maybe even great-great grandbabies!$u",

  "CDE_Sam_Married_Outdoor_1": "Maybe I should get some off-road wheels for my skateboard. Mayor Lewis can't touch me out here.$h",
  "CDE_Sam_Married_Outdoor_2": "Hah, if it weren't for all the trees in the way, you could probably see my old house from here. Kinda funny, isn't it?$h",
  "CDE_Sam_Married_Outdoor_3": "I always keep an eye on the wide blue sky... you never know when a UFO might go by.",
  "CDE_Sam_Married_Outdoor_4": "This quiet kind of morning... It's nice. It's probably healthier than being some kind of tweaked out rockstar.",
  "CDE_Sam_Married_Outdoor_5": "Hey, got a good feeling about today? I don't wanna throw off your morning routine.",
  "CDE_Sam_Married_Outdoor_6": "Hi, @! If I knew more about farm work I'd help you out more. Sorry!#$e#I'll try and help you with encouraging thoughts.$h",
  "CDE_Sam_Married_Outdoor_7": "Something in the air makes me feel positive... maybe it's the faint whiff of pizza from Gus' ovens.",
  "CDE_Sam_Married_Outdoor_8": "Do I ever miss living in the city? Ha, nope. Not a bit.$h",
  "CDE_Sam_Married_Outdoor_9": "Wow... you look great today, and the specks of mud just add some extra charm.$l",
  "CDE_Sam_Married_Outdoor_10": "Hoo... I was thinking I didn't sleep so well last night. But just stepping out here makes me feel awake all the sudden!",
  
  //Festival Specific Dialogue

  //Date Specific Dialogue

  "CDE_Sam_Married_spring3":"I went and got some allergy meds. I don't like using 'em, though. I just feel really spacey.$s",
  "CDE_Sam_Married_spring8":"Sebastian lent me a big ol' stack of his comics. That pretty much carves out my reading for the next month.$h",
  "CDE_Sam_Married_spring16":"It's kind of weird, knowing I'll never be a kid again.#$b#But... knowing my old track record, maybe that's a really good thing.$h",
  "CDE_Sam_Married_spring25":"How many days until summer now? Heh, I can't wait.",
  "CDE_Sam_Married_summer5":"I hope tomorrow's a good day to hit up the halfpipe.#$e#You wanna come by and watch me for a bit?",
  "CDE_Sam_Married_summer12":"It was nice seeing Penny at the festival yesterday. We only hang out every once in a while these days.#$b#Plus, now that I'm married to you, there's less awkwardness hanging in the air between her and me.",
  "CDE_Sam_Married_summer17":"Today marks the anniversary of when my family moved to Pelican Town.#$b#Or... I think it was this day?$s#$e#Maybe I'll ask my mom.",
  "CDE_Sam_Married_fall4":"This is Abby's favorite season, right? I bet she's enjoying herself.#$e#I noticed, whenever she's in a good mood, Sebastian seems to be pretty happy, too.",
  "CDE_Sam_Married_fall9":"I keep getting the sense that some people think we got married too young.$7#$b#Look, I get how they could think that, but I just want to let you know that for me, this is real.$s#$b#We can do this, right? I'm on board... you're on board...#$e#We're gonna conquer the world together.",
  "CDE_Sam_Married_fall13":"I thought Pelican Town was a prime spot for doing things how you want, but... dang. On this farm, we really can do whatever we want, huh?$u",
  "CDE_Sam_Married_fall23":"One year, I went a bit overboard with Vincent on the Spirit's Eve candy.#$b#That was a mistake. Poor little guy couldn't keep it all down. So gross.$h#$e#Uh, yeah, Mom cleaned it up. I felt pretty bad.$s#$e#Not doing that again. Don't worry.",
  "CDE_Sam_Married_winter3":"So, does anything actually grow in winter...? Or...",
  "CDE_Sam_Married_winter14":"If you're not as busy this season, is there a day that we can just spend lounging around? I really kinda miss you.$l",
  "CDE_Sam_Married_winter20":"I hope Vincent gets everything he wants this year for the Feast. I love seeing that kid open presents.",
  "CDE_Sam_Married_winter26":"I wonder how my dad's doing...$7"

  //Season specific dialogue

  //Affection specific dialogue
}
