{ //NPC Dialogue
  //Vincent Gift Tastes
  "CDE_Vincent_GoldPumpkin": "*gasp* I knew it was real! The golden pumpkin is real!$h#$e#Mom didn't believe me that it's real, but it's real!",
  "CDE_Vincent_RockCandy": "You mean this candy will give me tons of extra energy? *crunch*#$b#...#$b#I don't feel any different.#$e#Tastes yummy, though! Thanks!$h",
  "CDE_Vincent_Pearl": "Cool! A marble!",
  "CDE_Vincent_PrismaticShard": "Is this candy? It looks really good!$h",
  "CDE_Vincent_CranberryCandy": "Mom says I can't have anymore candy today, except if it's a gift from you, then it's a 'special occasion.'#$b#Yayyy!$h",
  "CDE_Vincent_GingerAle": "I love soda!#$b#...#$b#It makes you burp!",
  "CDE_Vincent_Grape": "These taste like purple popsicles, but not frozen! Thanks, Mx. @!",
  "CDE_Vincent_PinkCake": "Wowww. That looks... amazing.$u#$b#I can't believe you're giving it to me!$h#$e#Oh yeah, thank you!",
  "CDE_Vincent_Snail": "...Cool!",

  //Vincent's Misc Dialogue
  //these lines target files other than the standard characters/dialogue/npc location such as unmarried rainy dialogue
  //Apparently, Vincent has no rainy day dialogue, not in my mod nor in the base game.

  //date specific dialogue
  //to keep consistency with other tokens, i've removed the _ from date specific tokens and heart specific tokens, so that the key identifier is grouped within one segment. (_summer6 became _summer6)
  "CDE_Vincent_spring12": "Finally! The egg festival is tomorrow!$h#$e#I always find the eggs that all the grown-ups are too tall to notice.$h",
  "CDE_Vincent_fall26": "It's Spirit's Eve tomorrow! I'm gonna get so scared!$h",
  "CDE_Vincent_winter24": "Feast of the Winter Star! I can't believe it's finally happening tomorrow!$h#$e#Are you excited, too?",
  "CDE_Vincent_winter28": "I get to stay up until midnight tonight!",
  "CDE_Vincent_spring1": "I am so happy today! Eeeeee!$h",

  //heart specific dialogue
  //lines had to be moved from heart specific to a generic weekday dialogue section. those lines are only visible if the player doesnt meet any conditions for other dialogue or if there is no higher priority dialogue for that situation. Seasonal specific dialogue is sorted higher than dialogue without a season attached.
  //to make it easier to track here, i've changed the _1 for year to y1. ideally, all of the information i need for pairing the key to the token should be found after the npc's name, as one segment without _ separators.

  //i've been advised that for vincent specifically we may want to change the year qualifiers to a GSQ to see if kent has returned or not. we can revisit that when we are done migrating.

  "CDE_Vincent_summerMon10": "I'm bored. I wanna go on an adventure. When I'm older, I want to visit every single island in the gem sea.",
  "CDE_Vincent_summerTue4": "What's your favorite flavor of ice cream?#$e#Mine's mint chip.",
  "CDE_Vincent_summerWed6": "The rock-climbing wall is pretty fun, but I've climbed it so many times.",
  "CDE_Vincent_summerThu10": "I heard all the dinosaurs died out a long time ago. Is that true? Mr. Gunther says there are still tons of them living underground. But only some of the species.",
  "CDE_Vincent_summerFri10": "Ugh, I have a headache. Mom says it's 'cause I didn't drink enough water.$s#$e#I drank a lot of juice. Juice has water in it.$s#$e#What kind of juice? Orange soda.$s",

  "CDE_Vincent_fallMon10": "If I had a pet dinosaur, I'd name him Chompy. I wouldn't want him to chomp any people, though. Only bad guys.",
  "CDE_Vincent_fallWed8": "My big brother lets me try his guitar every once in a while.#$e#I can't play anything, though. I don't think I'll ever be as good as him.",
  "CDE_Vincent_fallThu8": "Jas is pretty cool. And not just for a girl, either.#$e#She's really smart, too.",
  "CDE_Vincent_fallThu4": "I tried throwing a gridball back and forth once with that guy Alex, but I couldn't keep up with how far he'd throw.",
  "CDE_Vincent_fallSat10": "Sam got me to try some of mom's fish casserole. It's kind of gross, but it also has cheese and noodles in it.#$b#So that makes it kind of good.",
  "CDE_Vincent_fallSun4": "There's so much mud outside!#$e#Mom's not a big fan.",

  "CDE_Vincent_winterTue4": "I built a block tower yesterday that was even taller than my brother!$h#$e#I had to stand on a stool to make it.",
  "CDE_Vincent_winterThu10": "I had a bad dream last night.$s#$e#I dreamt that Dad was gone again. Forever.$s#$e#I know. It's not real. But it was still scary.$s",
  "CDE_Vincent_winterFri10": "A long time ago, I hit Jas when we were playing.$u#$e#I always make sure I'm nice to her now.",
  "CDE_Vincent_winterSat10": "Hey! Wanna play in the snow?#$e#The snow is perfect today for the best snowballs ever!",

  //how likely is the player to have 10 hearts with vincent in year 1? should these lines be visible earlier?
  "CDE_Vincent_Mon10y1": "@, maybe you can be my dad until my real dad comes back!^Even though you're a girl, maybe you can be my dad until my real dad comes back.",
  "CDE_Vincent_Mon10": "@, was your dad ever like mine?$u",
  "CDE_Vincent_Mon8y1": "Mom gave me a haircut. She's the one who usually does it.#$e#A long time ago, Sam gave me a haircut. He got in big trouble!$h",
  "CDE_Vincent_Mon8": "Mom made me stop playing just to show me Dad sleeping in.$u#$e#Then she started crying. It was really weird.$u",
  "CDE_Vincent_Mon2": "My brother's really good at video games. I like watching him play more than I like playing against him.",
  "CDE_Vincent_Tue8inlawPenny": "It's so cool how you're married to my teacher.#$e#I never thought that would have happened!",
  "CDE_Vincent_Tue6": "Sam threw out some of his old computer games after Dad got back.$u#$e#I think they were the shooting ones.$u",
  "CDE_Vincent_Tue4": "I like to collect Foroguemon cards.#$e#My big brother only plays with me sometimes, though.",
  "CDE_Vincent_Wed8": "I wanna look for bugs, but Mom gets mad when I'm all dirty.#$b#It's a tough choice.",
  "CDE_Vincent_Wed6": "I found a millipede outside yesterday.#$b#Is it really called a millipede because they have a million legs?",
  "CDE_Vincent_Wed4": "There's spring onions out in the forest. Do you know how to find them?#$e#The taste of them is pretty bad, though. I just like hunting for 'em.",
  "CDE_Vincent_Thu8": "If I had a farm like you, I'd want it to be a candy farm!$h#$e#I know, I know, I'm just being silly.",
  "CDE_Vincent_Thu6": "It's fun living so close to Marnie's Ranch.#$e#I saw a cow wink at me one time.",
  "CDE_Vincent_Fri8": "Sam used to be kind of mean to me when I was little. But these days, he's a lot nicer to me.",
  "CDE_Vincent_Fri4": "Do you grow anything good on your farm?",
  "CDE_Vincent_Fri2": "Mom said she's making yellow curry tonight. Does that have curry powder in it?$u#$e#It does? Awwwww.$s",
  "CDE_Vincent_Sat10": "I wish Dad would play with me more...$u",
  "CDE_Vincent_Sat8": "I had a bad dream last night.$s#$e#I dreamt that Dad was gone again. Forever.$s#$e#I know. It's not real. But it was still scary.$s",
  "CDE_Vincent_Sat6y1": "*sigh*... When's Dad coming back?$s",
  "CDE_Vincent_Sat4": "I'm having fun today! Are you?",
  "CDE_Vincent_Sat2": "Do you know anyone in the army? That's where my dad works.",
  "CDE_Vincent_Sun8": "I tried some of Mom's yellow curry. It was actually really good.#$b#But ONLY because of the sauce. Vegetables are still icky.",
  "CDE_Vincent_Sun4": "Ms. Penny makes me read a new book every week.$s#$b#At least she lets me pick them, sometimes!",

  //you wrote +Tue10 here, but the line is keyed to Tue8hearts in vincent.json. i reordered the keys so that highest priority token came first.
  //some of these are redundant, like fallSat10y1 and Sat10y1, and Sat and Sat6. we can add a comment to the end of the line for keys like this if its specifically imporatant that the line show up on sats with 6 hearts, and on any other saturdays when no more specific conditions have been met. otherwise i recommend moving them to generic weekday dialogue and freeing up the heart key. if no other key takes priority this would result in the line showing up on Sat6, otherwise lines with more importance would cover it up. 

  "CDE_Vincent_summerSat10+summerSat6y1": "Sam showed me this music video with a bunch of dancing crabs. It's so funny!#$e#If I saw dancing crabs in real life at the beach, I'd be like, 'Whaaaat?'$h",
  "CDE_Vincent_summerSun10+Thu4": "How long can you hold your breath?#$b#I can hold mine for... eight minutes.#$e#Yuh-huh. I can.#$e#...But I just don't want to right now.",
  "CDE_Vincent_fallSat10y1+Sat10y1": "@, was your dad around much when you were a kid?$u",
  "CDE_Vincent_winterSun10+Tue2": "Red flavored gummies are really good, but the purple kind in this new brand is really REALLY good.#$e#The only problem? The other colors that come with the purple kind aren't as good.#$b#Hmmmmmmmmm...",
  "CDE_Vincent_Tue8+Tue6y1": "Can you keep a secret, mister?^Can you keep a secret, miss?$u#$b#I wanna marry Miss Penny when I grow up.#$e#Just don't tell her, okay?$u",
  "CDE_Vincent_Sat6+Sat": "Dad seems weird since he came back. I wonder what happened to him?$s",
  "CDE_Vincent_Sat8y1+Sat4y1": "My dad's gone, but Jas's mom and dad aren't around either.$u#$e#She never talks about them. And Ms. Penny says I shouldn't ask.$u",
 
  
  //generic weekday dialogue
  "CDE_Vincent_summerTue": "Hey Mister @.^Hey Miss @.#$e#Is there anyone in town who you like?#$e#Yeah, like... LIKE like.$h#$e#Aw, c'mon, tell me!",
  "CDE_Vincent_summerWed": "Whoa! Cool! You're all sweaty!",

  "CDE_Vincent_fallTue": "I've been collecting leaves. I found a bunch of really bright red ones!",
  "CDE_Vincent_fallWedinlawSam": "How's my brother doing?#$e#I guess he's a real grown-up now!",
  "CDE_Vincent_fallWed": "Did you know? My big brother is basically a rock star.$h",
  "CDE_Vincent_fallFri": "Ew, it's boiled beet night again...$s",

  "CDE_Vincent_winterMon": "I can't wait for the Feast of the Winter Star!$h#$e#I hope I get some toys! Or maybe something yummy!",
  "CDE_Vincent_winterWedinlawSam": "So are you and my brother like... really super in love?#$e#Hahaha!$h",
  "CDE_Vincent_winterWed": "Mom doesn't count hot chocolate as junk food when it's snowy.#$e#It's nice.",
  "CDE_Vincent_winterFri": "Ms. Penny's a pretty good teacher.#$b#I don't get a lot of questions right, but she's always really nice.",

  "CDE_Vincent_WedinlawSam": "How's my brother doing?#$e#I can't believe we're related now!$h",
  "CDE_Vincent_Fri": "Oh no... Mom's making lentil soup tonight.$s",
  "CDE_Vincent_Saty1": "Dad's coming back soon!#$b#I hope he brings me some toys.$u"
}